[
  {
    "id": 1,
    "name": "Albedo",
    "description": "A genius known as the Kreideprinz, he is the Chief Alchemist and Captain of the Investigation Team of the Knights of Favonius.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "geo",
    "profileImage": "albedo",
    "statGrow": "geoDamageBonus",
    "normalBossDrops": "Basalt Pillar",
    "normalBossDropsImage": "basaltpillar",
    "ascensionMats": "Cecilia",
    "ascensionMatsImage": "cecilia",
    "talentBooks": "Ballad",
    "weeklyBossDrops": "Tusk of Monoceros Caeli",
    "weeklyBossDropsImage": "tuskofmonoceroscaeli",
    "constellations": [
      {
        "name": "Flower of Eden",
        "description": "Transient Blossoms generated by Albedo's <span style=\"color: #FFD780FF;\">Abiogenesis: Solar Isotoma</span> regenerate 1.2 Energy for Albedo."
      },
      {
        "name": "Opening of Phanerozoic",
        "description": "Transient Blossoms generated by <span style=\"color: #FFD780FF;\">Abiogenesis: Solar Isotoma</span> grant Albedo Fatal Reckoning for 30s:\\n·Unleashing <span style=\"color: #FFD780FF;\">Rite of Progeniture: Tectonic Tide</span> consumes all stacks of Fatal Reckoning. Each stack of Fatal Reckoning consumed increases the DMG dealt by Fatal Blossoms and Rite of Progeniture: Tectonic Tide's burst DMG by 30% of Albedo's DEF.\\n·This effect stacks up to 4 times."
      },
      {
        "name": "Grace of Helios",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Abiogenesis: Solar Isotoma</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Descent of Divinity",
        "description": "Active party members within the Solar Isotoma field have their Plunging Attack DMG increased by 30%."
      },
      {
        "name": "Tide of Hadean",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Rite of Progeniture: Tectonic Tide</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Dust of Purification",
        "description": "Active party members within the Solar Isotoma field who are protected by a shield created by Crystallize have their DMG increased by 17%."
      }
    ],
    "passives": [
      {
        "name": "Calcite Might",
        "description": "Transient Blossoms generated by <span style=\"color: #FFD780FF;\">Abiogenesis: Solar Isotoma</span> deal 25% more DMG to opponents whose HP is below 50%."
      },
      {
        "name": "Homuncular Nature",
        "description": "Using <span style=\"color: #FFD780FF;\">Rite of Progeniture: Tectonic Tide</span> increases the Elemental Mastery of nearby party members by 125 for 10s."
      },
      {
        "name": "Flash of Genius",
        "description": "When Albedo crafts Weapon Ascension Materials, he has a 10% chance to receive double the product."
      }
    ],
    "burst": {
      "name": "Rite of Progeniture: Tectonic Tide",
      "description": "Under Albedo's command, Geo crystals surge and burst forth, dealing <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> in front of him.\\nIf a Solar Isotoma created by Albedo himself is on the field, 7 Fatal Blossoms will be generated in the Solar Isotoma field, bursting violently into bloom and dealing <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\n\\nTectonic Tide DMG and Fatal Blossom DMG will not generate Transient Blossoms.\\n\\n<i>Under the Kreideprinz's command, the tectonic tide of creation seethes into life.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Favonius Bladework - Weiss",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Abiogenesis: Solar Isotoma",
      "description": "Albedo creates a Solar Isotoma using alchemy, which deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> on appearance.\\n\\n<span style=\"color: #FFD780FF;\">Solar Isotoma</span>\\nhas the following properties:\\n·When opponents within the Solar Isotoma field take DMG, the Solar Isotoma will generate Transient Blossoms which deal <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>. DMG dealt scales off Albedo's DEF. \\n·Transient Blossoms can only be generated once every 2s.\\n·When a character is located at the locus of the Solar Isotoma, the Solar Isotoma will accumulate Geo power to form a crystallized platform that lifts the character up to a certain height. Only one crystallized platform can exist at a time.\\n·Solar Isotoma is considered a <span style=\"color: #FFE699FF;\">Geo construct</span>. Only one Solar Isotoma created by Albedo himself can exist at a time. \\n\\n<span style=\"color: #FFD780FF;\">Hold</span> to designate the location of the skill.\\n\\n<i>This Geo bloom has an unusual property mirrored in the aim of alchemy. To rise from the earth, soar into the sky, and become the sun.</i>",
      "priority": 5
    }
  },
  {
    "id": 2,
    "name": "Aloy",
    "description": "Formerly an outcast, now a hunter of unparalleled aptitude. Ready to do the right thing with her bow at any given time.",
    "weapon": "bow",
    "rarity": "legendary",
    "vision": "cryo",
    "profileImage": "aloy",
    "statGrow": "cryoDamageBonus",
    "normalBossDrops": "Crystalline Bloom",
    "normalBossDropsImage": "crystallinebloom",
    "ascensionMats": "Crystal Marrow",
    "ascensionMatsImage": "crystalmarrow",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Molten Moment",
    "weeklyBossDropsImage": "moltenmoment",
    "constellations": [
      {
        "name": "Star of Another World",
        "description": "The time has not yet come for this person's corner of the night sky to light up."
      },
      {
        "name": "Star of Another World",
        "description": "The time has not yet come for this person's corner of the night sky to light up."
      },
      {
        "name": "Star of Another World",
        "description": "The time has not yet come for this person's corner of the night sky to light up."
      },
      {
        "name": "Star of Another World",
        "description": "The time has not yet come for this person's corner of the night sky to light up."
      },
      {
        "name": "Star of Another World",
        "description": "The time has not yet come for this person's corner of the night sky to light up."
      },
      {
        "name": "Star of Another World",
        "description": "The time has not yet come for this person's corner of the night sky to light up."
      }
    ],
    "passives": [
      {
        "name": "Combat Override",
        "description": "When Aloy receives the Coil effect from <span style=\"color: #FFD780FF;\">Frozen Wilds</span>, her ATK is increased by 16%, while nearby party members' ATK is increased by 8%. This effect lasts 10s."
      },
      {
        "name": "Strong Strike",
        "description": "When Aloy is in the Rushing Ice state conferred by <span style=\"color: #FFD780FF;\">Frozen Wilds</span>, her <span style=\"color: #99FFFFFF;\">Cryo DMG Bonus</span> increases by 3.5% every 1s. A maximum <span style=\"color: #99FFFFFF;\">Cryo DMG Bonus</span> increase of 35% can be gained in this way."
      },
      {
        "name": "Easy Does It",
        "description": "When Aloy is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them."
      }
    ],
    "burst": {
      "name": "Prophecies of Dawn",
      "description": "Aloy throws a Power Cell filled with Cryo in the targeted direction, then detonates it with an arrow, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<i>Whether \"Zero Dawn\" referred to hope or extinction no longer matters. Aloy has already saved her world, and the fate of this one is still being forged by its own heroes.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Rapid Fire",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, biting frost will accumulate on the arrowhead. A fully charged frost arrow will deal <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Frozen Wilds",
      "description": "Aloy throws a Freeze Bomb in the targeted direction that explodes on impact, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span>. After it explodes, the Freeze Bomb will split up into many Chillwater Bomblets that explode on contact with opponents or after a short delay, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\nWhen a Freeze Bomb or Chillwater Bomblet hits an opponent, the opponent's ATK is decreased and Aloy receives 1 Coil stack.\\nAloy can gain up to 1 Coil stack every 0.1s.\\n\\n<span style=\"color: #FFD780FF;\">Coil</span>\\n·Each stack increases Aloy's Normal Attack DMG.\\n·When Aloy has 4 Coil stacks, all stacks of Coil are cleared. She then enters the Rushing Ice state, which further increases the DMG dealt by her Normal Attacks and converts her Normal Attack DMG to <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n\\nWhile in the Rushing Ice state, Aloy cannot obtain new Coil stacks.\\nCoil effects will be cleared 30s after Aloy leaves the field.\\n\\n<i>You think that's cold? Guess you've never been to The Cut.</i>",
      "priority": 4
    }
  },
  {
    "id": 3,
    "name": "Amber",
    "description": "Always energetic and full of life, Amber's the best — albeit only — Outrider of the Knights of Favonius.",
    "weapon": "bow",
    "rarity": "rare",
    "vision": "pyro",
    "profileImage": "amber",
    "statGrow": "atkPercent",
    "normalBossDrops": "Everflame Seed",
    "normalBossDropsImage": "everflameseed",
    "ascensionMats": "Small Lamp Grass",
    "ascensionMatsImage": "smalllampgrass",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Dvalin's Sigh",
    "weeklyBossDropsImage": "dvalinssigh",
    "constellations": [
      {
        "name": "One Arrow to Rule Them All",
        "description": "Fires 2 arrows per <span style=\"color: #FFD780FF;\">Aimed Shot</span>. The second arrow deals 20% of the first arrow's DMG."
      },
      {
        "name": "Bunny Triggered",
        "description": "Baron Bunny, new and improved! Hitting Baron Bunny's foot with a fully-charged Aimed Shot manually detonates it.\\nExplosion via manual detonation deals 200% additional DMG."
      },
      {
        "name": "It Burns!",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Fiery Rain</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "It's Not Just Any Doll...",
        "description": "Decreases <span style=\"color: #FFD780FF;\">Explosive Puppet</span>'s CD by 20%. Adds 1 additional charge."
      },
      {
        "name": "It's Baron Bunny!",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Explosive Puppet</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Wildfire",
        "description": "<span style=\"color: #FFD780FF;\">Fiery Rain</span> increases all party members' Movement SPD by 15% and ATK by 15% for 10s."
      }
    ],
    "passives": [
      {
        "name": "Every Arrow Finds Its Target",
        "description": "Increases the CRIT Rate of <span style=\"color: #FFD780FF;\">Fiery Rain</span> by 10% and widens its AoE by 30%."
      },
      {
        "name": "Precise Shot",
        "description": "Aimed Shot hits on weak points increase ATK by 15% for 10s."
      },
      {
        "name": "Gliding Champion",
        "description": "Decreases gliding Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Fiery Rain",
      "description": "Fires off a shower of arrows, dealing continuous <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\n\\n<i>Amber's passion truly burns hot.</i>",
      "priority": 3
    },
    "attack": {
      "name": "Normal Attack: Sharpshooter",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, flames will accumulate on the arrowhead. A fully charged flaming arrow will deal <span style=\"color: #FF9999FF;\">Pyro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 2
    },
    "elementalSkill": {
      "name": "Explosive Puppet",
      "description": "The ever-reliable Baron Bunny takes the stage.\\n\\n<span style=\"color: #FFD780FF;\">Baron Bunny</span>\\n·Continuously taunts the enemy, drawing their fire.\\n·Baron Bunny's HP scales with Amber's Max HP.\\n·When destroyed or when its timer expires, Baron Bunny explodes, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nAdjusts the throwing direction of Baron Bunny.\\nThe longer the button is held, the further the throw.\\n\\n<i>Baron Bunny hails from a storied lineage, but Amber has stopped keeping count since Baron Bunny the 893rd.</i>",
      "priority": 4
    }
  },
  {
    "id": 4,
    "name": "Arataki Itto",
    "description": "The first and greatest head of the Arataki Gang, famed throughout Inazuma City's Hanamizaka... Wait, what? You've never heard of them? Are you trying to be funny here?",
    "weapon": "claymore",
    "rarity": "legendary",
    "vision": "geo",
    "profileImage": "arataki itto",
    "statGrow": "critRate",
    "normalBossDrops": "Riftborn Regalia",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Onikabuto",
    "ascensionMatsImage": "onikabuto",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Ashen Heart",
    "weeklyBossDropsImage": "ashenheart",
    "constellations": [
      {
        "name": "Stay a While and Listen Up",
        "description": "After using <span style=\"color: #FFD780FF;\">Royal Descent: Behold, Itto the Evil!</span>, Arataki Itto gains 2 stacks of Superlative Superstrength. After 1s, Itto will gain 1 stack of Superlative Superstrength every 0.5s for 1.5s."
      },
      {
        "name": "Gather 'Round, It's a Brawl!",
        "description": "After using <span style=\"color: #FFD780FF;\">Royal Descent: Behold, Itto the Evil!</span>, each party member whose Element is <span style=\"color: #FFE699FF;\">Geo</span> will decrease that skill's CD by 1.5s and restore 6 Energy to Arataki Itto.\\nCD can be decreased by up to 4.5s in this manner. Max 18 Energy can be restored in this manner."
      },
      {
        "name": "Horns Lowered, Coming Through",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Masatsu Zetsugi: Akaushi Burst!</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Jailhouse Bread and Butter",
        "description": "When the Raging Oni King state caused by <span style=\"color: #FFD780FF;\">Royal Descent: Behold, Itto the Evil!</span> ends, all nearby party members gain 20% DEF and 20% ATK for 10s."
      },
      {
        "name": "10 Years of Hanamizaka Fame",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Royal Descent: Behold, Itto the Evil!</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Arataki Itto, Present!",
        "description": "Arataki Itto's Charged Attacks deal +70% Crit DMG. Additionally, when he uses Arataki Kesagiri, he has a 50% chance to not consume stacks of Superlative Superstrength."
      }
    ],
    "passives": [
      {
        "name": "Arataki Ichiban",
        "description": "When Arataki Itto uses consecutive Arataki Kesagiri, he obtains the following effects:\\n· Each slash increases the ATK SPD of the next slash by 10%. Max ATK SPD increase is 30%.\\n· Increases his resistance to interruption.\\n\\nThese effects will be cleared once he stops performing consecutive slashes."
      },
      {
        "name": "Bloodline of the Crimson Oni",
        "description": "Arataki Kesagiri DMG is increased by 35% of Arataki Itto's DEF."
      },
      {
        "name": "Woodchuck Chucked",
        "description": "When a party member uses attacks to obtain wood from a tree, they have a 25% chance to get an additional log of wood."
      }
    ],
    "burst": {
      "name": "Royal Descent: Behold, Itto the Evil!",
      "description": "Time to show 'em the might of the Arataki Gang! For a time, Itto lets out his inner Raging Oni King, wielding his Oni King's Kanabou in battle.\\nThis state has the following special properties:\\n· Converts Itto's Normal, Charged, and Plunging Attacks to <span style=\"color: #FFE699FF;\">Geo DMG</span>. This cannot be overridden.\\n· Increases Itto's Normal Attack SPD. Also increases his ATK based on his DEF.\\n· On hit, the 1st and 3rd strikes of his attack combo will each grant Arataki Itto 1 stack of Superlative Superstrength.\\n· Decreases Itto's Elemental and Physical RES by 20%.\\n\\nThe Raging Oni King state will be cleared when Itto leaves the field.\\n\\n<i>This is the pinnacle technique of the ultimate fighting style (according to Itto). It would be pointless for Arataki Itto to reference any other fighting styles to improve his own, for he, and no other, is the strongest, most terrible oni in the land.</i>\\n<i>Shouta thinks it looks really cool.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Fight Club Legend",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive strikes.\\nWhen the 2nd and 4th strikes hit opponents, Itto will gain 1 or 2 stacks of Superlative Superstrength, respectively.\\nMax 5 stacks. Triggering this effect will refresh the current duration of any existing stacks.\\n\\nAdditionally, Itto's Normal Attack combo does not immediately reset after sprinting or using his Elemental Skill, \"Masatsu Zetsugi: Akaushi Burst!\"\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nWhen holding to perform a Charged Attack, Itto unleashes a series of Arataki Kesagiri slashes without consuming Stamina. Instead, each Arataki Kesagiri slash consumes 1 stack of Superlative Superstrength. When the final stack is consumed, Itto delivers a powerful final slash.\\nIf no stacks of Superlative Superstrength are available, Itto will perform a single Saichimonji Slash.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 5
    },
    "elementalSkill": {
      "name": "Masatsu Zetsugi: Akaushi Burst!",
      "description": "Hurls Ushi, the young akaushi bull and auxiliary member of the Arataki Gang, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span> to opponents on hit. When Ushi hits opponents, Arataki Itto gains 1 stack of Superlative Superstrength.\\n\\nUshi will remain on the field and provide support in the following ways:\\n· Taunts surrounding opponents and draws their attacks.\\n· Inherits HP based on a percentage of Arataki Itto's Max HP.\\n· When Ushi takes DMG, Arataki Itto gains 1 stack of Superlative Superstrength. Only 1 stack can be gained in this way every 2s.\\n· Ushi will flee when its HP reaches 0 or its duration ends. It will grant Arataki Itto 1 stack of Superlative Superstrength when it leaves.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nAdjust throwing angle.\\n\\nUshi is considered a <span style=\"color: #FFE699FF;\">Geo construct</span>. Arataki Itto can only deploy 1 Ushi on the field at any one time.\\n\\n<i>The name of this technique is derived from Onibudou (a light novel series written by Junkichi). However, calling it \"Onisatsu Zetsugi\" probably constitutes copyright infringement — not to mention how Itto himself is an oni and all...</i>",
      "priority": 3
    }
  },
  {
    "id": 5,
    "name": "Barbara",
    "description": "Every citizen of Mondstadt adores Barbara. She learned the word \"idol\" from a magazine.",
    "weapon": "catalyst",
    "rarity": "rare",
    "vision": "hydro",
    "profileImage": "barbara",
    "statGrow": "hpPercent",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "cleansingheart",
    "ascensionMats": "Philanemo Mushroom",
    "ascensionMatsImage": "philanemomushroom",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Ring of Boreas",
    "weeklyBossDropsImage": "ringofboreas",
    "constellations": [
      {
        "name": "Gleeful Songs",
        "description": "Barbara regenerates 1 Energy every 10s."
      },
      {
        "name": "Vitality Burst",
        "description": "Decreases the CD of <span style=\"color: #FFD780FF;\">Let the Show Begin♪</span> by 15%.\\nDuring the ability's duration, your active character gains a 15% <span style=\"color: #80C0FFFF;\">Hydro DMG Bonus</span>."
      },
      {
        "name": "Star of Tomorrow",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Shining Miracle♪</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Attentiveness be My Power",
        "description": "Every opponent Barbara hits with her Charged Attack regenerates 1 Energy for her.\\nA maximum of 5 energy can be regenerated in this manner with any one Charged Attack."
      },
      {
        "name": "The Purest Companionship",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Let the Show Begin♪</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Dedicating Everything to You",
        "description": "When Barbara is in the party but not on the field, and one of your own party members falls:\\n·Automatically revives the fallen character.\\n·Fully restores the revived character's HP to 100%.\\nThis effect can only occur once every 15 mins."
      }
    ],
    "passives": [
      {
        "name": "Glorious Season",
        "description": "The Stamina Consumption of characters within <span style=\"color: #FFD780FF;\">Let the Show Begin♪</span>'s Melody Loop is reduced by 12%."
      },
      {
        "name": "Encore",
        "description": "When your active character gains an Elemental Orb/Particle, the duration of the Melody Loop of <span style=\"color: #FFD780FF;\">Let the Show Begin♪</span> is extended by 1s.\\nThe maximum extension is 5s."
      },
      {
        "name": "With My Whole Heart♪",
        "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."
      }
    ],
    "burst": {
      "name": "Shining Miracle♪",
      "description": "Heals your own party members and nearby teammates for a large amount of HP that scales with Barbara's Max HP.\\n\\n<i>Barbara's desire to heal strengthens her will to fight and sing.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Whisper of Water",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 water splash attacks that deal <span style=\"color: #80C0FFFF;\">Hydro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to deal <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the might of Hydro, Barbara plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> upon impact with the ground.",
      "priority": 2
    },
    "elementalSkill": {
      "name": "Let the Show Begin♪",
      "description": "Summons water droplets resembling musical notes that form a Melody Loop, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span> to surrounding opponents and applying the <span style=\"color: #80C0FFFF;\">Wet</span> status to them.\\n\\n<span style=\"color: #FFD780FF;\">Melody Loop</span>\\n·On hit, Barbara's Normal Attacks heal your own party members and nearby teammates for a certain amount of HP, which scales with Barbara's Max HP.\\n·On hit, Barbara's Charged Attack generates 4 times the amount of healing.\\n·Periodically regenerates your own active character's HP.\\n·Applies the <span style=\"color: #80C0FFFF;\">Wet</span> status to the character and to opponents who come in contact with them.\\n\\n<i>Barbara's music is the magic that heals her companions.</i>",
      "priority": 3
    }
  },
  {
    "id": 6,
    "name": "Beidou",
    "description": "Captain of her crew, The Crux. She's quite an unbound and forthright woman.",
    "weapon": "claymore",
    "rarity": "rare",
    "vision": "electro",
    "profileImage": "beidou",
    "statGrow": "electroDamageBonus",
    "normalBossDrops": "Lightning Prism",
    "normalBossDropsImage": "lightningprism",
    "ascensionMats": "Noctilucous Jade",
    "ascensionMatsImage": "noctilucousjade",
    "talentBooks": "Gold",
    "weeklyBossDrops": "Dvalin's Sigh",
    "weeklyBossDropsImage": "dvalinssigh",
    "constellations": [
      {
        "name": "Sea Beast's Scourge",
        "description": "When <span style=\"color: #FFD780FF;\">Stormbreaker</span> is used:\\nCreates a shield that absorbs up to 16% of Beidou's Max HP for 15s.\\nThis shield absorbs <span style=\"color: #FFACFFFF;\">Electro DMG</span> 250% more effectively."
      },
      {
        "name": "Upon the Turbulent Sea, the Thunder Arises",
        "description": "<span style=\"color: #FFD780FF;\">Stormbreaker</span>'s arc lightning can jump to 2 additional targets."
      },
      {
        "name": "Summoner of Storm",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Tidecaller</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Stunning Revenge",
        "description": "Within 10s of taking DMG, Beidou's Normal Attacks gain 20% additional <span style=\"color: #FFACFFFF;\">Electro DMG</span>."
      },
      {
        "name": "Crimson Tidewalker",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Stormbreaker</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Bane of Evil",
        "description": "During the duration of <span style=\"color: #FFD780FF;\">Stormbreaker</span>, the <span style=\"color: #FFACFFFF;\">Electro RES</span> of surrounding opponents is decreased by 15%."
      }
    ],
    "passives": [
      {
        "name": "Retribution",
        "description": "Counterattacking with <span style=\"color: #FFD780FF;\">Tidecaller</span> at the precise moment when the character is hit grants the maximum DMG Bonus."
      },
      {
        "name": "Lightning Storm",
        "description": "Gain the following effects for 10s after unleashing <span style=\"color: #FFD780FF;\">Tidecaller</span> with its maximum DMG Bonus: \\n·DMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%.\\n·Greatly reduced delay before unleashing Charged Attacks."
      },
      {
        "name": "Conqueror of Tides",
        "description": "Decreases swimming Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Stormbreaker",
      "description": "Recalling her slaying of the great beast Haishan, Beidou calls upon that monstrous strength and the lightning to create a Thunderbeast's Targe around herself, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> to nearby opponents.\\n\\n<span style=\"color: #FFD780FF;\">Thunderbeast's Targe</span>\\n·When Normal and Charged Attacks hit, they create a lightning discharge that can jump between opponents, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\n·Increases the character's resistance to interruption, and decreases DMG taken.\\n\\nA maximum of 1 lightning discharge can be triggered per second.\\n\\n<i>With a peal of thunder, Haishan is slain.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Oceanborne",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous slashes.\\nAt end of the sequence, perform a more powerful slash.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Tidecaller",
      "description": "Nothing to worry about. Should anyone raise a hand against her or her men, she will avenge it ten-fold with sword and thunder.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nAccumulating the power of lightning, Beidou swings her blade forward fiercely, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nLifts her weapon up as a shield. Max DMG absorbed scales off Beidou's Max HP.\\nAttacks using the energy stored within the greatsword upon release or once this ability's duration expires, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span>. DMG dealt scales with the number of times Beidou is attacked in the skill's duration. The greatest DMG Bonus will be attained once this effect is triggered twice.\\nThe shield possesses the following properties:\\n·Has 250% <span style=\"color: #FFACFFFF;\">Electro DMG</span> Absorption Efficiency.\\n·Applies the <span style=\"color: #FFACFFFF;\">Electro element</span> to Beidou upon activation.\\n\\n<i>Conquer the high seas! Pursue the waves and chase the storm!</i>",
      "priority": 4
    }
  },
  {
    "id": 7,
    "name": "Bennett",
    "description": "A good-natured adventurer from Mondstadt who's unfortunately extremely unlucky.",
    "weapon": "sword",
    "rarity": "rare",
    "vision": "pyro",
    "profileImage": "bennett",
    "statGrow": "er",
    "normalBossDrops": "Everflame Seed",
    "normalBossDropsImage": "everflameseed",
    "ascensionMats": "Windwheel Aster",
    "ascensionMatsImage": "windwheelaster",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Dvalin's Plume",
    "weeklyBossDropsImage": "dvalinsplume",
    "constellations": [
      {
        "name": "Grand Expectation",
        "description": "<span style=\"color: #FFD780FF;\">Fantastic Voyage</span>'s ATK increase no longer has an HP restriction, and gains an additional 20% of Bennett's Base ATK."
      },
      {
        "name": "Impasse Conqueror",
        "description": "When Bennett's HP falls below 70%, his Energy Recharge is increased by 30%."
      },
      {
        "name": "Unstoppable Fervor",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Passion Overload</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Unexpected Odyssey",
        "description": "Using a Normal Attack when executing the second attack of <span style=\"color: #FFD780FF;\">Passion Overload</span>'s Charge Level 1 allows an additional attack to be performed.\\nThis additional attack does 135% of the second attack's DMG."
      },
      {
        "name": "True Explorer",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Fantastic Voyage</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Fire Ventures with Me",
        "description": "Sword, Claymore, or Polearm-wielding characters inside <span style=\"color: #FFD780FF;\">Fantastic Voyage</span>'s radius gain a 15% <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> and their weapons are infused with <span style=\"color: #FF9999FF;\">Pyro</span>."
      }
    ],
    "passives": [
      {
        "name": "Rekindle",
        "description": "Decreases <span style=\"color: #FFD780FF;\">Passion Overload</span>'s CD by 20%."
      },
      {
        "name": "Fearnaught",
        "description": "Within the area created by <span style=\"color: #FFD780FF;\">Fantastic Voyage</span>, <span style=\"color: #FFD780FF;\">Passion Overload</span> takes on the following effects:\\n·CD is reduced by 50%.\\n·Bennett will not be launched by the effects of Charge Level 2."
      },
      {
        "name": "It Should Be Safe...",
        "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%."
      }
    ],
    "burst": {
      "name": "Fantastic Voyage",
      "description": "Bennett performs a jumping attack that deals <span style=\"color: #FF9999FF;\">Pyro DMG</span>, creating an Inspiration Field.\\n\\n<span style=\"color: #FFD780FF;\">Inspiration Field</span>\\n·If the health of a character within the AoE is equal to or falls below 70%, their health will continuously regenerate. The amount of HP restored scales off Bennett's Max HP.\\n·If the health of a character within the AoE is higher than 70%, they gain an ATK Bonus that is based on Bennett's Base ATK.\\n·Imbues characters within the AoE with <span style=\"color: #FF9999FF;\">Pyro</span>.\\n\\n<i>Benny's Adventure Team's adventures are always fraught with unexpected danger. However, Bennett is more inclined to call them \"journeys full of wonder, excitement, and beauty.\"</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Strike of Fortune",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 2
    },
    "elementalSkill": {
      "name": "Passion Overload",
      "description": "Bennett puts all his fire and passion for adventuring into his sword. Results may vary based on how fired up he is...\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nA single, swift flame strike that deals <span style=\"color: #FF9999FF;\">Pyro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Hold (Short)</span>\\nCharges up, resulting in different effects when unleashed based on the Charge Level.\\n·Level 1: Strikes twice, dealing <span style=\"color: #FF9999FF;\">Pyro DMG</span> and launching opponents.\\n·Level 2: Unleashes 3 consecutive attacks that deal impressive <span style=\"color: #FF9999FF;\">Pyro DMG</span>, but the last attack triggers an explosion that launches both Bennett and the enemy.\\nBennett takes no damage from being launched.\\n\\n<i>An attack that combines Bennett's dreams and passion with Pyro. But passion is sometimes overblown, and Pyro sometimes blows over.</i>",
      "priority": 3
    }
  },
  {
    "id": 8,
    "name": "Chongyun",
    "description": "A young exorcist from a family of exorcists. He does everything he can to suppress his abundance of yang energy.",
    "weapon": "claymore",
    "rarity": "rare",
    "vision": "cryo",
    "profileImage": "chongyun",
    "statGrow": "atkPercent",
    "normalBossDrops": "Hoarfrost Core",
    "normalBossDropsImage": "hoarfrostcore",
    "ascensionMats": "Cor Lapis",
    "ascensionMatsImage": "corlapis",
    "talentBooks": "Diligence",
    "weeklyBossDrops": "Dvalin's Sigh",
    "weeklyBossDropsImage": "dvalinssigh",
    "constellations": [
      {
        "name": "Ice Unleashed",
        "description": "The last attack of Chongyun's Normal Attack combo releases 3 ice blades. Each blade deals 50% of Chongyun's ATK as <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to all opponents in its path."
      },
      {
        "name": "Atmospheric Revolution",
        "description": "Elemental Skills and Elemental Bursts cast within the Frost Field created by <span style=\"color: #FFD780FF;\">Spirit Blade: Chonghua's Layered Frost</span> have their CD time decreased by 15%."
      },
      {
        "name": "Cloudburst",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Spirit Blade: Cloud-parting Star</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Frozen Skies",
        "description": "Chongyun regenerates 1 Energy every time he hits an opponent affected by <span style=\"color: #99FFFFFF;\">Cryo</span>.\\nThis effect can only occur once every 2s."
      },
      {
        "name": "The True Path",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Spirit Blade: Chonghua's Layered Frost</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Rally of Four Blades",
        "description": "<span style=\"color: #FFD780FF;\">Spirit Blade: Cloud-parting Star</span> deals 15% more DMG to opponents with a lower percentage of their Max HP remaining than Chongyun.\\nThis skill will also summon 1 additional spirit blade."
      }
    ],
    "passives": [
      {
        "name": "Steady Breathing",
        "description": "Sword, Claymore, or Polearm-wielding characters within the field created by <span style=\"color: #FFD780FF;\">Spirit Blade: Chonghua's Layered Frost</span> have their Normal ATK SPD increased by 8%."
      },
      {
        "name": "Rimechaser Blade",
        "description": "When the field created by <span style=\"color: #FFD780FF;\">Spirit Blade: Chonghua's Layered Frost</span> disappears, another spirit blade will be summoned to strike nearby opponents, dealing 100% of Chonghua's Layered Frost's Skill DMG as <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>. Opponents hit by this blade will have their <span style=\"color: #99FFFFFF;\">Cryo RES</span> decreased by 10% for 8s."
      },
      {
        "name": "Gallant Journey",
        "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%."
      }
    ],
    "burst": {
      "name": "Spirit Blade: Cloud-Parting Star",
      "description": "Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground.\\nWhen the spirit blades explode, they will deal <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span> and launch opponents.\\n\\n<i>\"As ice doth give the biting frost birth, My transcendent blade shakes heaven and earth. Heed my summons and come hence!\"</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Demonbane",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\\nAt end of the sequence, perform a more powerful slash. \\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Spirit Blade: Chonghua's Layered Frost",
      "description": "Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\nAfter a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all Sword, Claymore and Polearm-wielding characters' weapons will be infused with <span style=\"color: #99FFFFFF;\">Cryo</span>.\\n\\n<i>\"A crystal-clear ring, and all is silent. The rivers move not, and the clouds are heavy with frost. The altar gates open, and evil is banished.\"</i>",
      "priority": 5
    }
  },
  {
    "id": 9,
    "name": "Diluc",
    "description": "The tycoon of a winery empire in Mondstadt, unmatched in every possible way.",
    "weapon": "claymore",
    "rarity": "legendary",
    "vision": "pyro",
    "profileImage": "diluc",
    "statGrow": "critRate",
    "normalBossDrops": "Everflame Seed",
    "normalBossDropsImage": "everflameseed",
    "ascensionMats": "Small Lamp Grass",
    "ascensionMatsImage": "smalllampgrass",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Dvalin's Plume",
    "weeklyBossDropsImage": "dvalinsplume",
    "constellations": [
      {
        "name": "Conviction",
        "description": "Diluc deals 15% more DMG to opponents whose HP is above 50%."
      },
      {
        "name": "Searing Ember",
        "description": "When Diluc takes DMG, his ATK increases by 10% and his ATK SPD increases by 5%. Lasts for 10s.\\nThis effect can stack up to 3 times and can only occur once every 1.5s."
      },
      {
        "name": "Fire and Steel",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Searing Onslaught</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Flowing Flame",
        "description": "Casting <span style=\"color: #FFD780FF;\">Searing Onslaught</span> in rhythm greatly increases damage dealt.\\n2s after casting <span style=\"color: #FFD780FF;\">Searing Onslaught</span>, casting the next Searing Onslaught in the combo deals 40% additional DMG. This effect lasts for 2s."
      },
      {
        "name": "Phoenix, Harbinger of Dawn",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Dawn</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Flaming Sword, Nemesis of the Dark",
        "description": "After casting <span style=\"color: #FFD780FF;\">Searing Onslaught</span>, the next 2 Normal Attacks within the next 6s will have their DMG and ATK SPD increased by 30%.\\nAdditionally, Searing Onslaught will not interrupt the Normal Attack combo."
      }
    ],
    "passives": [
      {
        "name": "Relentless",
        "description": "Diluc's Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s."
      },
      {
        "name": "Blessing of Phoenix",
        "description": "The <span style=\"color: #FF9999FF;\">Pyro Infusion</span> provided by <span style=\"color: #FFD780FF;\">Dawn</span> lasts for 4s longer. Additionally, Diluc gains 20% <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> during the duration of this effect."
      },
      {
        "name": "Tradition of the Dawn Knight",
        "description": "Refunds 15% of the ore used when crafting Claymore-type weapons."
      }
    ],
    "burst": {
      "name": "Dawn",
      "description": "Releases intense flames to knock nearby opponents back, dealing <span style=\"color: #FF9999FF;\">Pyro DMG</span>. The flames then converge into the weapon, summoning a Phoenix that flies forward and deals massive <span style=\"color: #FF9999FF;\">Pyro DMG</span> to all opponents in its path. The Phoenix explodes upon reaching its destination, causing a large amount of <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\nThe searing flames that run down his blade cause it to be infused with <span style=\"color: #FF9999FF;\">Pyro</span>.\\n\\n<i>The only reason to walk in the darkness is to light it up. Behold, that fleeing light in the dead of night is the herald of the coming dawn.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Tempered Sword",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous slashes.\\nAt end of the sequence, perform a more powerful slash.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Searing Onslaught",
      "description": "Performs a forward slash that deals <span style=\"color: #FF9999FF;\">Pyro DMG</span>.\\n\\nThis skill can be used 3 times consecutively. Enters CD if not cast again within a short period.\\n\\n<i>The slashes represent the values that Diluc holds dear: one for justice, one for courage, and one for duty.</i>",
      "priority": 5
    }
  },
  {
    "id": 10,
    "name": "Diona",
    "description": "A young lady who has inherited trace amounts of non-human blood. She is the incredibly popular bartender of the Cat's Tail tavern.",
    "weapon": "bow",
    "rarity": "rare",
    "vision": "cryo",
    "profileImage": "diona",
    "statGrow": "cryoDamageBonus",
    "normalBossDrops": "Hoarfrost Core",
    "normalBossDropsImage": "hoarfrostcore",
    "ascensionMats": "Calla Lily",
    "ascensionMatsImage": "callalily",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Shard of a Foul Legacy",
    "weeklyBossDropsImage": "shardofafoullegacy",
    "constellations": [
      {
        "name": "A Lingering Flavor",
        "description": "Regenerates 15 Energy for Diona after the effects of <span style=\"color: #FFD780FF;\">Signature Mix</span> end."
      },
      {
        "name": "Shaken, Not Purred",
        "description": "Increases <span style=\"color: #FFD780FF;\">Icy Paws</span>' DMG by 15%, and increases its shield's DMG Absorption by 15%.\\nAdditionally, when paws hit their targets, creates a shield for other nearby characters on the field with 50% of the <span style=\"color: #FFD780FF;\">Icy Paws</span> shield's DMG Absorption for 5s."
      },
      {
        "name": "A—Another Round?",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Signature Mix</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Wine Industry Slayer",
        "description": "Within the radius of <span style=\"color: #FFD780FF;\">Signature Mix</span>, Diona's charge time for aimed shots is reduced by 60%"
      },
      {
        "name": "Double Shot, On The Rocks",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Icy Paws</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Cat's Tail Closing Time",
        "description": "Characters within <span style=\"color: #FFD780FF;\">Signature Mix</span>'s radius will gain the following effects based on their HP amounts:\\n·Increases Incoming Healing Bonus by 30% when HP falls below or is equal to 50%.\\n·Elemental Mastery increased by 200 when HP is above 50%."
      }
    ],
    "passives": [
      {
        "name": "Cat's Tail Secret Menu",
        "description": "Characters shielded by <span style=\"color: #FFD780FF;\">Icy Paws</span> have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%."
      },
      {
        "name": "Drunkards' Farce",
        "description": "Opponents who enter the AoE of <span style=\"color: #FFD780FF;\">Signature Mix</span> have 10% decreased ATK for 15s."
      },
      {
        "name": "Complimentary Bar Food",
        "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."
      }
    ],
    "burst": {
      "name": "Signature Mix",
      "description": "Tosses out a special cold brew that deals <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span> and creates a Drunken Mist in an AoE.\\n\\n<span style=\"color: #FFD780FF;\">Drunken Mist</span>\\n·Deals continuous <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents within the AoE.\\n·Continuously regenerates the HP of characters within the AoE.\\n\\n<i>A horrific mix that even Diona considers inhumane. The horrifying foretaste should be left for one's opponents. It has a crisp aftertaste, but unfortunately, one can only feel it on one's nose and skin.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Kätzlein Style",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, biting frost will accumulate on the arrowhead. A fully charged frost arrow will deal <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Icy Paws",
      "description": "Fires an Icy Paw that deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents and forms a shield on hit.\\nThe shield's DMG Absorption scales based on Diona's Max HP, and its duration scales off the number of Icy Paws that hit their target.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nRapidly fires off 2 Icy Paws.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nDashes back quickly before firing five Icy Paws.\\nThe shield created by a Hold attack will gain a 75% DMG Absorption Bonus.\\n\\nThe shield has a 250% <span style=\"color: #99FFFFFF;\">Cryo DMG</span> Absorption Bonus, and will cause your active character to become affected by <span style=\"color: #99FFFFFF;\">Cryo</span> at the point of formation for a short duration.\\n\\n<i>When she first started bartending, Diona found that no matter how much ice she put in her cocktails, it would never do a drunkard any harm. That all changed when she received her Vision — now she can form ice cold enough to cause severe brainfreeze. Five out of five stars!</i>",
      "priority": 5
    }
  },
  {
    "id": 11,
    "name": "Eula",
    "description": "The Spindrift Knight, a scion of the old aristocracy, and the Captain of the Knights of Favonius Reconnaissance Company. The reason for which a descendant of the ancient nobles might join the Knights remains a great mystery in Mondstadt to this very day.",
    "weapon": "claymore",
    "rarity": "legendary",
    "vision": "cryo",
    "profileImage": "eula",
    "statGrow": "critDamage",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Dandelion Seed",
    "ascensionMatsImage": "dandelionseed",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Dragon Lord's Crown",
    "weeklyBossDropsImage": "dragonlordscrown",
    "constellations": [
      {
        "name": "Tidal Illusion",
        "description": "Every time <span style=\"color: #FFD780FF;\">Icetide Vortex</span>'s Grimheart stacks are consumed, Eula's Physical DMG is increased by 30% for 6s.\\nEach stack consumed will increase the duration of this effect by 6s up to a maximum of 18s."
      },
      {
        "name": "Lady of Seafoam",
        "description": "Decreases the CD of <span style=\"color: #FFD780FF;\">Icetide Vortex</span>'s Holding Mode, rendering it identical to Press CD."
      },
      {
        "name": "Lawrence Pedigree",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Glacial Illumination</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "The Obstinacy of One's Inferiors",
        "description": "Lightfall Swords deal 25% increased DMG against opponents with less than 50% HP."
      },
      {
        "name": "Chivalric Quality",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Icetide Vortex</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Noble Obligation",
        "description": "Lightfall Swords created by <span style=\"color: #FFD780FF;\">Glacial Illumination</span> start with 5 stacks of energy. Normal Attacks, Elemental Skills, and Elemental Bursts have a 50% chance to grant the Lightfall Sword an additional stack of energy."
      }
    ],
    "passives": [
      {
        "name": "Roiling Rime",
        "description": "If 2 stacks of Grimheart are consumed upon unleashing the Holding Mode of <span style=\"color: #FFD780FF;\">Icetide Vortex</span>, a Shattered Lightfall Sword will be created that will explode immediately, dealing 50% of the basic Physical DMG dealt by a Lightfall Sword created by <span style=\"color: #FFD780FF;\">Glacial Illumination</span>."
      },
      {
        "name": "Wellspring of War-Lust",
        "description": "When <span style=\"color: #FFD780FF;\">Glacial Illumination</span> is cast, the CD of <span style=\"color: #FFD780FF;\">Icetide Vortex</span> is reset and Eula gains 1 stack of Grimheart."
      },
      {
        "name": "Aristocratic Introspection",
        "description": "When Eula crafts Character Talent Materials, she has a 10% chance to receive double the product."
      }
    ],
    "burst": {
      "name": "Glacial Illumination",
      "description": "Brandishes her greatsword, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to nearby opponents and creating a Lightfall Sword that follows her around for a duration of up to 7s.\\nWhile present, the Lightfall Sword increases Eula's resistance to interruption. When Eula's own Normal Attack, Elemental Skill, and Elemental Burst deal DMG to opponents, they will charge the Lightfall Sword, which can gain an energy stack once every 0.1s.\\nOnce its duration ends, the Lightfall Sword will descend and explode violently, dealing Physical DMG to nearby opponents.\\nThis DMG scales on the number of energy stacks the Lightfall Sword has accumulated.\\nIf Eula leaves the field, the Lightfall Sword will explode immediately.\\n\\n<i>It is easy to sink. But even so, she desires to freeze this oncoming tide.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Favonius Bladework - Edel",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous slashes.\\nAt the end of the sequence, perform a more powerful slash.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Icetide Vortex",
      "description": "Sharp frost, swift blade.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nSlashes swiftly, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\nWhen it hits an opponent, Eula gains a stack of Grimheart that stacks up to 2 times. These stacks can only be gained once every 0.3s.\\n\\n<span style=\"color: #FFD780FF;\">Grimheart</span>\\nIncreases Eula's resistance to interruption and DEF.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nWielding her sword, Eula consumes all the stacks of Grimheart and lashes forward, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span> to opponents in front of her.\\nIf Grimheart stacks are consumed, surrounding opponents will have their Physical RES and <span style=\"color: #99FFFFFF;\">Cryo RES</span> decreased.\\nEach consumed stack of Grimheart will be converted into an Icewhirl Brand that deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to nearby opponents.\\n\\n<i>\"So the waves roiled, swallowing the crown of the nobles. And ever after did each drop amidst the icy waves reflect a golden crown, each and every droplet of the spray shining with its light.\"</i>",
      "priority": 5
    }
  },
  {
    "id": 12,
    "name": "Fischl",
    "description": "A mysterious girl who calls herself \"Prinzessin der Verurteilung\" and travels with a night raven named Oz.",
    "weapon": "bow",
    "rarity": "rare",
    "vision": "electro",
    "profileImage": "fischl",
    "statGrow": "atkPercent",
    "normalBossDrops": "Lightning Prism",
    "normalBossDropsImage": "lightningprism",
    "ascensionMats": "Small Lamp Grass",
    "ascensionMatsImage": "smalllampgrass",
    "talentBooks": "Ballad",
    "weeklyBossDrops": "Spirit Locket of Boreas",
    "weeklyBossDropsImage": "spiritlocketofboreas",
    "constellations": [
      {
        "name": "Gaze of the Deep",
        "description": "Even when Oz is not present in combat, he can still watch over Fischl through his raven eyes. When Fischl performs a Normal Attack against an opponent, Oz fires a joint attack, dealing DMG equal to 22% of Fischl's ATK."
      },
      {
        "name": "Devourer of All Sins",
        "description": "When <span style=\"color: #FFD780FF;\">Nightrider</span> is used, it deals an additional 200% ATK as DMG, and its AoE is increased by 50%."
      },
      {
        "name": "Wings of Nightmare",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Nightrider</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Her Pilgrimage of Bleak",
        "description": "When <span style=\"color: #FFD780FF;\">Midnight Phantasmagoria</span> is used, it deals 222% of ATK as <span style=\"color: #FFACFFFF;\">Electro DMG</span> to surrounding opponents.\\nWhen the skill duration ends, Fischl regenerates 20% of her HP."
      },
      {
        "name": "Against the Fleeing Light",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Midnight Phantasmagoria</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Evernight Raven",
        "description": "Extends the duration of Oz's presence on the field by 2s. Additionally, Oz performs joint attacks with your active character when present, dealing 30% of Fischl's ATK as <span style=\"color: #FFACFFFF;\">Electro DMG</span>."
      }
    ],
    "passives": [
      {
        "name": "Stellar Predator",
        "description": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> equal to 152.7% of the arrow's DMG."
      },
      {
        "name": "Undone Be Thy Sinful Hex",
        "description": "If your current active character triggers an <span style=\"color: #FFACFFFF;\">Electro-related Elemental Reaction</span> when Oz is on the field, the opponent shall be stricken with Thundering Retribution, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> equal to 80% of Fischl's ATK."
      },
      {
        "name": "Mein Hausgarten",
        "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%."
      }
    ],
    "burst": {
      "name": "Midnight Phantasmagoria",
      "description": "Summons Oz to spread his twin wings of twilight and defend Fischl.\\nHas the following properties during the ability's duration:\\n·Fischl takes on Oz's form, greatly increasing her Movement Speed.\\n·Strikes nearby opponents with lightning, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> to opponents she comes into contact with. Each opponent can only be struck once.\\n·Once this ability's effects end, Oz will remain on the battlefield and attack his Prinzessin's foes. If Oz is already on the field, then this will reset the duration of his presence.\\n\\n<i>\"...In the hordes of beasts that follow the cursed blood, only Prince Nachtraben, who bore witness to the extinction of a thousand worlds, knows her true greatness. Thus the night wings he spreads are his eternal promise to protect Her Royal Highness.\"</i>\\n<i>—Flowers for Princess Fischl (I): End Time Zersetzung</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Bolts of Downfall",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, the dark lightning spirits of Immernachtreich shall heed the call of their Prinzessin and indwell the enchanted arrowhead. When fully indwelt, the Rachsüchtig Blitz shall deal immense <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Nightrider",
      "description": "Summons Oz. The night raven forged of darkness and lightning descends upon the land, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> in a small AoE.\\nFor the ability's duration, Oz will continuously attack nearby opponents with <span style=\"color: #FFACFFFF;\">Freikugel</span>.\\n\\nHold to adjust the location Oz will be summoned to.\\nPress again any time during the ability's duration to once again summon him to Fischl's side.\\n\\n<i>\"My time is most precious, and I shall not waste it on the likes of you... Go, Oz, fall upon them, and bring down upon them your Rachsüchtig Blitz, that which tears open the long night.\"</i>\\n<i>—Flowers for Princess Fischl (IV): Farewell Frau Welt</i>",
      "priority": 5
    }
  },
  {
    "id": 13,
    "name": "Ganyu",
    "description": "The secretary at Yuehai Pavilion. The blood of the qilin, an illuminated beast, flows within her veins.",
    "weapon": "bow",
    "rarity": "legendary",
    "vision": "cryo",
    "profileImage": "ganyu",
    "statGrow": "critDamage",
    "normalBossDrops": "Hoarfrost Core",
    "normalBossDropsImage": "hoarfrostcore",
    "ascensionMats": "Qingxin",
    "ascensionMatsImage": "qingxin",
    "talentBooks": "Diligence",
    "weeklyBossDrops": "Shadow of the Warrior",
    "weeklyBossDropsImage": "shadowofthewarrior",
    "constellations": [
      {
        "name": "Dew-Drinker",
        "description": "Taking DMG from a Charge Level 2 Frostflake Arrow or Frostflake Arrow Bloom decreases opponents' <span style=\"color: #99FFFFFF;\">Cryo RES</span> by 15% for 6s.\\nA hit regenerates 2 Energy for Ganyu. This effect can only occur once per Charge Level 2 Frostflake Arrow, regardless if Frostflake Arrow itself or its Bloom hit the target."
      },
      {
        "name": "The Auspicious",
        "description": "<span style=\"color: #FFD780FF;\">Trail of the Qilin</span> gains 1 additional charge."
      },
      {
        "name": "Cloud-Strider",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Celestial Shower</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Westward Sojourn",
        "description": "Opponents standing within the AoE of <span style=\"color: #FFD780FF;\">Celestial Shower</span> take increased DMG. This effect strengthens over time.\\nIncreased DMG taken begins at 5% and increases by 5% every 3s, up to a maximum of 25%.\\nThe effect lingers for 3s after the opponent leaves the AoE."
      },
      {
        "name": "The Merciful",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Trail of the Qilin</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "The Clement",
        "description": "Using <span style=\"color: #FFD780FF;\">Trail of the Qilin</span> causes the next Frostflake Arrow shot within 30s to not require charging."
      }
    ],
    "passives": [
      {
        "name": "Undivided Heart",
        "description": "After firing a Frostflake Arrow, the CRIT Rate of subsequent Frostflake Arrows and their resulting bloom effects is increased by 20% for 5s."
      },
      {
        "name": "Harmony between Heaven and Earth",
        "description": "<span style=\"color: #FFD780FF;\">Celestial Shower</span> grants a 20% <span style=\"color: #99FFFFFF;\">Cryo DMG Bonus</span> to active party members in the AoE."
      },
      {
        "name": "Preserved for the Hunt",
        "description": "Refunds 15% of the ore used when crafting Bow-type weapons."
      }
    ],
    "burst": {
      "name": "Celestial Shower",
      "description": "Coalesces atmospheric frost and snow to summon a Sacred Cryo Pearl that exorcises evil.\\nDuring its ability duration, the Sacred Cryo Pearl will continuously rain down shards of ice, striking opponents within an AoE and dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n\\n<i>Ganyu can bring down sweet rains as a matter of course. But against demons and heretics, they become bitter, freezing snow.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Liutian Archery",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 6 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, an icy aura will accumulate on the arrowhead before the arrow is fired. Has different effects based on how long the energy has been charged:\\n·Charge Level 1: Fires off an icy arrow that deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n·Charge Level 2: Fires off a Frostflake Arrow that deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span>. The Frostflake Arrow blooms after hitting its target, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 5
    },
    "elementalSkill": {
      "name": "Trail of the Qilin",
      "description": "Leaving a single Ice Lotus behind, Ganyu dashes backward, shunning all impurity and dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Ice Lotus</span>\\n·Continuously taunts surrounding opponents, attracting them to attack it.\\n·Endurance scales based on Ganyu's Max HP.\\n·Blooms profusely when destroyed or once its duration ends, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<i>\"You saw me, you say? You must be mistaken. I was working overtime then.\"</i>",
      "priority": 3
    }
  },
  {
    "id": 14,
    "name": "Gorou",
    "description": "The great general of Watatsumi Island's forces. He is deeply trusted by his subordinates.",
    "weapon": "bow",
    "rarity": "rare",
    "vision": "geo",
    "profileImage": "gorou",
    "statGrow": "geoDamageBonus",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Sango Pearl",
    "ascensionMatsImage": "sangopearl",
    "talentBooks": "Light",
    "weeklyBossDrops": "Molten Moment",
    "weeklyBossDropsImage": "moltenmoment",
    "constellations": [
      {
        "name": "Rushing Hound: Swift as the Wind",
        "description": "When characters (other than Gorou) within the AoE of Gorou's <span style=\"color: #FFD780FF;\">General's War Banner</span> or <span style=\"color: #FFD780FF;\">General's Glory</span> deal Geo DMG to opponents, the CD of Gorou's <span style=\"color: #FFD780FF;\">Inuzaka All-Round Defense</span> is decreased by 2s.\\nThis effect can occur once every 10s."
      },
      {
        "name": "Sitting Hound: Steady as a Clock",
        "description": "While <span style=\"color: #FFD780FF;\">General's Glory</span> is in effect, its duration is extended by 1s when a nearby active character obtains an Elemental Shard from a Crystallize reaction. \\nThis effect can occur once every 0.1s. Max extension is 3s."
      },
      {
        "name": "Mauling Hound: Fierce as Fire",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Inuzaka All-Round Defense</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Lapping Hound: Warm as Water",
        "description": "When <span style=\"color: #FFD780FF;\">General's Glory</span> is in the \"Impregnable\" or \"Crunch\" states, it will also heal active characters within its AoE by 50% of Gorou's own DEF every 1.5s."
      },
      {
        "name": "Striking Hound: Thunderous Force",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Juuga: Forward Unto Victory</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Valiant Hound: Mountainous Fealty",
        "description": "For 12s after using <span style=\"color: #FFD780FF;\">Inuzaka All-Round Defense</span> or <span style=\"color: #FFD780FF;\">Juuga: Forward Unto Victory</span>, increases the CRIT DMG of all nearby party members' <span style=\"color: #FFE699FF;\">Geo DMG</span> based on the buff level of the skill's field at the time of use:\\n· \"Standing Firm\": +10%\\n· \"Impregnable\": +20%\\n· \"Crunch\": +40%\\n\\nThis effect cannot stack and will take reference from the last instance of the effect that is triggered."
      }
    ],
    "passives": [
      {
        "name": "Heedless of the Wind and Weather",
        "description": "After using <span style=\"color: #FFD780FF;\">Juuga: Forward Unto Victory</span>, all nearby party members' DEF is increased by 25% for 12s."
      },
      {
        "name": "A Favor Repaid",
        "description": "Gorou receives the following DMG Bonuses to his attacks based on his DEF:\\n· <span style=\"color: #FFD780FF;\">Inuzaka All-Round Defense</span>: Skill DMG increased by 156% of DEF\\n· <span style=\"color: #FFD780FF;\">Juuga: Forward Unto Victory</span>: Skill DMG and Crystal Collapse DMG increased by 15.6% of DEF"
      },
      {
        "name": "Seeker of Shinies",
        "description": "Displays the location of nearby <span style=\"color: #FFD780FF;\">resources unique to Inazuma</span> on the mini-map."
      }
    ],
    "burst": {
      "name": "Juuga: Forward Unto Victory",
      "description": "Displaying his valor as a general, Gorou deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> and creates a field known as General's Glory to embolden his comrades.\\n\\n<span style=\"color: #FFD780FF;\">General's Glory</span>\\nThis field has the following properties:\\n· Like the General's War Banner created by Inuzaka All-Round Defense, provides buffs to active characters within the skill's AoE based on the number of <span style=\"color: #FFE699FF;\">Geo</span> characters in the party. Also moves together with your active character.\\n· Generates 1 Crystal Collapse every 1.5s that deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> to 1 opponent within the skill's AoE.\\n· Pulls 1 elemental shard in the skill's AoE to your active character's position every 1.5s (elemental shards are created by Crystallize reactions).\\n\\nIf a General's War Banner created by Gorou currently exists on the field when this ability is used, it will be destroyed. In addition, for the duration of General's Glory, Gorou's Elemental Skill \"Inuzaka All-Round Defense\" will not create the General's War Banner.\\n If Gorou falls, the effects of General's Glory will be cleared.\\n\\n<i>\"We have the high ground!\" Gorou can ever so slightly change the terrain of the battlefield to help win victory. This technique has seen him through many battles against seemingly superior opposition.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Ripping Fang Fletching",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, stone crystals will accumulate on the arrowhead. A fully charged crystalline arrow will deal <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Inuzaka All-Round Defense",
      "description": "Deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> and sets up a General's War Banner.\\n\\n<span style=\"color: #FFD780FF;\">General's War Banner</span>\\nProvides up to 3 buffs to active characters within the skill's AoE based on the number of <span style=\"color: #FFE699FF;\">Geo</span> characters in the party at the time of casting:\\n· 1 Geo character: Adds \"Standing Firm\" - DEF Bonus.\\n· 2 Geo characters: Adds \"Impregnable\" - Increased resistance to interruption.\\n· 3 Geo characters: Adds \"Crunch\" - <span style=\"color: #FFE699FF;\">Geo DMG Bonus</span>.\\n\\nGorou can deploy only 1 General's War Banner on the field at any one time. Characters can only benefit from 1 General's War Banner at a time. When a party member leaves the field, the active buff will last for 2s.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nAdjust the location of the skill.\\n\\n<i>\"Take up this formation and we'll be safe — I guarantee it!\" As a general and a leader of troops, the last thing Gorou wants is to see is those who follow him getting hurt.</i>",
      "priority": 5
    }
  },
  {
    "id": 15,
    "name": "Hu Tao",
    "description": "The 77th Director of the Wangsheng Funeral Parlor. She took over the business at a rather young age.",
    "weapon": "polearm",
    "rarity": "legendary",
    "vision": "pyro",
    "profileImage": "hu tao",
    "statGrow": "critDamage",
    "normalBossDrops": "Juvenile Jade",
    "normalBossDropsImage": "juvenilejade",
    "ascensionMats": "Silk Flower",
    "ascensionMatsImage": "silkflower",
    "talentBooks": "Diligence",
    "weeklyBossDrops": "Shard of a Foul Legacy",
    "weeklyBossDropsImage": "shardofafoullegacy",
    "constellations": [
      {
        "name": "Crimson Bouquet",
        "description": "While in a <span style=\"color: #FFD780FF;\">Paramita Papilio</span> state activated by <span style=\"color: #FFD780FF;\">Guide to Afterlife</span>, Hu Tao's Charge Attacks do not consume Stamina."
      },
      {
        "name": "Ominous Rainfall",
        "description": "Increases the <span style=\"color: #FFD780FF;\">Blood Blossom</span> DMG by an amount equal to 10% of Hu Tao's Max HP at the time the effect is applied.\\nAdditionally, <span style=\"color: #FFD780FF;\">Spirit Soother</span> will also apply the <span style=\"color: #FFD780FF;\">Blood Blossom</span> effect."
      },
      {
        "name": "Lingering Carmine",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Guide to Afterlife</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Garden of Eternal Rest",
        "description": "Upon defeating an enemy affected by a <span style=\"color: #FFD780FF;\">Blood Blossom</span> that Hu Tao applied herself, all nearby allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 15s."
      },
      {
        "name": "Floral Incense",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Spirit Soother</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Butterfly's Embrace",
        "description": "Triggers when Hu Tao's HP drops below 25%, or when she suffers a lethal strike:\\nHu Tao will not fall as a result of the DMG sustained. Additionally, for the next 10s, all of her Elemental and Physical RES is increased by 200%, her CRIT Rate is increased by 100%, and her resistance to interruption is greatly increased.\\nThis effect triggers automatically when Hu Tao has 1 HP left.\\nCan only occur once every 60s."
      }
    ],
    "passives": [
      {
        "name": "Flutter By",
        "description": "When a <span style=\"color: #FFD780FF;\">Paramita Papilio</span> state activated by <span style=\"color: #FFD780FF;\">Guide to Afterlife</span> ends, all allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 8s."
      },
      {
        "name": "Sanguine Rouge",
        "description": "When Hu Tao's HP is equal to or less than 50%, her <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> is increased by 33%."
      },
      {
        "name": "The More the Merrier",
        "description": "When Hu Tao cooks a dish perfectly, she has a 18% chance to receive an additional \"Suspicious\" dish of the same type."
      }
    ],
    "burst": {
      "name": "Spirit Soother",
      "description": "Commands a blazing spirit to attack, dealing <span style=\"color: #FF9999FF;\">Pyro DMG</span> in a large AoE.\\nUpon striking the enemy, regenerates a percentage of Hu Tao's Max HP. This effect can be triggered up to 5 times, based on the number of enemies hit.\\nIf Hu Tao's HP is below or equal to 50% when the enemy is hit, both the DMG and HP Regeneration are increased.\\n\\n<i>Supernatural activity by those who have already left this world is a source of great anxiety for the Wangsheng Funeral Parlor. In such cases, cremation always lets Hu Tao find peace of mind. The more anxious she feels, the stronger the flame.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Secret Spear of Wangsheng",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to six consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Guide to Afterlife",
      "description": "Only an unwavering flame can cleanse the impurities of this world.\\nHu Tao consumes a set portion of her HP to knock the surrounding enemies back and enter the Paramita Papilio state.\\n\\n<span style=\"color: #FFD780FF;\">Paramita Papilio</span>\\n·Increases Hu Tao's ATK based on her Max HP at the time of entering this state. ATK Bonus gained this way cannot exceed 400% of Hu Tao's Base ATK.\\n·Converts attack DMG to <span style=\"color: #FF9999FF;\">Pyro DMG</span>, which cannot be overridden by any other elemental infusion.\\n·Charged Attacks apply the Blood Blossom effect to the enemies hit.\\n·Increases Hu Tao's resistance to interruption.\\n\\n<span style=\"color: #FFD780FF;\">Blood Blossom</span>\\nEnemies affected by Blood Blossom will take <span style=\"color: #FF9999FF;\">Pyro DMG</span> every 4s. This DMG is considered Elemental Skill DMG.\\nEach enemy can be affected by only one Blood Blossom effect at a time, and its duration may only be refreshed by Hu Tao herself.\\n\\n<span style=\"color: #FFD780FF;\">Paramita Papilio</span> ends when its duration is over, or Hu Tao has left the battlefield or fallen.\\n\\n<i>Hu Tao's Secret Spear technique is based on several rules, the first of which is: \"The spear opens the path to the afterlife, and the butterflies bridge this world and the next.\"</i>",
      "priority": 5
    }
  },
  {
    "id": 16,
    "name": "Jean",
    "description": "The righteous and rigorous Dandelion Knight, and Acting Grand Master of Mondstadt's Knights of Favonius.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "anemo",
    "profileImage": "jean",
    "statGrow": "healingBonus",
    "normalBossDrops": "Hurricane Seed",
    "normalBossDropsImage": "hurricaneseed",
    "ascensionMats": "Dandelion Seed",
    "ascensionMatsImage": "dandelionseed",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Dvalin's Plume",
    "weeklyBossDropsImage": "dvalinsplume",
    "constellations": [
      {
        "name": "Spiraling Tempest",
        "description": "Increases the pulling speed of <span style=\"color: #FFD780FF;\">Gale Blade</span> after holding for more than 1s, and increases the DMG dealt by 40%."
      },
      {
        "name": "People's Aegis",
        "description": "When Jean picks up an Elemental Orb/Particle, all party members have their Movement SPD and ATK SPD increased by 15% for 15s."
      },
      {
        "name": "When the West Wind Arises",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Dandelion Breeze</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Lands of Dandelion",
        "description": "Within the Field created by <span style=\"color: #FFD780FF;\">Dandelion Breeze</span>, all opponents have their <span style=\"color: #80FFD7FF;\">Anemo RES</span> decreased by 40%."
      },
      {
        "name": "Outbursting Gust",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Gale Blade</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Lion's Fang, Fair Protector of Mondstadt",
        "description": "Incoming DMG is decreased by 35% within the Field created by <span style=\"color: #FFD780FF;\">Dandelion Breeze</span>. Upon leaving the Dandelion Field, this effect lasts for 3 attacks or 10s."
      }
    ],
    "passives": [
      {
        "name": "Wind Companion",
        "description": "On hit, Jean's Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean's ATK for all party members."
      },
      {
        "name": "Let the Wind Lead",
        "description": "Using <span style=\"color: #FFD780FF;\">Dandelion Breeze</span> will regenerate 20% of its Energy."
      },
      {
        "name": "Guiding Breeze",
        "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."
      }
    ],
    "burst": {
      "name": "Dandelion Breeze",
      "description": "Calling upon the wind's protection, Jean creates a swirling Dandelion Field, launching surrounding opponents and dealing <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\nAt the same time, she instantly regenerates a large amount of HP for all party members. The amount of HP restored scales off Jean's ATK.\\n\\n<span style=\"color: #FFD780FF;\">Dandelion Field</span>\\n·Continuously regenerates HP of characters within the AoE and continuously imbues them with <span style=\"color: #80FFD7FF;\">Anemo</span>.\\n·Deals <span style=\"color: #80FFD7FF;\">Anemo DMG</span> to opponents entering or exiting the Dandelion Field.\\n\\n<i>Jean's magnanimity is as vast as the dandelion fields, and it is the root of her wish to protect others.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Favonius Bladework",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 5 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of stamina to launch an opponent using the power of wind.\\nLaunched opponents will slowly fall to the ground.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Gale Blade",
      "description": "Focusing the might of the formless wind around her blade, Jean releases a miniature storm, launching opponents in the direction she aims at, dealing massive <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nAt the cost of continued stamina consumption, Jean can command the whirlwind to pull surrounding opponents and objects towards her front.\\nDirection can be adjusted.\\nCharacter is immobile during skill duration.\\n\\n<i>That which follows Jean, the wholehearted defender, is a guardian wind that can banish danger from her comrades' presence.</i>",
      "priority": 4
    }
  },
  {
    "id": 17,
    "name": "Kaedehara Kazuha",
    "description": "A wandering samurai from Inazuma who is currently with Liyue's Crux Fleet. A gentle and carefree soul whose heart hides a great many burdens from the past.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "anemo",
    "profileImage": "kaedehara kazuha",
    "statGrow": "em",
    "normalBossDrops": "Marionette Core",
    "normalBossDropsImage": "marionettecore",
    "ascensionMats": "Sea Ganoderma",
    "ascensionMatsImage": "seaganoderma",
    "talentBooks": "Diligence",
    "weeklyBossDrops": "Ashen Heart",
    "weeklyBossDropsImage": "ashenheart",
    "constellations": [
      {
        "name": "Scarlet Hills",
        "description": "Decreases <span style=\"color: #FFD780FF;\">Chihayaburu</span>'s CD by 10%.\\nUsing <span style=\"color: #FFD780FF;\">Kazuha Slash</span> resets the CD of <span style=\"color: #FFD780FF;\">Chihayaburu</span>."
      },
      {
        "name": "Yamaarashi Tailwind",
        "description": "The Autumn Whirlwind field created by <span style=\"color: #FFD780FF;\">Kazuha Slash</span> has the following effects:\\n· Increases Kaedehara Kazuha's own Elemental Mastery by 200.\\n· Increases the Elemental Mastery of characters within the field by 200.\\n\\nThe Elemental Mastery-increasing effects of this Constellation do not stack."
      },
      {
        "name": "Maple Monogatari",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Chihayaburu</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Oozora Genpou",
        "description": "When Kaedehara Kazuha's Energy is lower than 45, he obtains the following effects:\\n·Pressing or Holding <span style=\"color: #FFD780FF;\">Chihayaburu</span> regenerates 3 or 4 Energy for Kaedehara Kazuha, respectively.\\n·When gliding, Kaedehara Kazuha regenerates 2 Energy per second."
      },
      {
        "name": "Wisdom of Bansei",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Kazuha Slash</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Crimson Momiji",
        "description": "After using <span style=\"color: #FFD780FF;\">Chihayaburu</span> or <span style=\"color: #FFD780FF;\">Kazuha Slash</span>, Kaedehara Kazuha gains an <span style=\"color: #80FFD7FF;\">Anemo Infusion</span> for 5s. Additionally, each point of Elemental Mastery will increase the DMG dealt by Kaedehara Kazuha's Normal, Charged, and Plunging Attack by 0.2%."
      }
    ],
    "passives": [
      {
        "name": "Soumon Swordsmanship",
        "description": "If <span style=\"color: #FFD780FF;\">Chihayaburu</span> comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span> when cast, <span style=\"color: #FFD780FF;\">Chihayaburu</span> will absorb that element and if Plunging Attack: Midare Ranzan is used before the effect expires, it will deal an additional 200% ATK of the absorbed elemental type as DMG. This will be considered Plunging Attack DMG.\\nElemental Absorption may only occur once per use of <span style=\"color: #FFD780FF;\">Chihayaburu</span>."
      },
      {
        "name": "Poetics of Fuubutsu",
        "description": "Upon triggering a Swirl reaction, Kaedehara Kazuha will grant teammates a 0.04% Elemental DMG Bonus to their corresponding Element for every point of Elemental Mastery he has for 8s. Bonuses for different elements obtained through this method can co-exist."
      },
      {
        "name": "Cloud Strider",
        "description": "Decreases sprinting Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Kazuha Slash",
      "description": "The signature technique of Kazuha's self-styled bladework — a single slash that strikes with the force of the first winds of autumn, dealing <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span>.\\nThe blade's passage will leave behind a field named \"Autumn Whirlwind\" that periodically deals <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span> to opponents within its range.\\n\\n<span style=\"color: #FFD780FF;\">Elemental Absorption</span>\\nIf Autumn Whirlwind comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span>, it will deal additional elemental DMG of that type.\\nElemental Absorption may only occur once per use.\\n\\n<i>\"I see eternity go by in an instant, the autumns of many years from a single leaf. Thus I shall slice this maple in a flash, and ask a question of the ages.\"</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Garyuu Bladework",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact. If this Plunging Attack is triggered by Chihayaburu, it will be converted to Plunging Attack: Midare Ranzan.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack: Midare Ranzan</span>\\nWhen a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to <span style=\"color: #80FFD7FF;\">Anemo DMG</span> and will create a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Chihayaburu",
      "description": "Unleashes a secret technique as fierce as the rushing wind that pulls objects and opponents towards Kazuha's current position before launching opponents within the AoE, dealing <span style=\"color: #80FFD7FF;\">Anemo DMG</span> and lifting Kazuha into the air on a rushing gust of wind.\\nWithin 10s of remaining airborne after casting Chihayaburu, Kazuha can unleash a powerful Plunging Attack known as Midare Ranzan.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nCan be used in mid-air.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nCharges up before unleashing greater <span style=\"color: #80FFD7FF;\">Anemo DMG</span> over a larger AoE than Press Mode.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack: Midare Ranzan</span>\\nWhen a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to <span style=\"color: #80FFD7FF;\">Anemo DMG</span>. On landing, Kazuha creates a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents.\\nMidare Ranzan's DMG is considered Plunging Attack DMG.\\n\\n<i>\"Wind in branches grieves\\nBygone ages, gods of old\\nWithered autumn leaves\"</i>",
      "priority": 4
    }
  },
  {
    "id": 18,
    "name": "Kaeya",
    "description": "A thinker in the Knights of Favonius with a somewhat exotic appearance.",
    "weapon": "sword",
    "rarity": "rare",
    "vision": "cryo",
    "profileImage": "kaeya",
    "statGrow": "er",
    "normalBossDrops": "Hoarfrost Core",
    "normalBossDropsImage": "hoarfrostcore",
    "ascensionMats": "Calla Lily",
    "ascensionMatsImage": "callalily",
    "talentBooks": "Ballad",
    "weeklyBossDrops": "Spirit Locket of Boreas",
    "weeklyBossDropsImage": "spiritlocketofboreas",
    "constellations": [
      {
        "name": "Excellent Blood",
        "description": "The CRIT Rate of Kaeya's Normal and Charge Attacks against opponents affected by <span style=\"color: #99FFFFFF;\">Cryo</span> is increased by 15%."
      },
      {
        "name": "Never-Ending Performance",
        "description": "Every time <span style=\"color: #FFD780FF;\">Glacial Waltz</span> defeats an opponent during its duration, its duration is increased by 2.5s, up to a maximum of 15s."
      },
      {
        "name": "Dance of Frost",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Frostgnaw</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Frozen Kiss",
        "description": "Triggers automatically when Kaeya's HP falls below 20%:\\nCreates a shield that absorbs damage equal to 30% of Kaeya's Max HP. Lasts for 20s.\\nThis shield absorbs <span style=\"color: #99FFFFFF;\">Cryo DMG</span> with 250% efficiency.\\nCan only occur once every 60s."
      },
      {
        "name": "Frostbiting Embrace",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Glacial Waltz</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Glacial Whirlwind",
        "description": "<span style=\"color: #FFD780FF;\">Glacial Waltz</span> will generate 1 additional icicle, and will regenerate 15 Energy when cast."
      }
    ],
    "passives": [
      {
        "name": "Cold-Blooded Strike",
        "description": "Every hit with <span style=\"color: #FFD780FF;\">Frostgnaw</span> regenerates HP for Kaeya equal to 15% of his ATK."
      },
      {
        "name": "Glacial Heart",
        "description": "Opponents <span style=\"color: #99FFFFFF;\">Frozen</span> by <span style=\"color: #FFD780FF;\">Frostgnaw</span> will drop additional Elemental Particles.\\nFrostgnaw may only produce a maximum of 2 additional Elemental Particles per use."
      },
      {
        "name": "Hidden Strength",
        "description": "Decreases sprinting Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Glacial Waltz",
      "description": "Coalescing the frost in the air, Kaeya summons 3 icicles that revolve around him.\\nThese icicles will follow the character around and deal <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents in their path for the ability's duration.\\n\\n<i>A winsome smile, genial words, and the merciless hoarfrost that lies beneath... These are all Kaeya's weapons.</i>",
      "priority": 3
    },
    "attack": {
      "name": "Normal Attack: Ceremonial Bladework",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 2
    },
    "elementalSkill": {
      "name": "Frostgnaw",
      "description": "Unleashes a frigid blast, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents in front of Kaeya.\\n\\n<i>Kaeya seems affable, but his nature is that of unyielding ice.</i>",
      "priority": 5
    }
  },
  {
    "id": 19,
    "name": "Kamisato Ayaka",
    "description": "Daughter of the Yashiro Commission's Kamisato Clan. Dignified and elegant, as well as wise and strong.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "cryo",
    "profileImage": "kamisato ayaka",
    "statGrow": "critDamage",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Sakura Bloom",
    "ascensionMatsImage": "sakurabloom",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Bloodjade Branch",
    "weeklyBossDropsImage": "bloodjadebranch",
    "constellations": [
      {
        "name": "Snowswept Sakura",
        "description": "When Kamisato Ayaka's Normal or Charged Attacks deal <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents, it has a 50% chance of decreasing the CD of <span style=\"color: #FFD780FF;\">Kamisato Art: Hyouka</span> by 0.3s. This effect can occur once every 0.1s."
      },
      {
        "name": "Blizzard Blade Seki no To",
        "description": "When casting <span style=\"color: #FFD780FF;\">Kamisato Art: Soumetsu</span>, unleashes 2 smaller additional Frostflake Seki no To, each dealing 20% of the original storm's DMG."
      },
      {
        "name": "Frostbloom Kamifubuki",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Kamisato Art: Soumetsu</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Ebb and Flow",
        "description": "Opponents damaged by <span style=\"color: #FFD780FF;\">Kamisato Art: Soumetsu</span>'s Frostflake Seki no To will have their DEF decreased by 30% for 6s."
      },
      {
        "name": "Blossom Cloud Irutsuki",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Kamisato Art: Hyouka</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Dance of Suigetsu",
        "description": "Kamisato Ayaka gains Usurahi Butou every 10s, increasing her Charged Attack DMG by 298%. This buff will be cleared 0.5s after Ayaka's Charged ATK hits an opponent, after which the timer for this ability will restart."
      }
    ],
    "passives": [
      {
        "name": "Amatsumi Kunitsumi Sanctification",
        "description": "After using <span style=\"color: #FFD780FF;\">Kamisato Art: Hyouka</span>, Kamisato Ayaka's Normal and Charged Attacks deal 30% increased DMG for 6s."
      },
      {
        "name": "Kanten Senmyou Blessing",
        "description": "When the Cryo application at the end of <span style=\"color: #FFD780FF;\">Kamisato Art: Senho</span> hits an opponent, Kamisato Ayaka gains the following effects:\\n·Restores 10 Stamina\\n·Gains 18% <span style=\"color: #99FFFFFF;\">Cryo DMG Bonus</span> for 10s."
      },
      {
        "name": "Fruits of Shinsa",
        "description": "When Ayaka crafts Weapon Ascension Materials, she has a 10% chance to receive double the product."
      }
    ],
    "burst": {
      "name": "Kamisato Art: Soumetsu",
      "description": "Summons forth a snowstorm with flawless poise, unleashing a Frostflake Seki no To that moves forward continuously.\\n\\n<span style=\"color: #FFD780FF;\">Frostflake Seki no To</span>\\n·A storm of whirling icy winds that slashes repeatedly at every enemy it touches, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n·The snowstorm explodes after its duration ends, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<i>\"The blizzard veils the heron's thoughts, pity heavy in its heart.\"</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Kamisato Art - Kabuki",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash a flurry of sword ki.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Kamisato Art: Hyouka",
      "description": "Summons blooming ice to launch nearby opponents, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<i>\"Clouds shroud the moonlit night. Longing descends like a fog, filling the one detained with wanderlust.\"</i>",
      "priority": 5
    }
  },
  {
    "id": 20,
    "name": "Kamisato Ayato",
    "description": "The young but highly accomplished head of the Yashiro Commission's Kamisato Clan. Cultured and polite, he is a man of many ways and means.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "hydro",
    "profileImage": "kamisato ayato",
    "statGrow": "critDamage",
    "normalBossDrops": "Dew of Repudiation",
    "normalBossDropsImage": "dewofrepudiation",
    "ascensionMats": "Sakura Bloom",
    "ascensionMatsImage": "sakurabloom",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Mudra of the Malefic General",
    "weeklyBossDropsImage": "mudraofthemaleficgeneral",
    "constellations": [
      {
        "name": "Kyouka Fuushi",
        "description": "<span style=\"color: #FFD780FF;\">Shunsuiken</span> DMG is increased by 40% against opponents with 50% HP or less."
      },
      {
        "name": "World Source",
        "description": "<span style=\"color: #FFD780FF;\">Namisen</span>'s maximum stack count is increased to 5. When Kamisato Ayato has at least 3 Namisen stacks, his Max HP is increased by 50%."
      },
      {
        "name": "To Admire the Flowers",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Kamisato Art: Kyouka</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Endless Flow",
        "description": "After using <span style=\"color: #FFD780FF;\">Kamisato Art: Suiyuu</span>, all nearby party members will have 15% increased Normal Attack SPD for 15s."
      },
      {
        "name": "Bansui Ichiro",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Kamisato Art: Suiyuu</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Boundless Origin",
        "description": "After using <span style=\"color: #FFD780FF;\">Kamisato Art: Kyouka</span>, Ayato's next Shunsuiken attack will create 2 extra Shunsuiken strikes when they hit opponents, each one dealing 450% of Ayato's ATK as DMG.\\nBoth these Shunsuiken attacks will not be affected by Namisen."
      }
    ],
    "passives": [
      {
        "name": "Kamisato Art: Mine Wo Matoishi Kiyotaki",
        "description": "<span style=\"color: #FFD780FF;\">Kamisato Art: Kyouka</span> has the following properties:\\n·After it is used, Kamisato Ayato will gain 2 Namisen stacks.\\n·When the water illusion explodes, Ayato will gain a Namisen effect equal to the maximum number of stacks possible."
      },
      {
        "name": "Kamisato Art: Michiyuku Hagetsu",
        "description": "If Kamisato Ayato is not on the field and his Energy is less than 40, he will regenerate 2 Energy for himself every second."
      },
      {
        "name": "Kamisato Art: Daily Cooking",
        "description": "When Ayato cooks a dish perfectly, he has a 18% chance to receive an additional \"Suspicious\" dish of the same type."
      }
    ],
    "burst": {
      "name": "Kamisato Art: Suiyuu",
      "description": "Unveils a garden of purity that silences the cacophony within.\\nWhile this space exists, Bloomwater Blades will constantly rain down and attack opponents within its AoE, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span> and increasing the Normal Attack DMG of characters within.\\n\\n<i>\"I can see them, you know. The ripples of your beating heart within this realm of still waters.\"</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Kamisato Art - Marobashi",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to dash forward and perform an iai.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "books": {},
      "bossItem": "mudra_of_the_malefic_general",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Kamisato Art: Kyouka",
      "description": "Kamisato Ayato shifts positions and enters the Takimeguri Kanka state.\\nAfter this shift, he will leave a watery illusion at his original location. After it is formed, the watery illusion will explode if opponents are nearby or after its duration ends, dealing <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Takimeguri Kanka</span>\\nIn this state, Kamisato Ayato uses his Shunsuiken to engage in blindingly fast attacks, causing DMG from his Normal Attacks to be converted into <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span>. This cannot be overridden.\\nIt also has the following properties:\\n·After a Shunsuiken attack hits an opponent, it will grant Ayato the Namisen effect, increasing the DMG dealt by Shunsuiken based on Ayato's current Max HP. The initial maximum number of Namisen stacks is 4, and 1 stack can be gained through Shunsuiken every 0.1s. This effect will be dispelled when Takimeguri Kanka ends.\\n·Kamisato Ayato's resistance to interruption is increased.\\n·Unable to use Charged or Plunging Attacks.\\n\\nTakimeguri Kanka will be cleared when Ayato leaves the field. Using Kamisato Art: Kyouka again while in the Takimeguri Kanka state will reset and replace the pre-existing state.\\n\\n<i>\"When, I wonder, did you come under the illusion that you were winning?\"</i>\\n<i>— Ayato is like this in both matter of martial prowess and political intrigue, but to preserve the dignity of his fellow Commissioners, he does not say such things to them. As such, only Thoma, Itto, and Ayaka have ever heard this line.</i>",
      "books": {},
      "bossItem": "mudra_of_the_malefic_general",
      "priority": 5
    }
  },
  {
    "id": 21,
    "name": "Keqing",
    "description": "The Yuheng of the Liyue Qixing. Keqing has much to say about Rex Lapis' unilateral approach to policymaking in Liyue — but in truth, gods admire skeptics such as her quite a lot.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "electro",
    "statGrow": "critDamage",
    "normalBossDrops": "Lightning Prism",
    "normalBossDropsImage": "lightningprism",
    "ascensionMats": "Cor Lapis",
    "ascensionMatsImage": "corlapis",
    "talentBooks": "Prosperity",
    "weeklyBossDrops": "Ring of Boreas",
    "weeklyBossDropsImage": "ringofboreas",
    "profileImage": "keqing",
    "constellations": [
      {
        "name": "Thundering Might",
        "description": "Recasting <span style=\"color: #FFD780FF;\">Stellar Restoration</span> while a Lightning Stiletto is present causes Keqing to deal 50% of her ATK as <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> at the start point and terminus of her Blink."
      },
      {
        "name": "Keen Extraction",
        "description": "When Keqing's Normal and Charged Attacks hit opponents affected by <span style=\"color: #FFACFFFF;\">Electro</span>, they have a 50% chance of producing an Elemental Particle.\\nThis effect can only occur once every 5s."
      },
      {
        "name": "Foreseen Reformation",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Starward Sword</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Attunement",
        "description": "For 10s after Keqing triggers an <span style=\"color: #FFACFFFF;\">Electro-related Elemental Reaction</span>, her ATK is increased by 25%."
      },
      {
        "name": "Beckoning Stars",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Stellar Restoration</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Tenacious Star",
        "description": "When initiating a Normal Attack, a Charged Attack, Elemental Skill or Elemental Burst, Keqing gains a 6% <span style=\"color: #FFACFFFF;\">Electro DMG Bonus</span> for 8s.\\nEffects triggered by Normal Attacks, Charged Attacks, Elemental Skills and Elemental Bursts are considered independent entities."
      }
    ],
    "passives": [
      {
        "name": "Thundering Penance",
        "description": "After recasting <span style=\"color: #FFD780FF;\">Stellar Restoration</span> while a Lightning Stiletto is present, Keqing's weapon gains an <span style=\"color: #FFACFFFF;\">Electro Infusion</span> for 5s."
      },
      {
        "name": "Aristocratic Dignity",
        "description": "When casting <span style=\"color: #FFD780FF;\">Starward Sword</span>, Keqing's CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s."
      },
      {
        "name": "Land's Overseer",
        "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%."
      }
    ],
    "burst": {
      "name": "Starward Sword",
      "description": "Keqing unleashes the power of lightning, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> in an AOE.\\nShe then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby opponents simultaneously that deal multiple instances of <span style=\"color: #FFACFFFF;\">Electro DMG</span>. The final attack deals massive <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>.\\n\\n<i>The swiftest technique in Keqing's personal arsenal is fast enough to bring stars crashing down.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Yunlai Swordsmanship",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 5
    },
    "elementalSkill": {
      "name": "Stellar Restoration",
      "description": "Hurls a Lightning Stiletto that annihilates her opponents like the swift thunder.\\nWhen the Stiletto hits its target, it deals <span style=\"color: #FFACFFFF;\">Electro DMG</span> to opponents in a small AoE, and places a Stiletto Mark on the spot hit.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nHold to adjust the direction in which the Stiletto shall be thrown.\\nStilettos thrown by the Hold attack mode can be suspended in mid-air, allowing Keqing to jump to them when using Stellar Restoration a second time.\\n\\n<span style=\"color: #FFD780FF;\">Lightning Stiletto</span>\\n If Keqing uses Stellar Restoration again or uses a Charged Attack while its duration lasts, it will clear the Stiletto Mark and produce different effects:\\n·If she uses Stellar Restoration again, she will blink to the location of the Mark and unleash one slashing attack that deals <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>. When blinking to a Stiletto that was thrown from a Holding attack, Keqing can leap across obstructing terrain.\\n·If Keqing uses a Charged Attack, she will ignite a series of thundering cuts at the Mark's location, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>.\\n\\n<i>\"Humans are like moths, endlessly chasing the flame we call gods and adepti. But this light that I have here is my own.\"</i>",
      "priority": 3
    }
  },
  {
    "id": 22,
    "name": "Klee",
    "description": "An explosives expert and a regular at the Knights of Favonius' confinement room. Also known as Fleeing Sunlight.",
    "weapon": "catalyst",
    "rarity": "legendary",
    "vision": "pyro",
    "profileImage": "klee",
    "statGrow": "pyroDamageBonus",
    "normalBossDrops": "Everflame Seed",
    "normalBossDropsImage": "everflameseed",
    "ascensionMats": "Philanemo Mushroom",
    "ascensionMatsImage": "philanemomushroom",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Ring of Boreas",
    "weeklyBossDropsImage": "ringofboreas",
    "constellations": [
      {
        "name": "Chained Reactions",
        "description": "Attacks and Skills have a certain chance to summon sparks that bombard opponents, dealing DMG equal to 120% of <span style=\"color: #FFD780FF;\">Sparks 'n' Splash</span>'s DMG."
      },
      {
        "name": "Explosive Frags",
        "description": "Being hit by <span style=\"color: #FFD780FF;\">Jumpy Dumpty</span>'s mines decreases opponents' DEF by 23% for 10s."
      },
      {
        "name": "Exquisite Compound",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Jumpy Dumpty</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Sparkly Explosion",
        "description": "If Klee leaves the field during the duration of <span style=\"color: #FFD780FF;\">Sparks 'n' Splash</span>, her departure triggers an explosion that deals 555% of her ATK as <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>."
      },
      {
        "name": "Nova Burst",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Sparks 'n' Splash</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Blazing Delight",
        "description": "While under the effects of <span style=\"color: #FFD780FF;\">Sparks 'n' Splash</span>, Klee will regenerate 3 Energy for all members of the party (excluding Klee) every 3s.\\nWhen <span style=\"color: #FFD780FF;\">Sparks 'n' Splash</span> is used, all party members will gain a 10% <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> for 25s."
      }
    ],
    "passives": [
      {
        "name": "Pounding Surprise",
        "description": "When <span style=\"color: #FFD780FF;\">Jumpy Dumpty</span> and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark.\\nThis Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG."
      },
      {
        "name": "Sparkling Burst",
        "description": "When Klee's Charged Attack results in a CRIT Hit, all party members gain 2 Elemental Energy."
      },
      {
        "name": "All Of My Treasures!",
        "description": "Displays the location of nearby <span style=\"color: #FFD780FF;\">resources unique to Mondstadt</span> on the mini-map."
      }
    ],
    "burst": {
      "name": "Sparks 'n' Splash",
      "description": "Klee's Blazing Delight! For the duration of this ability, continuously summons Sparks 'n' Splash to attack nearby opponents, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\n\\n<i>The knights all believe that Klee must have a lucky star watching over her to have never been hurt by any of her own bombs...</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Kaboom!",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nThrows things that go boom when they hit things! Perform up to 3 explosive attacks, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina and deals <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> to opponents after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the power of Pyro, Klee plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> upon impact with the ground.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Jumpy Dumpty",
      "description": "Jumpy Dumpty is tons of boom-bang-fun! \\nWhen thrown, Jumpy Dumpty bounces thrice, igniting and dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> with every bounce.\\n\\nOn the third bounce, the bomb splits into many mines.\\nThe mines will explode upon contact with opponents, or after a short period of time, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\n\\nStarts with 2 charges.\\n\\n<i>Jumpy Dumpty is Klee's good friend! She can't help but introduce him to everyone.</i>",
      "priority": 5
    }
  },
  {
    "id": 23,
    "name": "Kujou Sara",
    "description": "A general of the Tenryou Commission. Bold, decisive, and skilled in battle.",
    "weapon": "bow",
    "rarity": "rare",
    "vision": "electro",
    "profileImage": "kujou sara",
    "statGrow": "atkPercent",
    "normalBossDrops": "Storm Beads",
    "normalBossDropsImage": "stormbeads",
    "ascensionMats": "Dendrobium",
    "ascensionMatsImage": "dendrobium",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Ashen Heart",
    "weeklyBossDropsImage": "ashenheart",
    "constellations": [
      {
        "name": "Crow's Eye",
        "description": "When Tengu Juurai grant characters ATK Bonuses or hits opponents, the CD of <span style=\"color: #FFD780FF;\">Tengu Stormcall</span> is decreased by 1s.\\nThis effect can be triggered once every 3s."
      },
      {
        "name": "Dark Wings",
        "description": "Unleashing <span style=\"color: #FFD780FF;\">Tengu Stormcall</span> will leave a weaker Crowfeather at Kujou Sara's original position that will deal 30% of its original DMG."
      },
      {
        "name": "The War Within",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Subjugation: Koukou Sendou</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Conclusive Proof",
        "description": "The number of Tengu Juurai: Stormcluster released by <span style=\"color: #FFD780FF;\">Subjugation: Koukou Sendou</span> is increased to 6."
      },
      {
        "name": "Spellsinger",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Tengu Stormcall</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Sin of Pride",
        "description": "The <span style=\"color: #FFACFFFF;\">Electro DMG</span> of characters who have had their ATK increased by Tengu Juurai has its Crit DMG increased by 60%."
      }
    ],
    "passives": [
      {
        "name": "Immovable Will",
        "description": "While in the Crowfeather Cover state provided by <span style=\"color: #FFD780FF;\">Tengu Stormcall</span>, Aimed Shot charge times are decreased by 60%."
      },
      {
        "name": "Decorum",
        "description": "When Tengu Juurai: Ambush hits opponents, Kujou Sara will restore 1.2 Energy to all party members for every 100% Energy Recharge she has. This effect can be triggered once every 3s."
      },
      {
        "name": "Land Survey",
        "description": "When dispatched on an expedition in Inazuma, time consumed is reduced by 25%."
      }
    ],
    "burst": {
      "name": "Subjugation: Koukou Sendou",
      "description": "Casts down Tengu Juurai: Titanbreaker, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>. Afterwards, Tengu Juurai: Titanbreaker spreads out into 4 consecutive bouts of Tengu Juurai: Stormcluster, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>.\\nTengu Juurai: Titanbreaker and Tengu Juurai: Stormcluster can provide the active character within their AoE with the same ATK Bonus as given by the Elemental Skill, Tengu Stormcall.\\n\\nThe ATK Bonus provided by various kinds of Tengu Juurai will not stack, and their effects and duration will be determined by the last Tengu Juurai to take effect.\\n\\n<i>Sara departed from her people, the tengu, and also temporarily lost her faith in the Tenryou Commission. But once the clouds over her heart cleared, she found her own lightning anew.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Tengu Bowmanship",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, crackling lightning will accumulate on the arrowhead. An arrow fully charged with the storm's might will deal <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\nWhen in the Crowfeather Cover state, a fully-charged arrow will leave a Crowfeather behind after it hits.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Tengu Stormcall",
      "description": "Retreats rapidly with the speed of a tengu, summoning the protection of the Crowfeather.\\nGains Crowfeather Cover for 18s, and when Kujou Sara fires a fully-charged Aimed Shot, Crowfeather Cover will be consumed, and will leave a Crowfeather at the target location.\\nCrowfeathers will trigger Tengu Juurai: Ambush after a short time, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> and granting the active character within its AoE an ATK Bonus based on Kujou Sara's Base ATK.\\n\\nThe ATK Bonuses from different Tengu Juurai will not stack, and their effects and duration will be determined by the last Tengu Juurai to take effect.\\n\\n<i>The tengu race have never lacked for exceptional talents who have received an Electro Vision. It's just that they often habitually chant praises to the Electro Archon while manipulating Electro. The chants go something like this</i>\\n<i>\"Show forth your might, O praiseworthy Narukami, and grant this supplicant your thunderous might! Sowaka!\"</i>",
      "priority": 5
    }
  },
  {
    "id": 24,
    "name": "Lisa",
    "description": "The languid but knowledgeable Librarian of the Knights of Favonius, deemed by Sumeru Academia to be their most distinguished graduate in the past two centuries.",
    "weapon": "catalyst",
    "rarity": "rare",
    "vision": "electro",
    "profileImage": "lisa",
    "statGrow": "em",
    "normalBossDrops": "Lightning Prism",
    "normalBossDropsImage": "lightningprism",
    "ascensionMats": "Valberry",
    "ascensionMatsImage": "valberry",
    "talentBooks": "Ballad",
    "weeklyBossDrops": "Dvalin's Claw",
    "weeklyBossDropsImage": "dvalinsclaw",
    "constellations": [
      {
        "name": "Infinite Circuit",
        "description": "Lisa regenerates 2 Energy for every opponent hit while holding <span style=\"color: #FFD780FF;\">Violet Arc</span>.\\nA maximum of 10 Energy can be regenerated in this manner at any one time."
      },
      {
        "name": "Electromagnetic Field",
        "description": "Holding <span style=\"color: #FFD780FF;\">Violet Arc</span> has the following effects:\\n·Increases DEF by 25%.\\n·Increases Lisa's resistance to interruption."
      },
      {
        "name": "Resonant Thunder",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Lightning Rose</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Plasma Eruption",
        "description": "Increases the number of lightning bolts released by <span style=\"color: #FFD780FF;\">Lightning Rose</span> by 1-3."
      },
      {
        "name": "Electrocute",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Violet Arc</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Pulsating Witch",
        "description": "When Lisa takes the field, she applies 3 stacks of <span style=\"color: #FFD780FF;\">Violet Arc</span>'s Conductive status onto nearby opponents.\\nThis effect can only occur once every 5s."
      }
    ],
    "passives": [
      {
        "name": "Induced Aftershock",
        "description": "Hits by Charged Attacks apply <span style=\"color: #FFD780FF;\">Violet Arc</span>'s Conductive status to opponents."
      },
      {
        "name": "Static Electricity Field",
        "description": "Opponents hit by <span style=\"color: #FFD780FF;\">Lightning Rose</span> have their DEF decreased by 15% for 10s."
      },
      {
        "name": "General Pharmaceutics",
        "description": "When Lisa crafts a potion, she has a 20% chance to refund a portion of the crafting materials used."
      }
    ],
    "burst": {
      "name": "Lightning Rose",
      "description": "Summons a Lightning Rose that unleashes powerful lightning bolts, launching surrounding opponents and dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\nThe Lightning Rose will continuously emit lightning to knock back opponents and deal <span style=\"color: #FFACFFFF;\">Electro DMG</span> throughout the ability's duration.\\n\\n<i>This rose is beautiful, but beware its mortal thorns.</i>",
      "priority": 3
    },
    "attack": {
      "name": "Normal Attack: Lightning Touch",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 lightning attacks that deal <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to deal <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the might of Electro, Lisa plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> upon impact with the ground.",
      "priority": 2
    },
    "elementalSkill": {
      "name": "Violet Arc",
      "description": "Channels the power of lightning to sweep bothersome matters away.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nReleases a homing Lightning Orb.\\nOn hit, it deals <span style=\"color: #FFACFFFF;\">Electro DMG</span>, and applies a stack of the Conductive status (Max 3 stacks) to opponents in a small AoE.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nAfter an extended casting time, calls down lightning from the heavens, dealing massive <span style=\"color: #FFACFFFF;\">Electro DMG</span> to all nearby opponents.\\nDeals great amounts of extra damage to opponents based on the number of Conductive stacks applied to them, and clears their Conductive status.\\n\\n<i>Electro Purple is the raiment of the Witch of Purple Rose.</i>",
      "priority": 4
    }
  },
  {
    "id": 25,
    "name": "Mona",
    "description": "A mysterious young astrologer who proclaims herself to be \"Astrologist Mona Megistus,\" and who possesses abilities to match the title. Erudite, but prideful.",
    "weapon": "catalyst",
    "rarity": "legendary",
    "vision": "hydro",
    "profileImage": "mona",
    "statGrow": "er",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "cleansingheart",
    "ascensionMats": "Philanemo Mushroom",
    "ascensionMatsImage": "philanemomushroom",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Ring of Boreas",
    "weeklyBossDropsImage": "ringofboreas",
    "constellations": [
      {
        "name": "Prophecy of Submersion",
        "description": "When any of your own party members hits an opponent affected by an Omen, the effects of <span style=\"color: #80C0FFFF;\">Hydro-related Elemental Reactions</span> are enhanced for 8s:\\n·Electro-Charged DMG increases by 15%.\\n·Vaporize DMG increases by 15%.\\n·Hydro Swirl DMG increases by 15%.\\n·Frozen duration is extended by 15%."
      },
      {
        "name": "Lunar Chain",
        "description": "When a Normal Attack hits, there is a 20% chance that it will be automatically followed by a Charged Attack.\\nThis effect can only occur once every 5s."
      },
      {
        "name": "Restless Revolution",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Stellaris Phantasm</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Prophecy of Oblivion",
        "description": "When any party member attacks an opponent affected by an Omen, their CRIT Rate is increased by 15%."
      },
      {
        "name": "Mockery of Fortuna",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Mirror Reflection of Doom</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Rhetorics of Calamitas",
        "description": "Upon entering <span style=\"color: #FFD780FF;\">Illusory Torrent</span>, Mona gains a 60% increase to the DMG of her next Charged Attack per second of movement.\\nA maximum DMG Bonus of 180% can be achieved in this manner. The effect lasts for no more than 8s."
      }
    ],
    "passives": [
      {
        "name": "\"Come 'n' Get Me, Hag!\"",
        "description": "After she has used <span style=\"color: #FFD780FF;\">Illusory Torrent</span> for 2s, if there are any opponents nearby, Mona will automatically create a Phantom.\\nA Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of <span style=\"color: #FFD780FF;\">Mirror Reflection of Doom</span>."
      },
      {
        "name": "Waterborne Destiny",
        "description": "Increases Mona's <span style=\"color: #80C0FFFF;\">Hydro DMG Bonus</span> by a degree equivalent to 20% of her Energy Recharge rate."
      },
      {
        "name": "Principium of Astrology",
        "description": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used."
      }
    ],
    "burst": {
      "name": "Stellaris Phantasm",
      "description": "Mona summons the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE.\\n\\n<span style=\"color: #FFD780FF;\">Illusory Bubble</span>\\nTraps opponents inside a pocket of destiny and also makes them <span style=\"color: #80C0FFFF;\">Wet</span>. Renders weaker opponents immobile.\\nWhen an opponent affected by Illusory Bubble sustains DMG, it has the following effects:\\n·Applies an Omen to the opponent, which gives a DMG Bonus, also increasing the DMG of the attack that causes it.\\n·Removes the Illusory Bubble, dealing <span style=\"color: #80C0FFFF;\">Hydro</span> DMG in the process.\\n\\n<span style=\"color: #FFD780FF;\">Omen</span>\\nDuring its duration, increases DMG taken by opponents.\\n\\n<i>It was from the time that gods first traced the lights in the heavens with their eyes that the notion of \"fate\" was born.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Ripple of Fate",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 water splash attacks that deal <span style=\"color: #80C0FFFF;\">Hydro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to deal <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the might of Hydro, Mona plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> upon impact with the ground.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Mirror Reflection of Doom",
      "description": "Creates an illusory Phantom of Fate from coalesced waterspouts.\\n\\nThe <span style=\"color: #FFD780FF;\">Phantom</span> has the following special properties:\\n·Continuously taunts nearby opponents, attracting their fire.\\n·Continuously deals <span style=\"color: #80C0FFFF;\">Hydro DMG</span> to nearby opponents.\\n·When its duration expires, the Phantom explodes, dealing <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nUtilizes water currents to move backwards swiftly before conjuring a Phantom.\\n\\nOnly one Phantom created by Mirror Reflection of Doom can exist at any time.\\n\\n<i>Skilled astrologers have always dreamed of using a phantom facsimile of themselves to ward off imminent ill fate, but Mona must be the first to make such a mockery of it in all of Teyvat.</i>",
      "priority": 4
    }
  },
  {
    "id": 26,
    "name": "Ningguang",
    "description": "The Tianquan of the Liyue Qixing. Her wealth is unsurpassed in all of Teyvat.",
    "weapon": "catalyst",
    "rarity": "rare",
    "vision": "geo",
    "profileImage": "ningguang",
    "statGrow": "geoDamageBonus",
    "normalBossDrops": "Basalt Pillar",
    "normalBossDropsImage": "basaltpillar",
    "ascensionMats": "Glaze Lily",
    "ascensionMatsImage": "glazelily",
    "talentBooks": "Prosperity",
    "weeklyBossDrops": "Spirit Locket of Boreas",
    "weeklyBossDropsImage": "spiritlocketofboreas",
    "constellations": [
      {
        "name": "Piercing Fragments",
        "description": "When a Normal Attack hits, it deals AoE DMG."
      },
      {
        "name": "Shock Effect",
        "description": "When <span style=\"color: #FFD780FF;\">Jade Screen</span> is shattered, its CD will reset.\\nCan occur once every 6s."
      },
      {
        "name": "Majesty be the Array of Stars",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Starshatter</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Exquisite be the Jade, Outshining All Beneath",
        "description": "<span style=\"color: #FFD780FF;\">Jade Screen</span> increases nearby characters' Elemental RES by 10%."
      },
      {
        "name": "Invincible be the Jade Screen",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Jade Screen</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Grandeur be the Seven Stars",
        "description": "When <span style=\"color: #FFD780FF;\">Starshatter</span> is used, Ningguang gains 7 Star Jades."
      }
    ],
    "passives": [
      {
        "name": "Backup Plan",
        "description": "When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina."
      },
      {
        "name": "Strategic Reserve",
        "description": "A character that passes through the <span style=\"color: #FFD780FF;\">Jade Screen</span> will gain a 12% <span style=\"color: #FFE699FF;\">Geo DMG Bonus</span> for 10s."
      },
      {
        "name": "Trove of Marvelous Treasures",
        "description": "Displays the location of nearby <span style=\"color: #FFD780FF;\">ore veins</span> (Iron Ore, White Iron Ore, Crystal Ore, Magical Crystal Ore, and Starsilver) on the mini-map."
      }
    ],
    "burst": {
      "name": "Starshatter",
      "description": "Gathering a great number of gems, Ningguang scatters them all at once, sending homing projectiles at her opponents that deal massive <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\nIf Starshatter is cast when a Jade Screen is nearby, the Jade Screen will fire additional gem projectiles at the same time.\\n\\n<i>Stars shatter. Silence falls.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Sparkling Scatter",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nShoots gems that deal <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\nUpon hit, this grants Ningguang 1 Star Jade.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of stamina to fire off a giant gem that deals <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\nIf Ningguang has any Star Jades, unleashing a Charged Attack will cause the Star Jades to be fired at the enemy as well, dealing additional DMG.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the might of Geo, Ningguang plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> upon impact with the ground.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Jade Screen",
      "description": "Ningguang creates a Jade Screen out of gold, obsidian and her great opulence, dealing <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Jade Screen</span>\\n·Blocks opponents' projectiles.\\n·Endurance scales based on Ningguang's Max HP.\\n\\nJade Screen is considered a <span style=\"color: #FFE699FF;\">Geo Construct</span> and can be used to block certain attacks, but cannot be climbed. Only one Jade Screen may exist at any one time.\\n\\n<i>The canvas of stars is written upon this jade screen.</i>",
      "priority": 4
    }
  },
  {
    "id": 27,
    "name": "Noelle",
    "description": "A maid who faithfully serves the Knights of Favonius. She dreams of joining their ranks someday.",
    "weapon": "claymore",
    "rarity": "rare",
    "vision": "geo",
    "profileImage": "noelle",
    "statGrow": "defPercent",
    "normalBossDrops": "Basalt Pillar",
    "normalBossDropsImage": "basaltpillar",
    "ascensionMats": "Valberry",
    "ascensionMatsImage": "valberry",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Dvalin's Claw",
    "weeklyBossDropsImage": "dvalinsclaw",
    "constellations": [
      {
        "name": "I Got Your Back",
        "description": "While <span style=\"color: #FFD780FF;\">Sweeping Time</span> and <span style=\"color: #FFD780FF;\">Breastplate</span> are both in effect, the chance of Breastplate's healing effects activating is increased to 100%."
      },
      {
        "name": "Combat Maid",
        "description": "Decreases the Stamina Consumption of Noelle's Charged Attacks by 20% and increases her Charged Attack DMG by 15%."
      },
      {
        "name": "Invulnerable Maid",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Breastplate</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "To Be Cleaned",
        "description": "When <span style=\"color: #FFD780FF;\">Breastplate</span>'s duration expires or it is destroyed by DMG, it will deal 400% ATK of <span style=\"color: #FFE699FF;\">Geo DMG</span> to surrounding opponents."
      },
      {
        "name": "Favonius Sweeper Master",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Sweeping Time</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Must Be Spotless",
        "description": "<span style=\"color: #FFD780FF;\">Sweeping Time</span> increases Noelle's ATK by an additional 50% of her DEF.\\nAdditionally, every opponent defeated during the skill's duration adds 1s to the duration, up to 10s."
      }
    ],
    "passives": [
      {
        "name": "Devotion",
        "description": "When Noelle is in the party but not on the field, this ability triggers automatically when your active character's HP falls below 30%:\\nCreates a shield for your active character that lasts for 20s and absorbs DMG equal to 400% of Noelle's DEF.\\nThe shield has a 150% DMG Absorption effectiveness against all Elemental and Physical DMG.\\nThis effect can only occur once every 60s."
      },
      {
        "name": "Nice and Clean",
        "description": "Every 4 Normal or Charged Attack hits will decrease the CD of <span style=\"color: #FFD780FF;\">Breastplate</span> by 1s.\\nHitting multiple opponents with a single attack is only counted as 1 hit."
      },
      {
        "name": "Maid's Knighthood",
        "description": "When a Perfect Cooking is achieved on a DEF-boosting dish, Noelle has a 12% chance to obtain double the product."
      }
    ],
    "burst": {
      "name": "Sweeping Time",
      "description": "Gathering the strength of stone around her weapon, Noelle strikes the opponents surrounding her within a large AoE, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\nAfterwards, Noelle gains the following effects:\\n·Larger attack AoE.\\n·Converts attack DMG to <span style=\"color: #FFE699FF;\">Geo DMG</span> that cannot be overridden by any other elemental infusion.\\n·Increased ATK that scales based on her DEF.\\n\\n<i>Sometimes, it's not just dust that needs sweeping...</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Favonius Bladework - Maid",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\\nAt end of the sequence, perform a more powerful slash. \\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Breastplate",
      "description": "Summons protective stone armor, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span> to surrounding opponents and creating a shield. The shield's DMG Absorption scales based on Noelle's DEF.\\nThe shield has the following properties:\\n·When Noelle's Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters.\\n·Possesses 150% DMG Absorption efficiency against all Elemental and Physical DMG.\\n\\nThe amount of HP healed when regeneration is triggered scales based on Noelle's DEF.\\n\\n<i>Noelle is both a dutiful maid and a valiant knight.</i>",
      "priority": 5
    }
  },
  {
    "id": 28,
    "name": "Qiqi",
    "description": "An apprentice and herb gatherer at Bubu Pharmacy. An undead with a bone-white complexion, she seldom has much in the way of words or emotion.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "cryo",
    "profileImage": "qiqi",
    "statGrow": "healingBonus",
    "normalBossDrops": "Hoarfrost Core",
    "normalBossDropsImage": "hoarfrostcore",
    "ascensionMats": "Violetgrass",
    "ascensionMatsImage": "violetgrass",
    "talentBooks": "Prosperity",
    "weeklyBossDrops": "Tail of Boreas",
    "weeklyBossDropsImage": "tailofboreas",
    "constellations": [
      {
        "name": "Ascetics of Frost",
        "description": "When the Herald of Frost hits an opponent marked by a Fortune-Preserving Talisman, Qiqi regenerates 2 Energy."
      },
      {
        "name": "Frozen to the Bone",
        "description": "Qiqi's Normal and Charge Attack DMG against opponents affected by <span style=\"color: #99FFFFFF;\">Cryo</span> is increased by 15%."
      },
      {
        "name": "Ascendant Praise",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Adeptus Art: Preserver of Fortune</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Divine Suppression",
        "description": "Targets marked by the Fortune-Preserving Talisman have their ATK decreased by 20%."
      },
      {
        "name": "Crimson Lotus Bloom",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Adeptus Art: Herald of Frost</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Rite of Resurrection",
        "description": "Using <span style=\"color: #FFD780FF;\">Adeptus Art: Preserver of Fortune</span> revives all fallen party members nearby and regenerates 50% of their HP.\\nThis effect can only occur once every 15 mins."
      }
    ],
    "passives": [
      {
        "name": "Life-Prolonging Methods",
        "description": "When a character under the effects of <span style=\"color: #FFD780FF;\">Adeptus Art: Herald of Frost</span> triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s."
      },
      {
        "name": "A Glimpse into Arcanum",
        "description": "When Qiqi hits opponents with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur once every 30s."
      },
      {
        "name": "Former Life Memories",
        "description": "Displays the location of nearby <span style=\"color: #FFD780FF;\">resources unique to Liyue</span> on the mini-map."
      }
    ],
    "burst": {
      "name": "Adeptus Art: Preserver of Fortune",
      "description": "Qiqi releases the adeptus power sealed within her body, marking nearby opponents with a Fortune-Preserving Talisman that deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Fortune-Preserving Talisman</span>\\nWhen opponents affected by this Talisman take DMG, the character that dealt this DMG regenerates HP.\\n\\n<i>\"I am the Fortune Preserver, the Maiden of Resurrection.\"</i>\\n<i>— Qiqi does not remember these words.</i>",
      "priority": 3
    },
    "attack": {
      "name": "Normal Attack: Ancient Sword Art",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Adeptus Art: Herald of Frost",
      "description": "Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to surrounding opponents.\\n\\n<span style=\"color: #FFD780FF;\">Herald of Frost</span>\\n·On hit, Qiqi's Normal and Charged Attacks regenerate HP for your own party members and nearby teammates. Healing scales based on Qiqi's ATK.\\n·Periodically regenerates your active character's HP.\\n·Follows the character around, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents in their path.\\n\\n<i>I use this to prevent warming and rot... of Dr. Bai's precious ingredients. Yes.</i>",
      "priority": 5
    }
  },
  {
    "id": 29,
    "name": "Raiden Shogun",
    "description": "Her Excellency, the Almighty Narukami Ogosho, who promised the people of Inazuma an unchanging Eternity.",
    "weapon": "polearm",
    "rarity": "legendary",
    "vision": "electro",
    "profileImage": "raiden shogun",
    "statGrow": "er",
    "normalBossDrops": "Storm Beads",
    "normalBossDropsImage": "stormbeads",
    "ascensionMats": "Amakumo Fruit",
    "ascensionMatsImage": "amakumofruit",
    "talentBooks": "Light",
    "weeklyBossDrops": "Molten Moment",
    "weeklyBossDropsImage": "moltenmoment",
    "constellations": [
      {
        "name": "Ominous Inscription",
        "description": "<span style=\"color: #FFD780FF;\">Chakra Desiderata</span> will gather Resolve even faster. When <span style=\"color: #FFACFFFF;\">Electro</span> characters use their Elemental Bursts, the Resolve gained is increased by 80%. When characters of other Elemental Types use their Elemental Bursts, the Resolve gained is increased by 20%."
      },
      {
        "name": "Steelbreaker",
        "description": "<span style=\"color: #FFD780FF;\">Secret Art: Musou Shinsetsu</span>'s Musou no Hitotachi and Musou Isshin attacks will ignore 60% of opponents' DEF."
      },
      {
        "name": "Shinkage Bygones",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Secret Art: Musou Shinsetsu</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Pledge of Propriety",
        "description": "When the <span style=\"color: #FFD780FF;\">Musou Isshin</span> state applied by <span style=\"color: #FFD780FF;\">Secret Art: Musou Shinsetsu</span> expires, all nearby party members (excluding the Raiden Shogun) gain 30% bonus ATK for 10s."
      },
      {
        "name": "Shogun's Descent",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Transcendence: Baleful Omen</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Wishbearer",
        "description": "While in the <span style=\"color: #FFD780FF;\">Musou Isshin</span> state applied by <span style=\"color: #FFD780FF;\">Secret Art: Musou Shinsetsu</span>, attacks by the Raiden Shogun that are considered part of her Elemental Burst will decrease all nearby party members' (not including the Raiden Shogun herself) Elemental Burst CD by 1s when they hit opponents.\\nThis effect can trigger once every 1s and can trigger a total of 5 times during Musou Isshin's duration."
      }
    ],
    "passives": [
      {
        "name": "Wishes Unnumbered",
        "description": "When nearby party members gain Elemental Orbs or Particles, <span style=\"color: #FFD780FF;\">Chakra Desiderata</span> gains 2 Resolve stacks.\\nThis effect can occur once every 3s."
      },
      {
        "name": "Enlightened One",
        "description": "Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her:\\n·0.6% greater Energy restoration from <span style=\"color: #FFD780FF;\">Musou Isshin</span>\\n·0.4% <span style=\"color: #FFACFFFF;\">Electro DMG Bonus</span>."
      },
      {
        "name": "All-Preserver",
        "description": "Mora expended when ascending Swords and Polearms is decreased by 50%."
      }
    ],
    "burst": {
      "name": "Secret Art: Musou Shinsetsu",
      "description": "Gathering truths unnumbered and wishes uncounted, the Raiden Shogun unleashes the Musou no Hitotachi and deals <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>, using Musou Isshin in combat for a certain duration afterward. The DMG dealt by Musou no Hitotachi and Musou Isshin's attacks will be increased based on the number of Chakra Desiderata's Resolve stacks consumed when this skill is used.\\n\\n<span style=\"color: #FFD780FF;\">Musou Isshin</span>\\nWhile in this state, the Raiden Shogun will wield her tachi in battle, while her Normal, Charged, and Plunging Attacks will be infused with <span style=\"color: #FFACFFFF;\">Electro DMG</span>, which cannot be overridden. When such attacks hit opponents, she will regenerate Energy for all nearby party members. Energy can be restored this way once every 1s, and this effect can be triggered 5 times throughout this skill's duration.\\nWhile in this state, the Raiden Shogun's resistance to interruption is increased, and she is immune to <span style=\"color: #FFACFFFF;\">Electro-Charged</span> reaction DMG.\\nWhile Musou Isshin is active, the Raiden Shogun's Normal, Charged, and Plunging Attack DMG will be considered Elemental Burst DMG.\\n\\nThe effects of Musou Isshin will be cleared when the Raiden Shogun leaves the field.\\n\\n<span style=\"color: #FFD780FF;\">Chakra Desiderata</span>\\nWhen nearby party members (excluding the Raiden Shogun herself) use their Elemental Bursts, the Raiden Shogun will build up Resolve stacks based on the Energy Cost of these Elemental Bursts.\\nThe maximum number of Resolve stacks is 60.\\n\\nThe Resolve gained by Chakra Desiderata will be cleared 300s after the Raiden Shogun leaves the field.\\n\\n<i>This is the Raiden Shogun's new secret technique. Abandoning the void-like \"Musou,\" she now shoulders a new \"Musou\" — the dreams and ambitions of all. Just as \"shinsetsu,\" \"the truth,\" also means \"the new,\" so too has Inazuma entered a new chapter.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Origin",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 5 consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to perform an upward slash.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Transcendence: Baleful Omen",
      "description": "The Raiden Shogun unveils a shard of her Euthymia, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> to nearby opponents, and granting nearby party members the Eye of Stormy Judgment.\\n\\n<span style=\"color: #FFD780FF;\">Eye of Stormy Judgment</span>\\n·When characters with this buff attack and deal DMG to opponents, the Eye will unleash a coordinated attack, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> at the opponent's position.\\n·Characters who gain the Eye of Stormy Judgment will have their Elemental Burst DMG increased based on the Energy Cost of the Elemental Burst during the Eye's duration.\\n\\nThe Eye can initiate one coordinated attack every 0.9s per party.\\nCoordinated attacks generated by characters not controlled by you deal 20% of the normal DMG.\\n\\n<i>Beings of great divinity might affect all that they survey, and the Electro Archon can manipulate the very inauspicious stars themselves to defend her retainers and bring a thundering sentence down on their foes.</i>",
      "priority": 4
    }
  },
  {
    "id": 30,
    "name": "Razor",
    "description": "A boy who lives among the wolves in Wolvendom of Mondstadt, away from human civilization. As agile as lightning.",
    "weapon": "claymore",
    "rarity": "rare",
    "vision": "electro",
    "profileImage": "razor",
    "statGrow": "physicalDamageBonus",
    "normalBossDrops": "Lightning Prism",
    "normalBossDropsImage": "lightningprism",
    "ascensionMats": "Wolfhook",
    "ascensionMatsImage": "wolfhook",
    "talentBooks": "Resistance",
    "weeklyBossDrops": "Dvalin's Claw",
    "weeklyBossDropsImage": "dvalinsclaw",
    "constellations": [
      {
        "name": "Wolf's Instinct",
        "description": "Picking up an Elemental Orb or Particle increases Razor's DMG by 10% for 8s."
      },
      {
        "name": "Suppression",
        "description": "Increases CRIT Rate against opponents with less than 30% HP by 10%."
      },
      {
        "name": "Soul Companion",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Lightning Fang</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Bite",
        "description": "When casting <span style=\"color: #FFD780FF;\">Claw and Thunder</span> (Press), opponents hit will have their DEF decreased by 15% for 7s."
      },
      {
        "name": "Sharpened Claws",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Claw and Thunder</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Lupus Fulguris",
        "description": "Every 10s, Razor's sword charges up, causing the next Normal Attack to release lightning that deals 100% of Razor's ATK as <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\nWhen Razor is not using <span style=\"color: #FFD780FF;\">Lightning Fang</span>, a lightning strike on an opponent will grant Razor an Electro Sigil for <span style=\"color: #FFD780FF;\">Claw and Thunder</span>."
      }
    ],
    "passives": [
      {
        "name": "Awakening",
        "description": "Decreases <span style=\"color: #FFD780FF;\">Claw and Thunder</span>'s CD by 18%.\\nUsing <span style=\"color: #FFD780FF;\">Lightning Fang</span> resets the CD of <span style=\"color: #FFD780FF;\">Claw and Thunder</span>."
      },
      {
        "name": "Hunger",
        "description": "When Razor's Energy is below 50%, increases Energy Recharge by 30%."
      },
      {
        "name": "Wolvensprint",
        "description": "Decreases sprinting Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Lightning Fang",
      "description": "Summons the Wolf Within which deals <span style=\"color: #FFACFFFF;\">Electro DMG</span> to all nearby opponents. This clears all of Razor's Electro Sigils, which will be converted into elemental energy for him.\\nThe Wolf Within will fight alongside Razor for the skill's duration.\\n\\n<span style=\"color: #FFD780FF;\">The Wolf Within</span>\\n·Strikes alongside Razor's normal attacks, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\n·Raises Razor's ATK SPD and <span style=\"color: #FFACFFFF;\">Electro RES</span>.\\n·Causes Razor to be immune to DMG inflicted by the <span style=\"color: #FFACFFFF;\">Electro-Charged</span> status.\\n·Disables Razor's Charged Attacks.\\n·Increases Razor's resistance to interruption.\\n\\nThese effects end when Razor leaves the battlefield.\\nWhen Razor leaves the field, a maximum of 10 Energy will be returned to him based off the duration remaining on this skill.\\n\\n<i>The wolf has awoken. The hunt is on.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Steel Fang",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\\nAt end of the sequence, perform a more powerful slash. \\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Claw and Thunder",
      "description": "Hunts his prey using the techniques taught to him by his master and his Lupical.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nSwings the Thunder Wolf Claw, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> to opponents in front of Razor.\\nUpon striking an opponent, Razor will gain an Electro Sigil, which increases his Energy Recharge rate.\\nRazor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nGathers Electro energy to unleash a lightning storm over a small AoE, causing massive <span style=\"color: #FFACFFFF;\">Electro DMG</span>, and clears all of Razor's Electro Sigils.\\nEach Electro Sigil cleared in this manner will be converted into Energy for Razor.\\n\\n<i>In the moment when lightning strikes, you can sometimes glimpse the look of a predator sizing up his prey deep within Razor's eyes.</i>",
      "priority": 4
    }
  },
  {
    "id": 31,
    "name": "Rosaria",
    "description": "A sister of the church, though you wouldn't know it if it weren't for her attire. Known for her sharp, cold words and manner, she often works alone.",
    "weapon": "polearm",
    "rarity": "rare",
    "vision": "cryo",
    "profileImage": "rosaria",
    "statGrow": "atkPercent",
    "normalBossDrops": "Hoarfrost Core",
    "normalBossDropsImage": "hoarfrostcore",
    "ascensionMats": "Valberry",
    "ascensionMatsImage": "valberry",
    "talentBooks": "Ballad",
    "weeklyBossDrops": "Shadow of the Warrior",
    "weeklyBossDropsImage": "shadowofthewarrior",
    "constellations": [
      {
        "name": "Unholy Revelation",
        "description": "When Rosaria deals a CRIT Hit, her ATK SPD increases by 10% and her Normal Attack DMG increases by 10% for 4s."
      },
      {
        "name": "Land Without Promise",
        "description": "The duration of the Ice Lance created by <span style=\"color: #FFD780FF;\">Rites of Termination</span> is increased by 4s."
      },
      {
        "name": "The Wages of Sin",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Ravaging Confession</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Painful Grace",
        "description": "<span style=\"color: #FFD780FF;\">Ravaging Confession</span>'s CRIT Hits regenerate 5 Energy for Rosaria.\\nCan only be triggered once each time Ravaging Confession is cast."
      },
      {
        "name": "Last Rites",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Rites of Termination</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Divine Retribution",
        "description": "<span style=\"color: #FFD780FF;\">Rites of Termination</span>'s attack decreases opponents' Physical RES by 20% for 10s."
      }
    ],
    "passives": [
      {
        "name": "Regina Probationum",
        "description": "When Rosaria strikes an opponent from behind using <span style=\"color: #FFD780FF;\">Ravaging Confession</span>, Rosaria's CRIT Rate increases by 12% for 5s."
      },
      {
        "name": "Shadow Samaritan",
        "description": "Casting <span style=\"color: #FFD780FF;\">Rites of Termination</span> increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s.\\nCRIT Rate Bonus gained this way cannot exceed 15%."
      },
      {
        "name": "Night Walk",
        "description": "At night (18:00–6:00), increases the Movement SPD of your own party members by 10%.\\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Rites of Termination",
      "description": "Rosaria's unique take on this prayer ritual: First, she swings her weapon to slash surrounding opponents; then, she summons a frigid Ice Lance that strikes the ground. Both actions deal <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\nWhile active, the Ice Lance periodically releases a blast of cold air, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to surrounding opponents.\\n\\n<i>Judgment is such a tedious ordeal — much easier to skip that phase and get straight to the last rites. Rosaria was never very devoted to the Anemo God anyway, which makes performing them all too easy.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Spear of the Church",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to five consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Ravaging Confession",
      "description": "Rosaria swiftly shifts her position to appear behind her opponent, then stabs and slashes them with her polearm, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span>.\\nThis ability cannot be used to travel behind opponents of a larger build.\\n\\n<i>Those who confess to Sister Rosaria will be granted no absolution. All sinners shall be met with the piercing cold of punishment proportionate to the weight of their sins.</i>",
      "priority": 4
    }
  },
  {
    "id": 32,
    "name": "Sangonomiya Kokomi",
    "description": "The Divine Priestess of Watatsumi Island. All of the island's affairs are at this young lady's fingertips.",
    "weapon": "catalyst",
    "rarity": "legendary",
    "vision": "hydro",
    "profileImage": "sangonomiya kokomi",
    "statGrow": "hydroDamageBonus",
    "normalBossDrops": "Dew of Repudiation",
    "normalBossDropsImage": "dewofrepudiation",
    "ascensionMats": "Sango Pearl",
    "ascensionMatsImage": "sangopearl",
    "talentBooks": "Transience",
    "weeklyBossDrops": "Hellfire Butterfly",
    "weeklyBossDropsImage": "hellfirebutterfly",
    "constellations": [
      {
        "name": "At Water's Edge",
        "description": "While donning the Ceremonial Garment created by <span style=\"color: #FFD780FF;\">Nereid's Ascension</span>, the final Normal Attack in Sangonomiya Kokomi's combo will unleash a swimming fish to deal 30% of her Max HP as <span style=\"color: #80C0FFFF;\">Hydro DMG</span>.\\nThis DMG is not considered Normal Attack DMG."
      },
      {
        "name": "The Clouds Like Waves Rippling",
        "description": "Sangonomiya Kokomi gains the following Healing Bonuses with regard to characters with 50% or less HP via the following methods:\\n·<span style=\"color: #FFD780FF;\">Kurage's Oath</span> Bake-Kurage: 4.5% of Kokomi's Max HP.\\n·<span style=\"color: #FFD780FF;\">Nereid's Ascension</span> Normal and Charged Attacks: 0.6% of Kokomi's Max HP."
      },
      {
        "name": "The Moon, A Ship O'er the Seas",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Nereid's Ascension</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "The Moon Overlooks the Waters",
        "description": "While donning the Ceremonial Garment created by <span style=\"color: #FFD780FF;\">Nereid's Ascension</span>, Sangonomiya Kokomi's Normal Attack SPD is increased by 10%, and Normal Attacks that hit opponents will restore 0.8 Energy for her.\\nThis effect can occur once every 0.2s."
      },
      {
        "name": "All Streams Flow to the Sea",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Kurage's Oath</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Sango Isshin",
        "description": "While donning the Ceremonial Garment created by <span style=\"color: #FFD780FF;\">Nereid's Ascension</span>, Sangonomiya Kokomi gains a 40% <span style=\"color: #80C0FFFF;\">Hydro DMG Bonus</span> for 4s after her Normal and Charged Attacks heal a character with 80% or more HP."
      }
    ],
    "passives": [
      {
        "name": "Tamanooya's Casket",
        "description": "If Sangonomiya Kokomi's own Bake-Kurage are on the field when she uses <span style=\"color: #FFD780FF;\">Nereid's Ascension</span>, the Bake-Kurage's duration will be refreshed."
      },
      {
        "name": "Song of Pearls",
        "description": "While donning the Ceremonial Garment created by <span style=\"color: #FFD780FF;\">Nereid's Ascension</span>, the Normal and Charged Attack DMG Bonus Sangonomiya Kokomi gains based on her Max HP will receive a further increase based on 15% of her Healing Bonus."
      },
      {
        "name": "Princess of Watatsumi",
        "description": "Decreases swimming Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      },
      {
        "name": "Flawless Strategy",
        "description": "Sangonomiya Kokomi has a 25% Healing Bonus, but a 100% decrease in CRIT Rate."
      }
    ],
    "burst": {
      "name": "Nereid's Ascension",
      "description": "The might of Watatsumi descends, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span> to surrounding opponents, before robing Kokomi in a Ceremonial Garment made from the flowing waters of Sangonomiya.\\n\\n<span style=\"color: #FFD780FF;\">Ceremonial Garment</span>\\n·Sangonomiya Kokomi's Normal Attack, Charged Attack and Bake-Kurage DMG are increased based on her Max HP.\\n·When her Normal and Charged Attacks hit opponents, Kokomi will restore HP for all nearby party members, and the amount restored is based on her Max HP.\\n·Increases Sangonomiya Kokomi's resistance to interruption and allows her to move on the water's surface.\\n\\nThese effects will be cleared once Sangonomiya Kokomi leaves the field.\\n\\n<i>Clear light coalesces into robes around Her Excellency, Sangonomiya Kokomi, reflecting her magnificent form.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: The Shape of Water",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 3 consecutive attacks that take the form of swimming fish, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to deal <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the might of Hydro, Kokomi plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> upon impact with the ground.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Kurage's Oath",
      "description": "Summons a \"bake-kurage\" created from water that can heal her allies.\\nUsing this skill will apply the <span style=\"color: #80C0FFFF;\">Wet</span> status to Sangonomiya Kokomi.\\n\\n<span style=\"color: #FFD780FF;\">Bake-Kurage</span>\\nDeals <span style=\"color: #80C0FFFF;\">Hydro DMG</span> to surrounding opponents and heal nearby active characters at fixed intervals. This healing is based on Kokomi's Max HP.\\n\\n<i>Kokomi needs timely \"refreshment\" in order to maintain optimal work efficiency</i>.",
      "priority": 5
    }
  },
  {
    "id": 33,
    "name": "Sayu",
    "description": "A pint-sized ninja attached to the Shuumatsuban, who always seems sleep-deprived.",
    "weapon": "claymore",
    "rarity": "rare",
    "vision": "anemo",
    "profileImage": "sayu",
    "statGrow": "em",
    "normalBossDrops": "Marionette Core",
    "normalBossDropsImage": "marionettecore",
    "ascensionMats": "Crystal Marrow",
    "ascensionMatsImage": "crystalmarrow",
    "talentBooks": "Light",
    "weeklyBossDrops": "Ashen Heart",
    "weeklyBossDropsImage": "ashenheart",
    "constellations": [
      {
        "name": "Multi-Task no Jutsu",
        "description": "The Muji-Muji Daruma created by <span style=\"color: #FFD780FF;\">Yoohoo Art: Mujina Flurry</span> will ignore HP limits and can simultaneously attack nearby opponents and heal characters."
      },
      {
        "name": "Egress Prep",
        "description": "<span style=\"color: #FFD780FF;\">Yoohoo Art: Fuuin Dash</span> gains the following effects:\\n·DMG of Fuufuu Whirlwind Kick in Press Mode increased by 3.3%.\\n·Every 0.5s in the Fuufuu Windwheel state will increase the DMG of this Fuufuu Whirlwind Kick by 3.3%. The maximum DMG increase possible through this method is 66%."
      },
      {
        "name": "Eh, the Bunshin Can Handle It",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Yoohoo Art: Mujina Flurry</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Skiving: New and Improved",
        "description": "Sayu recovers 1.2 Energy when she triggers a Swirl reaction.\\nThis effect occurs once every 2s."
      },
      {
        "name": "Speed Comes First",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Yoohoo Art: Fuuin Dash</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Sleep O'Clock",
        "description": "The Muji-Muji Daruma created by Sayu's <span style=\"color: #FFD780FF;\">Yoohoo Art: Mujina Flurry</span> will now also benefit from her Elemental Mastery. Each point of Sayu's Elemental Mastery will produce the following effects:\\n·Increases the damage dealt by the Muji-Muji Daruma's attacks by 0.2% ATK. A maximum of 400% ATK can be gained via this method.\\n·Increases the HP restored by the Muji-Muji Daruma by 3. A maximum of 6,000 additional HP can be restored in this manner."
      }
    ],
    "passives": [
      {
        "name": "Someone More Capable",
        "description": "When Sayu triggers a Swirl reaction while active, she heals all your characters and nearby allies for 300 HP. She will also heal an additional 1.2 HP for every point of Elemental Mastery she has.\\nThis effect can be triggered once every 2s."
      },
      {
        "name": "No Work Today!",
        "description": "The Muji-Muji Daruma created by <span style=\"color: #FFD780FF;\">Yoohoo Art: Mujina Flurry</span> gains the following effects:\\n·When healing a character, it will also heal characters near that healed character for 20% the amount of HP.\\n·Increases the AoE of its attack against opponents."
      },
      {
        "name": "Yoohoo Art: Silencer's Secret",
        "description": "When Sayu is in the party, your characters will not startle Crystalflies and certain other animals when getting near them.\\nCheck the \"Other\" sub-category of the \"Living Beings / Wildlife\" section in the Archive for creatures this skill works on."
      }
    ],
    "burst": {
      "name": "Yoohoo Art: Mujina Flurry",
      "description": "The other super special technique of the Yoohoo Ninja Arts! It summons a pair of helping hands for Sayu.\\nDeals <span style=\"color: #80FFD7FF;\">Anemo DMG</span> to nearby opponents and heals all nearby party members. The amount of HP restored is based on Sayu's ATK. This skill then summons a Muji-Muji Daruma.\\n\\n<span style=\"color: #FFD780FF;\">Muji-Muji Daruma</span>\\nAt specific intervals, the Daruma will take one of several actions based on the situation around it:\\n·If the HP of nearby characters is above 70%, it will attack a nearby opponent, dealing <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n·If there are active characters with 70% or less HP nearby, it will heal the active character with the lowest percentage HP left. If there are no opponents nearby, it will heal active characters nearby even if they have 70% HP or more.\\n\\n<i>People who don't know the first thing about ninjutsu love to watch Sayu show off this skill, and some have tried to learn it from her. But Sayu just wants to sleep and not be disturbed.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Shuumatsuban Ninja Blade",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 4 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\\nAt the end of the sequence, perform a more powerful slash. \\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Yoohoo Art: Fuuin Dash",
      "description": "The special technique of the Yoohoo Ninja Arts!\\nSayu curls up into a rolling Fuufuu Windwheel and smashes into opponents at high speed, dealing <span style=\"color: #80FFD7FF;\">Anemo DMG</span>. When the duration ends, she unleashes a Fuufuu Whirlwind Kick, dealing <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nEnters the Fuufuu Windwheel state, rolling forward a short distance before using the Fuufuu Whirlwind Kick.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nRolls about continuously in the Fuufuu Windwheel state, increasing Sayu's resistance to interruption while within that state.\\nDuring this time, Sayu can control the direction of her roll, and can use the skill again to end her Windwheel state early and unleash a stronger version of the Fuufuu Whirlwind Kick.\\nThe Hold version of this skill can trigger Elemental Absorption.\\n\\nThis skill has a maximum duration of 10s and enters CD once its effects end. The longer Sayu remains in her Windwheel state, the longer the CD.\\n\\n<span style=\"color: #FFD780FF;\">Elemental Absorption</span>\\nIf Sayu comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span> while in her Windwheel state, she will deal additional elemental DMG of that type.\\nElemental Absorption may only occur once per use of this skill.\\n\\n<i>Sayu can pull this skill off with her eyes closed. This technique was originally created for escaping, but now that she's got a Vision, might as well make her foes eat dirt while she's at it.</i>",
      "priority": 4
    }
  },
  {
    "id": 34,
    "name": "Shenhe",
    "description": "An adepti disciple with a most unusual air about her. Having spent much time cultivating in isolation in Liyue's mountains, she has become every bit as cool and distant as the adepti themselves.",
    "weapon": "polearm",
    "rarity": "legendary",
    "vision": "cryo",
    "profileImage": "shenhe",
    "statGrow": "atkPercent",
    "normalBossDrops": "Dragonheir's False Fin",
    "normalBossDropsImage": "dragonheirsfalsefin",
    "ascensionMats": "Qingxin",
    "ascensionMatsImage": "qingxin",
    "talentBooks": "Prosperity",
    "weeklyBossDrops": "Hellfire Butterfly",
    "weeklyBossDropsImage": "hellfirebutterfly",
    "constellations": [
      {
        "name": "Clarity of Heart",
        "description": "<span style=\"color: #FFD780FF;\">Spring Spirit Summoning</span> can be used 1 more time."
      },
      {
        "name": "Centered Spirit",
        "description": "<span style=\"color: #FFD780FF;\">Divine Maiden's Deliverance</span> lasts for 6 seconds longer. Active characters within the skill's field deals 15% increased <span style=\"color: #99FFFFFF;\">Cryo</span> CRIT DMG."
      },
      {
        "name": "Seclusion",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Spring Spirit Summoning</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Insight",
        "description": "When characters under the effect of <span style=\"color: #FFD780FF;\">Icy Quill</span> applied by Shenhe trigger its DMG Bonus effects, Shenhe will gain a Skyfrost Mantra stack:\\n· When Shenhe uses <span style=\"color: #FFD780FF;\">Spring Spirit Summoning</span>, she will consume all stacks of Skyfrost Mantra, increasing the DMG of that Spring Spirit Summoning by 5% for each stack consumed.\\n· Max 50 stacks. Stacks last for 60s."
      },
      {
        "name": "Divine Attainment",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Divine Maiden's Deliverance</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Mystical Abandon",
        "description": "When characters trigger <span style=\"color: #FFD780FF;\">Icy Quill</span>'s effects using Normal and Charged Attack DMG, it does not count toward the Trigger Quota."
      }
    ],
    "passives": [
      {
        "name": "Deific Embrace",
        "description": "An active character within the field created by <span style=\"color: #FFD780FF;\">Divine Maiden's Deliverance</span> gains 15% <span style=\"color: #99FFFFFF;\">Cryo DMG Bonus</span>."
      },
      {
        "name": "Spirit Communion Seal",
        "description": "After Shenhe uses <span style=\"color: #FFD780FF;\">Spring Spirit Summoning</span>, she will grant all nearby party members the following effects:\\n· Press: Elemental Skill and Elemental Burst DMG increased by 15% for 10s.\\n· Hold: Normal, Charged, and Plunging Attack DMG increased by 15% for 15s."
      },
      {
        "name": "Precise Comings and Goings",
        "description": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours."
      }
    ],
    "burst": {
      "name": "Divine Maiden's Deliverance",
      "description": "Unleashes the power of the Talisman Spirit, allowing it to roam free in this plane, dealing <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\nThe Talisman Spirit then creates a field that decreases the <span style=\"color: #99FFFFFF;\">Cryo RES</span> and Physical RES of opponents within it. It also deals periodic <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents within the field.\\n\\n<i>The way of the adepti is not defined only by the mysterious and fantastical. Only by observing the changes in the heavens and the earth, and understanding the laws of cause and effect in this realm, may its essence be understood.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Dawnstar Piercer",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to five consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "books": {},
      "bossItem": "hellfire_butterfly",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Spring Spirit Summoning",
      "description": "The frosted dew, silvery and dense, shall exorcise all demons.\\nGrants all nearby party members the Icy Quill effect and deals <span style=\"color: #99FFFFFF;\">Cryo DMG</span> in different ways based on whether it is pressed or held.\\n\\n<span style=\"color: #FFD780FF;\">pressed</span>\\nRushes forward together with a Talisman Spirit, dealing <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents along the path.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nCommands the Talisman Spirit to deal <span style=\"color: #99FFFFFF;\">AoE Cryo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Icy Quill</span>\\nWhen Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts deal <span style=\"color: #99FFFFFF;\">Cryo DMG</span> to opponents, the DMG dealt is increased based on Shenhe's current ATK.\\n\\nThe Icy Quill's effects will be cleared once its duration ends or after being triggered a certain number of times. When held rather than pressed, the Icy Quill's effect lasts longer and can be triggered more times.\\nWhen one <span style=\"color: #99FFFFFF;\">Cryo DMG</span> instance strikes multiple opponents, the effect is triggered multiple times based on the number of opponents hit. The number of times the effect is triggered is calculated independently for each party member with the Icy Quill.\\n\\n<i>The power of the spirits is no falsehood. Burdened with her orders, the divine maiden hurries on!</i>",
      "books": {},
      "bossItem": "hellfire_butterfly",
      "priority": 5
    }
  },
  {
    "id": 35,
    "name": "Sucrose",
    "description": "An alchemist filled with curiosity about all things. She researches bio-alchemy.",
    "weapon": "catalyst",
    "rarity": "rare",
    "vision": "anemo",
    "profileImage": "sucrose",
    "statGrow": "anemoDamageBonus",
    "normalBossDrops": "Hurricane Seed",
    "normalBossDropsImage": "hurricaneseed",
    "ascensionMats": "Windwheel Aster",
    "ascensionMatsImage": "windwheelaster",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Spirit Locket of Boreas",
    "weeklyBossDropsImage": "spiritlocketofboreas",
    "constellations": [
      {
        "name": "Clustered Vacuum Field",
        "description": "<span style=\"color: #FFD780FF;\">Astable Anemohypostasis Creation - 6308</span> gains 1 additional charge."
      },
      {
        "name": "Beth: Unbound Form",
        "description": "The duration of <span style=\"color: #FFD780FF;\">Forbidden Creation - Isomer 75 / Type II</span> is increased by 2s."
      },
      {
        "name": "Flawless Alchemistress",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Astable Anemohypostasis Creation - 6308</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Alchemania",
        "description": "Every 7 Normal and Charged Attacks, Sucrose will reduce the CD of <span style=\"color: #FFD780FF;\">Astable Anemohypostasis Creation - 6308</span> by 1-7s."
      },
      {
        "name": "Caution: Standard Flask",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Forbidden Creation - Isomer 75 / Type II</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Chaotic Entropy",
        "description": "If <span style=\"color: #FFD780FF;\">Forbidden Creation - Isomer 75 / Type II</span> triggers an Elemental Absorption, all party members gain a 20% Elemental DMG Bonus for the corresponding absorbed element during its duration."
      }
    ],
    "passives": [
      {
        "name": "Catalyst Conversion",
        "description": "When Sucrose triggers a Swirl reaction, all characters in the party with the matching element (excluding Sucrose) have their Elemental Mastery increased by 50 for 8s."
      },
      {
        "name": "Mollis Favonius",
        "description": "When <span style=\"color: #FFD780FF;\">Astable Anemohypostasis Creation - 6308</span> or <span style=\"color: #FFD780FF;\">Forbidden Creation - Isomer 75 / Type II</span> hits an opponent, increases all party members' (excluding Sucrose) Elemental Mastery by an amount equal to 20% of Sucrose's Elemental Mastery for 8s."
      },
      {
        "name": "Astable Invention",
        "description": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product."
      }
    ],
    "burst": {
      "name": "Forbidden Creation - Isomer 75 / Type II",
      "description": "Sucrose hurls an unstable concoction that creates a Large Wind Spirit.\\nWhile it persists, the Large Wind Spirit will continuously pull in surrounding opponents and objects, launch nearby opponents, and deal <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Elemental Absorption</span>\\nIf the Wind Spirit comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span> energy, it will deal additional elemental DMG of that type.\\nElemental Absorption may only occur once per use.\\n\\n<i>Sucrose used to give names to her volatile Anemo Hypostases, but their line of heirs quickly grew to surpass Baron Bunny the 893rd.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Wind Spirit Creation",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 4 attacks using Wind Spirits, dealing <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina and deals <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span> after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nCalling upon the power of her Wind Spirits, Sucrose plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span> upon impact with the ground.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Astable Anemohypostasis Creation - 6308",
      "description": "Creates a small Wind Spirit that pulls opponents and objects towards its location, launches opponents within its AoE, and deals <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<i>This is a little embarrassing, but though the elemental lifeforms birthed through this procedure dissipate very rapidly, they are incredibly useful when adventuring. Even failed experiments can have practical applications.</i>",
      "priority": 4
    }
  },
  {
    "id": 36,
    "name": "Tartaglia",
    "description": "No. 11 of The Harbingers, also known as \"Childe.\" His name is highly feared on the battlefield.",
    "weapon": "bow",
    "rarity": "legendary",
    "vision": "hydro",
    "profileImage": "tartaglia",
    "statGrow": "hydroDamageBonus",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "cleansingheart",
    "ascensionMats": "Starconch",
    "ascensionMatsImage": "starconch",
    "talentBooks": "Freedom",
    "weeklyBossDrops": "Shard of a Foul Legacy",
    "weeklyBossDropsImage": "shardofafoullegacy",
    "constellations": [
      {
        "name": "Foul Legacy: Tide Withholder",
        "description": "Decreases the CD of <span style=\"color: #FFD780FF;\">Foul Legacy: Raging Tide</span> by 20%"
      },
      {
        "name": "Foul Legacy: Understream",
        "description": "When opponents affected by Riptide are defeated, Tartaglia regenerates 4 Elemental Energy."
      },
      {
        "name": "Abyssal Mayhem: Vortex of Turmoil",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Foul Legacy: Raging Tide</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Abyssal Mayhem: Hydrospout",
        "description": "If Tartaglia is in <span style=\"color: #FFD780FF;\">Foul Legacy: Raging Tide</span>'s Melee Stance, triggers Riptide Slash against opponents on the field affected by Riptide every 4s, otherwise, triggers Riptide Flash.\\nRiptide Slashes and Riptide Flashes triggered by this Constellation effect are not subject to the time intervals that would typically apply to these two Riptide effects, nor do they have any effect on those time intervals."
      },
      {
        "name": "Havoc: Formless Blade",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Havoc: Obliteration</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Havoc: Annihilation",
        "description": "When <span style=\"color: #FFD780FF;\">Havoc: Obliteration</span> is cast in Melee Stance, the CD of <span style=\"color: #FFD780FF;\">Foul Legacy: Raging Tide</span> is reset.\\nThis effect will only take place once Tartaglia returns to his Ranged Stance."
      }
    ],
    "passives": [
      {
        "name": "Never Ending",
        "description": "Extends Riptide duration by 8s."
      },
      {
        "name": "Sword of Torrents",
        "description": "When Tartaglia is in <span style=\"color: #FFD780FF;\">Foul Legacy: Raging Tide</span>'s Melee Stance, on dealing a CRIT hit, Normal and Charged Attacks apply the Riptide status effect to opponents."
      },
      {
        "name": "Master of Weaponry",
        "description": "Increases your own party members' <span style=\"color: #FFD780FF;\">Normal Attack</span> Level by 1."
      }
    ],
    "burst": {
      "name": "Havoc: Obliteration",
      "description": "Performs different attacks based on what stance Tartaglia is in when casting.\\n\\n<span style=\"color: #FFD780FF;\">Ranged Stance: Flash of Havoc</span>\\nSwiftly fires a Hydro-imbued magic arrow, dealing <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> and applying the Riptide status.\\nReturns a portion of its Energy Cost after use.\\n\\n<span style=\"color: #FFD780FF;\">Melee Stance: Light of Obliteration</span>\\nPerforms a slash with a large AoE, dealing massive <span style=\"color: #80C0FFFF;\">Hydro DMG</span> to all surrounding opponents, which triggers Riptide Blast.\\n\\n<span style=\"color: #FFD780FF;\">Riptide Blast</span>\\nWhen the obliterating waters hit an opponent affected by Riptide, it clears their Riptide status and triggers a Hydro Explosion that deals <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span>.\\nDMG dealt in this way is considered Elemental Burst DMG.\\n\\n<i>Rushing waters are rarely seen in his snowy homeland. Perhaps his ability to command water is due to his understanding of just how precious it is.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Cutting Torrent",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 6 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, the power of Hydro will accumulate on the arrowhead. A arrow fully charged with the torrent will deal <span style=\"color: #80C0FFFF;\">Hydro DMG</span> and apply the Riptide status.\\n\\n<span style=\"color: #FFD780FF;\">Riptide</span>\\nOpponents affected by Riptide will suffer from <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span> effects when attacked by Tartaglia in various ways. DMG dealt in this way is considered Normal Attack DMG.\\n·Riptide Flash: A fully-charged Aimed Shot that hits an opponent affected by Riptide deals consecutive bouts of AoE DMG. Can occur once every 0.7s.\\n·Riptide Burst: Defeating an opponent affected by Riptide creates a Hydro burst that inflicts the Riptide status on nearby opponents hit.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.\\nWhen Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, he cannot perform a plunging attack.",
      "priority": 4
    },
    "elementalSkill": {
      "name": "Foul Legacy: Raging Tide",
      "description": "Unleashes a set of weaponry made of pure water, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span> to surrounding opponents and entering Melee Stance.\\nIn this Stance, Tartaglia's Normal and Charged Attacks are converted to <span style=\"color: #80C0FFFF;\">Hydro DMG</span> that cannot be overridden by any other elemental infusion and change as follows:\\n\\n<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 6 consecutive <span style=\"color: #80C0FFFF;\">Hydro</span> strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash a cross slash, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Riptide Slash</span>\\nHitting an opponent affected by Riptide with a melee attack unleashes a Riptide Slash that deals <span style=\"color: #80C0FFFF;\">AoE Hydro DMG</span>. DMG dealt in this way is considered Elemental Skill DMG, and can only occur once every 1.5s.\\n\\nAfter 30s, or when the ability is unleashed again, this skill will end. Tartaglia will return to his Ranged Stance and this ability will enter CD. The longer Tartaglia stays in his Melee Stance, the longer the CD.\\nIf the return to a ranged stance occurs automatically after 30s, the CD is even longer.\\n\\n<i>He chose the bow as his weapon precisely to overcome his weakness with it. But a serious fight demands that he gets serious...</i>",
      "priority": 5
    }
  },
  {
    "id": 37,
    "name": "Thoma",
    "description": "The Kamisato Clan's housekeeper. A well-known \"fixer\" in Inazuma.",
    "weapon": "polearm",
    "rarity": "rare",
    "vision": "pyro",
    "profileImage": "thoma",
    "statGrow": "atkPercent",
    "normalBossDrops": "Smoldering Pearl",
    "normalBossDropsImage": "smolderingpearl",
    "ascensionMats": "Fluorescent Fungus",
    "ascensionMatsImage": "fluorescentfungus",
    "talentBooks": "Transience",
    "weeklyBossDrops": "Hellfire Butterfly",
    "weeklyBossDropsImage": "hellfirebutterfly",
    "constellations": [
      {
        "name": "A Comrade's Duty",
        "description": "When a character protected by Thoma's own <span style=\"color: #FFD780FF;\">Blazing Barrier</span> (Thoma excluded) is attacked, Thoma's own <span style=\"color: #FFD780FF;\">Blazing Blessing</span> CD is decreased by 3s, while his own <span style=\"color: #FFD780FF;\">Crimson Ooyoroi</span>'s CD is decreased by 3s.\\nThis effect can be triggered once every 20s."
      },
      {
        "name": "A Subordinate's Skills",
        "description": "<span style=\"color: #FFD780FF;\">Crimson Ooyoroi</span>'s duration is increased by 3s."
      },
      {
        "name": "Fortified Resolve",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Blazing Blessing</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Long-Term Planning",
        "description": "After using <span style=\"color: #FFD780FF;\">Crimson Ooyoroi</span>, 15 Energy will be restored to Thoma."
      },
      {
        "name": "Raging Wildfire",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Crimson Ooyoroi</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Burning Heart",
        "description": "When a <span style=\"color: #FFD780FF;\">Blazing Barrier</span> is obtained or refreshed, the DMG dealt by all party members' Normal, Charged, and Plunging Attacks is increased by 15% for 6s."
      }
    ],
    "passives": [
      {
        "name": "Imbricated Armor",
        "description": "When your current active character obtains or refreshes a <span style=\"color: #FFD780FF;\">Blazing Barrier</span>, this character's Shield Strength will increase by 5% for 6s.\\nThis effect can be triggered once every 0.3s seconds. Max 5 stacks."
      },
      {
        "name": "Flaming Assault",
        "description": "DMG dealt by <span style=\"color: #FFD780FF;\">Crimson Ooyoroi</span>'s Fiery Collapse is increased by 2.2% of Thoma's Max HP."
      },
      {
        "name": "Snap and Swing",
        "description": "When you <span style=\"color: #FFD780FF;\">fish</span> successfully in Inazuma, Thoma's help grants a 20% chance of scoring a double catch."
      }
    ],
    "burst": {
      "name": "Crimson Ooyoroi",
      "description": "Thoma spins his polearm, slicing at his foes with roaring flames that deal <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> and weave themselves into a Scorching Ooyoroi.\\n\\n<span style=\"color: #FFD780FF;\">Scorching Ooyoroi</span>\\nWhile Scorching Ooyoroi is in effect, the active character's Normal Attacks will trigger Fiery Collapse, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> and summoning a Blazing Barrier.\\nFiery Collapse can be triggered once every 1s.\\n\\nExcept for the amount of DMG they can absorb, the Blazing Barriers created in this way are identical to those created by Thoma's Elemental Skill, Blazing Blessing:\\n·Absorbs <span style=\"color: #FF9999FF;\">Pyro DMG</span> 250% more effectively.\\n·When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.\\n\\nThe maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.\\n\\nIf Thoma falls, the effects of Scorching Ooyoroi will be cleared.\\n\\n<i>\"I will not forget my initial promise. Let this burning flame protect those I cherish, and may it never be extinguished.\"</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Swiftshatter Spear",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to four consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Blazing Blessing",
      "description": "Thoma vaults forward with his polearm and delivers a flame-filled flying kick that deals <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>, while also summoning a defensive Blazing Barrier. At the moment of casting, Thoma's Elemental Skill applies <span style=\"color: #FF9999FF;\">Pyro</span> to himself.\\nThe DMG Absorption of the Blazing Barrier scales off Thoma's Max HP.\\nThe Blazing Barrier has the following traits:\\n·Absorbs <span style=\"color: #FF9999FF;\">Pyro DMG</span> 250% more effectively.\\n·When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.\\n\\nThe maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.\\n\\n<i>As a guest from afar, only the most burning passion would allow one to master the pure and precise spear arts of Inazuma. Thoma's mastery, indeed, is not limited to being the \"swiftest-studying student\" or \"a master of the spear,\" but he has imbued his will to protect others and fend off foes into his art as well.</i>",
      "priority": 4
    }
  },
  {
    "id": 38,
    "name": "Traveler Anemo",
    "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "anemo",
    "profileImage": "traveler",
    "statGrow": "atkPercent",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Windwheel Aster",
    "ascensionMatsImage": "windwheelaster",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Dvalin's Sigh",
    "weeklyBossDropsImage": "dvalinssigh",
    "constellations": [
      {
        "name": "Raging Vortex",
        "description": "<span style=\"color: #FFD780FF;\">Palm Vortex</span> pulls in opponents and objects within a 5m radius."
      },
      {
        "name": "Uprising Whirlwind",
        "description": "Increases Energy Recharge by 16%."
      },
      {
        "name": "Sweeping Gust",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Gust Surge</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Cherishing Breezes",
        "description": "Reduces DMG taken while casting <span style=\"color: #FFD780FF;\">Palm Vortex</span> by 10%."
      },
      {
        "name": "Vortex Stellaris",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Palm Vortex</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Intertwined Winds",
        "description": "Targets who take DMG from <span style=\"color: #FFD780FF;\">Gust Surge</span> have their <span style=\"color: #80FFD7FF;\">Anemo RES</span> decreased by 20%.\\nIf an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."
      }
    ],
    "passives": [
      {
        "name": "Slitting Wind",
        "description": "The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as <span style=\"color: #80FFD7FF;\">Anemo DMG</span> to all opponents in its path."
      },
      {
        "name": "Second Wind",
        "description": "<span style=\"color: #FFD780FF;\">Palm Vortex</span> kills regenerate 2% HP for 5s. This effect can only occur once every 5s."
      }
    ],
    "burst": {
      "name": "Gust Surge",
      "description": "Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, dealing continuous <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Elemental Absorption</span>\\nIf the tornado comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span>, it will deal additional elemental DMG of that type.\\nElemental Absorption may only occur once per use.\\n\\n<i>You and Paimon studied the flapping of a butterfly's wings.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Foreign Ironwind",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Palm Vortex",
      "description": "Grasping the wind's might, you form a vortex of vacuum in your palm, causing continuous <span style=\"color: #80FFD7FF;\">Anemo DMG</span> to opponents in front of you.\\nThe vacuum vortex explodes when the skill duration ends, causing a greater amount of Anemo DMG over a larger area.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nDMG and AoE will gradually increase.\\n\\n<span style=\"color: #FFD780FF;\">Elemental Absorption</span>\\nIf the vortex comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span>, it will deal additional elemental DMG of that type.\\nElemental Absorption may only occur once per use.\\n\\n<i>You discussed the way to grasp the formless wind with Paimon.</i>",
      "priority": 4
    }
  },
  {
    "id": 39,
    "name": "Traveler Electro",
    "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "electro",
    "profileImage": "traveler",
    "statGrow": "atkPercent",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Windwheel Aster",
    "ascensionMatsImage": "windwheelaster",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Dragon Lord's Crown",
    "weeklyBossDropsImage": "dragonlordscrown",
    "constellations": [
      {
        "name": "Spring Thunder of Fertility",
        "description": "The number of Abundance Amulets that can be generated using <span style=\"color: #FFD780FF;\">Lightning Blade</span> is increased to 3."
      },
      {
        "name": "Violet Vehemence",
        "description": "When Falling Thunder created by <span style=\"color: #FFD780FF;\">Bellowing Thunder</span> hits an opponent, it will decrease their <span style=\"color: #FFACFFFF;\">Electro RES</span> by 15% for 8s."
      },
      {
        "name": "Distant Crackling",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Bellowing Thunder</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Fickle Cloudstrike",
        "description": "When a character obtains Abundance Amulets generated by <span style=\"color: #FFD780FF;\">Lightning Blade</span>, if this character's Energy is less than 35%, the Energy restored by the Abundance Amulets is increased by 100%."
      },
      {
        "name": "Clamor in the Wilds",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Lightning Blade</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "World-Shaker",
        "description": "Every 2 Falling Thunder attacks triggered by <span style=\"color: #FFD780FF;\">Bellowing Thunder</span> will increase the DMG dealt by the next Falling Thunder by 100%, and will restore an additional 1 Energy to the current character."
      }
    ],
    "passives": [
      {
        "name": "Thunderflash",
        "description": "When another nearby character in the party obtains an Abundance Amulet created by <span style=\"color: #FFD780FF;\">Lightning Blade</span>, <span style=\"color: #FFD780FF;\">Lightning Blade's</span> CD is decreased by 1.5s."
      },
      {
        "name": "Resounding Roar",
        "description": "Increases the Energy Recharge effect granted by <span style=\"color: #FFD780FF;\">Lightning Blade</span>'s Abundance Amulet by 10% of the Traveler's Energy Recharge."
      }
    ],
    "burst": {
      "name": "Bellowing Thunder",
      "description": "You call upon the protection of lightning, knocking nearby opponents back and dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span> to them.\\n\\n<span style=\"color: #FFD780FF;\">Lightning Shroud</span>\\nWhen your active character's Normal or Charged Attacks hit opponents, they will call Falling Thunder forth, dealing <span style=\"color: #FFACFFFF;\">Electro DMG.</span>\\nWhen Falling Thunder hits opponents, it will regenerate Energy for that character.\\nOne instance of Falling Thunder can be generated every 0.5s.\\n\\n<i>You and Paimon studied the light that flashes through the clouds.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Foreign Thundershock",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Lightning Blade",
      "description": "Unleashes three swift thunder shadows that deal <span style=\"color: #FFACFFFF;\">Electro DMG</span> to opponents and leave an Abundance Amulet behind after hitting an opponent.\\n2 Abundance Amulets can be created initially. Using this skill will reset any Abundance Amulets that were generated.\\n\\n<span style=\"color: #FFD780FF;\">Abundance Amulets</span>\\nWhen a character is near an Abundance Amulet, they will absorb it and obtain the following effects:\\n·Restores Elemental Energy\\n·Increases Energy Recharge during the Abundance Amulet's duration.\\n\\n<i>You and Paimon discuss the paths by which electricity might flow.</i>",
      "priority": 4
    }
  },
  {
    "id": 40,
    "name": "Traveler Geo",
    "description": "A traveler from another world who had their only kin taken away, forcing them to embark on a journey to find The Seven.",
    "weapon": "sword",
    "rarity": "legendary",
    "vision": "geo",
    "profileImage": "traveler",
    "statGrow": "atkPercent",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Windwheel Aster",
    "ascensionMatsImage": "windwheelaster",
    "talentBooks": "Elegance",
    "weeklyBossDrops": "Ashen Heart",
    "weeklyBossDropsImage": "ashenheart",
    "constellations": [
      {
        "name": "Invincible Stonewall",
        "description": "Party members within the radius of <span style=\"color: #FFD780FF;\">Wake of Earth</span> have their CRIT Rate increased by 10% and have increased resistance against interruption."
      },
      {
        "name": "Rockcore Meltdown",
        "description": "When the meteorite created by <span style=\"color: #FFD780FF;\">Starfell Sword</span> is destroyed, it will also explode, dealing additional <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> equal to the amount of damage dealt by Starfell Sword."
      },
      {
        "name": "Will of the Rock",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Wake of Earth</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Reaction Force",
        "description": "The shockwave triggered by <span style=\"color: #FFD780FF;\">Wake of Earth</span> regenerates 5 Energy for every opponent hit.\\nA maximum of 25 Energy can be regenerated in this manner at any one time."
      },
      {
        "name": "Meteorite Impact",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Starfell Sword</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Everlasting Boulder",
        "description": "The barrier created by <span style=\"color: #FFD780FF;\">Wake of Earth</span> lasts 5s longer.\\nThe meteorite created by <span style=\"color: #FFD780FF;\">Starfell Sword</span> lasts 10s longer."
      }
    ],
    "passives": [
      {
        "name": "Shattered Darkrock",
        "description": "Reduces <span style=\"color: #FFD780FF;\">Starfell Sword</span>'s CD by 2s."
      },
      {
        "name": "Frenzied Rockslide",
        "description": "The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as <span style=\"color: #FFE708FF;\">AoE Geo DMG</span>."
      }
    ],
    "burst": {
      "name": "Wake of Earth",
      "description": "Energizing the Geo deep underground, you set off expanding shockwaves.\\nLaunches surrounding opponents back and deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\nA stone wall is erected at the edges of the shockwave.\\nThe stone wall is considered a <span style=\"color: #FFE699FF;\">Geo Construct</span>, and may be used to block attacks.\\n\\n<i>You and Paimon studied the pulse of the mountains.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Foreign Rockblade",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Starfell Sword",
      "description": "You disgorge a meteorite from the depths of the earth, dealing <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\nThe meteorite is considered a <span style=\"color: #FFE699FF;\">Geo Construct</span>, and can be climbed or used to block attacks.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nThis skill's positioning may be adjusted.\\n\\n<i>You spoke with Paimon about the final destination of falling stars.</i>",
      "priority": 4
    }
  },
  {
    "id": 41,
    "name": "Venti",
    "description": "One of the many bards of Mondstadt, who freely wanders the city's streets and alleys.",
    "weapon": "bow",
    "rarity": "legendary",
    "vision": "anemo",
    "profileImage": "venti",
    "statGrow": "er",
    "normalBossDrops": "Hurricane Seed",
    "normalBossDropsImage": "hurricaneseed",
    "ascensionMats": "Cecilia",
    "ascensionMatsImage": "cecilia",
    "talentBooks": "Ballad",
    "weeklyBossDrops": "Tail of Boreas",
    "weeklyBossDropsImage": "tailofboreas",
    "constellations": [
      {
        "name": "Splitting Gales",
        "description": "Fires 2 additional arrows per <span style=\"color: #FFD780FF;\">Aimed Shot</span>, each dealing 33% of the original arrow's DMG."
      },
      {
        "name": "Breeze of Reminiscence",
        "description": "<span style=\"color: #FFD780FF;\">Skyward Sonnet</span> decreases opponents' <span style=\"color: #80FFD7FF;\">Anemo RES</span> and Physical RES by 12% for 10s.\\nOpponents launched by <span style=\"color: #FFD780FF;\">Skyward Sonnet</span> suffer an additional 12% <span style=\"color: #80FFD7FF;\">Anemo RES</span> and Physical RES decrease while airborne."
      },
      {
        "name": "Ode to Thousand Winds",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Wind's Grand Ode</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Hurricane of Freedom",
        "description": "When Venti picks up an Elemental Orb or Particle, he receives a 25% <span style=\"color: #80FFD7FF;\">Anemo DMG Bonus</span> for 10s."
      },
      {
        "name": "Concerto dal Cielo",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Skyward Sonnet</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Storm of Defiance",
        "description": "Targets who take DMG from <span style=\"color: #FFD780FF;\">Wind's Grand Ode</span> have their <span style=\"color: #80FFD7FF;\">Anemo RES</span> decreased by 20%.\\nIf an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."
      }
    ],
    "passives": [
      {
        "name": "Embrace of Winds",
        "description": "Holding <span style=\"color: #FFD780FF;\">Skyward Sonnet</span> creates an upcurrent that lasts for 20s."
      },
      {
        "name": "Stormeye",
        "description": "Regenerates 15 Energy for Venti after the effects of <span style=\"color: #FFD780FF;\">Wind's Grand Ode</span> end.\\nIf an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element in the party."
      },
      {
        "name": "Windrider",
        "description": "Decreases gliding Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Wind's Grand Ode",
      "description": "Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in opponents and deals continuous <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Elemental Absorption</span>\\nIf the Stormeye comes into contact with <span style=\"color: #80C0FFFF;\">Hydro</span>/<span style=\"color: #FF9999FF;\">Pyro</span>/<span style=\"color: #99FFFFFF;\">Cryo</span>/<span style=\"color: #FFACFFFF;\">Electro</span>, it will deal additional elemental DMG of that type.\\nElemental Absorption may only occur once per use.\\n\\n<i>Many hymns written in praise of the Anemo Archon have been lost to time. This one sings of his mastery over the wind.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Divine Marksmanship",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 6 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerform a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, favorable winds will accumulate on the arrowhead. A fully charged wind arrow will deal <span style=\"color: #80FFD7FF;\">Anemo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 1
    },
    "elementalSkill": {
      "name": "Skyward Sonnet",
      "description": "O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nSummons a Wind Domain at the opponent's location, dealing <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span> and launching opponents into the air.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nSummons an even larger Wind Domain with Venti as the epicenter, dealing <span style=\"color: #80FFD7FF;\">AoE Anemo DMG</span> and launching affected opponents into the air.\\nAfter unleashing the Hold version of this ability, Venti rides the wind into the air.\\n\\nOpponents hit by Skyward Sonnet will fall to the ground slowly.\\n\\n<i>In the days when gods and men walked the earth together, the heavens were filled with countless songs. This melody has long since been forgotten.</i>",
      "priority": 2
    }
  },
  {
    "id": 42,
    "name": "Xiangling",
    "description": "A renowned chef from Liyue. She's extremely passionate about cooking and excels at making her signature hot and spicy dishes.",
    "weapon": "polearm",
    "rarity": "rare",
    "vision": "pyro",
    "profileImage": "xiangling",
    "statGrow": "em",
    "normalBossDrops": "Everflame Seed",
    "normalBossDropsImage": "everflameseed",
    "ascensionMats": "Jueyun Chili",
    "ascensionMatsImage": "jueyunchili",
    "talentBooks": "Diligence",
    "weeklyBossDrops": "Dvalin's Claw",
    "weeklyBossDropsImage": "dvalinsclaw",
    "constellations": [
      {
        "name": "Crispy Outside, Tender Inside",
        "description": "Opponents hit by Guoba's attacks have their <span style=\"color: #FF9999FF;\">Pyro RES</span> reduced by 15% for 6s."
      },
      {
        "name": "Oil Meets Fire",
        "description": "The last attack in a Normal Attack sequence applies the Implode status onto the opponent for 2s. An explosion will occur once this duration ends, dealing 75% of Xiangling's ATK as <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>."
      },
      {
        "name": "Deepfry",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Pyronado</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Slowbake",
        "description": "<span style=\"color: #FFD780FF;\">Pyronado</span>'s duration is increased by 40%."
      },
      {
        "name": "Guoba Mad",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Guoba Attack</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Condensed Pyronado",
        "description": "For the duration of <span style=\"color: #FFD780FF;\">Pyronado</span>, all party members receive a 15% <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span>."
      }
    ],
    "passives": [
      {
        "name": "Crossfire",
        "description": "Increases the flame range of Guoba by 20%."
      },
      {
        "name": "Beware, It's Super Hot!",
        "description": "When <span style=\"color: #FFD780FF;\">Guoba Attack</span>'s effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s."
      },
      {
        "name": "Chef de Cuisine",
        "description": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% chance to receive double the product."
      }
    ],
    "burst": {
      "name": "Pyronado",
      "description": "Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her.\\nThe Pyronado will move with your character for the ability's duration, dealing <span style=\"color: #FF9999FF;\">Pyro DMG</span> to all opponents in its path.\\n\\n<i>There will never be enough heat. Never.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Dough-Fu",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to five consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Guoba Attack",
      "description": "Summons Guoba the Panda. Guoba continuously breathes fire at opponents, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\n\\n<i>Guoba loves to eat spicy food. Problem is, his stomach can't handle something this spicy.</i>",
      "priority": 4
    }
  },
  {
    "id": 43,
    "name": "Xiao",
    "description": "A yaksha adeptus who defends Liyue. Also heralded as the \"Conqueror of Demons\" and \"Vigilant Yaksha.\"",
    "weapon": "polearm",
    "rarity": "legendary",
    "vision": "anemo",
    "profileImage": "xiao",
    "statGrow": "critRate",
    "normalBossDrops": "Juvenile Jade",
    "normalBossDropsImage": "juvenilejade",
    "ascensionMats": "Qingxin",
    "ascensionMatsImage": "qingxin",
    "talentBooks": "Prosperity",
    "weeklyBossDrops": "Shadow of the Warrior",
    "weeklyBossDropsImage": "shadowofthewarrior",
    "constellations": [
      {
        "name": "Dissolution Eon: Destroyer of Worlds",
        "description": "Increases <span style=\"color: #FFD780FF;\">Lemniscatic Wind Cycling</span>'s charges by 1."
      },
      {
        "name": "Annihilation Eon: Blossom of Kaleidos",
        "description": "When in the party and not on the field, Xiao's Energy Recharge is increased by 25%."
      },
      {
        "name": "Conqueror of Evil: Wrath Deity",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Lemniscatic Wind Cycling</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Transcension: Extinction of Suffering",
        "description": "When Xiao's HP falls below 50%, he gains a 100% DEF Bonus."
      },
      {
        "name": "Evolution Eon: Origin of Ignorance",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Bane of All Evil</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Conqueror of Evil: Guardian Yaksha",
        "description": "While under the effects of <span style=\"color: #FFD780FF;\">Bane of All Evil</span>, hitting at least 2 opponents with Xiao's Plunging Attack will immediately grant him 1 charge of <span style=\"color: #FFD780FF;\">Lemniscatic Wind Cycling</span>, and for the next 1s, he may use Lemniscatic Wind Cycling while ignoring its CD."
      }
    ],
    "passives": [
      {
        "name": "Conqueror of Evil: Tamer of Demons",
        "description": "While under the effects of <span style=\"color: #FFD780FF;\">Bane of All Evil</span>, all DMG dealt by Xiao increases by 5%. DMG increases by a further 5% for every 3s the ability persists.\\nThe maximum DMG Bonus is 25%."
      },
      {
        "name": "Dissolution Eon: Heaven Fall",
        "description": "Using <span style=\"color: #FFD780FF;\">Lemniscatic Wind Cycling</span> increases the DMG of subsequent uses of Lemniscatic Wind Cycling by 15%.\\nThis effect lasts for 7s, and has a maximum of 3 stacks. Gaining a new stack refreshes the effect's duration."
      },
      {
        "name": "Transcension: Gravity Defier",
        "description": "Decreases climbing Stamina consumption for your own party members by 20%.\\nNot stackable with Passive Talents that provide the exact same effects."
      }
    ],
    "burst": {
      "name": "Bane of All Evil",
      "description": "Xiao dons the Yaksha Mask that set gods and demons trembling millennia ago.\\n\\n<span style=\"color: #FFD780FF;\">Yaksha's Mask</span>\\n·Greatly increases Xiao's jumping ability.\\n·Increases his attack AoE and attack DMG.\\n·Converts attack DMG into <span style=\"color: #80FFD7FF;\">Anemo DMG</span>, which cannot be overridden by any other elemental infusion.\\n\\nIn this state, Xiao will continuously lose HP.\\nThe effects of this skill end when Xiao leaves the field.\\n\\n<i>Donning the Mask of the Yaksha, Xiao takes the terrifying, demon-conquering form of the Vigilant Yaksha. But this great power has also brought him great suffering. Some call him \"The Bane of All Evil.\"</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Whirlwind Thrust",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 6 consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to perform an upward thrust.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\\nXiao does not take DMG from performing Plunging Attacks.",
      "priority": 5
    },
    "elementalSkill": {
      "name": "Lemniscatic Wind Cycling",
      "description": "Xiao lunges forward, dealing <span style=\"color: #80FFD7FF;\">Anemo DMG</span> to opponents in his path.\\nCan be used in mid-air.\\nStarts with 2 charges.\\n\\n<i>According to the legends of another land, the world will someday be crushed by two great wind wheels. Xiao's mastery over polearms is transcendent, ripping his foes apart like those legendary wind wheels.</i>",
      "priority": 4
    }
  },
  {
    "id": 44,
    "name": "Xingqiu",
    "description": "A young man carrying a longsword who is frequently seen at book booths. He has a chivalrous heart and yearns for justice and fairness for all.",
    "weapon": "sword",
    "rarity": "rare",
    "vision": "hydro",
    "profileImage": "xingqiu",
    "statGrow": "atkPercent",
    "normalBossDrops": "Cleansing Heart",
    "normalBossDropsImage": "cleansingheart",
    "ascensionMats": "Silk Flower",
    "ascensionMatsImage": "silkflower",
    "talentBooks": "Gold",
    "weeklyBossDrops": "Tail of Boreas",
    "weeklyBossDropsImage": "tailofboreas",
    "constellations": [
      {
        "name": "The Scent Remained",
        "description": "Increases the maximum number of Rain Swords by 1."
      },
      {
        "name": "Rainbow Upon the Azure Sky",
        "description": "Extends the duration of <span style=\"color: #FFD780FF;\">Guhua Sword: Raincutter</span> by 3s.\\nDecreases the <span style=\"color: #80C0FFFF;\">Hydro RES</span> of opponents hit by sword rain attacks by 15% for 4s."
      },
      {
        "name": "Weaver of Verses",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Guhua Sword: Raincutter</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Evilsoother",
        "description": "Throughout the duration of <span style=\"color: #FFD780FF;\">Guhua Sword: Raincutter</span>, the DMG dealt by <span style=\"color: #FFD780FF;\">Guhua Sword: Fatal Rainscreen</span> is increased by 50%."
      },
      {
        "name": "Embrace of Rain",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Guhua Sword: Fatal Rainscreen</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Hence, Call Them My Own Verses",
        "description": "Activating 2 of <span style=\"color: #FFD780FF;\">Guhua Sword: Raincutter</span>'s sword rain attacks greatly increases the DMG of the third. Xingqiu regenerates 3 Energy when sword rain attacks hit opponents."
      }
    ],
    "passives": [
      {
        "name": "Hydropathic",
        "description": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character's HP based on 6% of Xingqiu's Max HP."
      },
      {
        "name": "Blades Amidst Raindrops",
        "description": "Xingqiu gains a 20% <span style=\"color: #80C0FFFF;\">Hydro DMG Bonus</span>."
      },
      {
        "name": "Flash of Genius",
        "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used."
      }
    ],
    "burst": {
      "name": "Guhua Sword: Raincutter",
      "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords.\\n\\n<span style=\"color: #FFD780FF;\">Rainbow Bladework</span>\\n·Your active character's Normal Attacks will trigger consecutive sword rain attacks, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span>.\\n·Rain Swords will remain at the maximum number throughout the ability's duration.\\n\\n<i>The \"Way of the Rain Cutter\" is one of the esoteric secret techniques of the Guhua Sect.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Guhua Style",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 5 rapid strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Guhua Sword: Fatal Rainscreen",
      "description": "Xingqiu performs twin strikes with his sword, dealing <span style=\"color: #80C0FFFF;\">Hydro DMG</span>. At the same time, this ability creates the maximum number of Rain Swords, which will orbit your active character.\\nThe Rain Swords have the following properties:\\n·When a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.\\n·Increases the character's resistance to interruption.\\n20% of Xingqiu's <span style=\"color: #80C0FFFF;\">Hydro DMG Bonus</span> will be converted to additional DMG Reduction for the Rain Swords.\\n\\nThe maximum amount of additional DMG Reduction that can be gained this way is 24%.\\nThe initial maximum number of Rain Swords is 3.\\nUsing this ability applies the <span style=\"color: #80C0FFFF;\">Wet</span> status onto the character.\\n\\n<i>\"Easier to slay a rain dragon than to sever the rain.\"</i>",
      "priority": 4
    }
  },
  {
    "id": 45,
    "name": "Xinyan",
    "description": "Liyue's sole rock 'n' roll musician. She rebels against ossified prejudices using her music and passionate singing.",
    "weapon": "claymore",
    "rarity": "rare",
    "vision": "pyro",
    "profileImage": "xinyan",
    "statGrow": "atkPercent",
    "normalBossDrops": "Everflame Seed",
    "normalBossDropsImage": "everflameseed",
    "ascensionMats": "Violetgrass",
    "ascensionMatsImage": "violetgrass",
    "talentBooks": "Gold",
    "weeklyBossDrops": "Tusk of Monoceros Caeli",
    "weeklyBossDropsImage": "tuskofmonoceroscaeli",
    "constellations": [
      {
        "name": "Fatal Acceleration",
        "description": "Upon scoring a CRIT Hit, increases ATK SPD of Xinyan's Normal and Charged Attacks by 12% for 5s.\\nCan only occur once every 5s."
      },
      {
        "name": "Impromptu Opening",
        "description": "<span style=\"color: #FFD780FF;\">Riff Revolution</span>'s Physical DMG has its CRIT Rate increased by 100%, and will form a shield at Shield Level 3: Rave when cast."
      },
      {
        "name": "Double-Stop",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Sweeping Fervor</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Wildfire Rhythm",
        "description": "<span style=\"color: #FFD780FF;\">Sweeping Fervor</span>'s swing DMG decreases opponent's Physical RES by 15% for 12s."
      },
      {
        "name": "Screamin' for an Encore",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Riff Revolution</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Rockin' in a Flaming World",
        "description": "Decreases the Stamina Consumption of Xinyan's Charged Attacks by 30%. Additionally, Xinyan's Charged Attacks gain an ATK Bonus equal to 50% of her DEF."
      }
    ],
    "passives": [
      {
        "name": "\"The Show Goes On, Even Without An Audience...\"",
        "description": "Decreases the number of opponents <span style=\"color: #FFD780FF;\">Sweeping Fervor</span> must hit to trigger each level of shielding.\\n·Shield Level 2: Lead-In requirement reduced to 1 opponent hit.\\n·Shield Level 3: Rave requirement reduced to 2 opponents hit or more."
      },
      {
        "name": "\"...Now That's Rock 'N' Roll!\"",
        "description": "Characters shielded by <span style=\"color: #FFD780FF;\">Sweeping Fervor</span> deal 15% increased Physical DMG."
      },
      {
        "name": "A Rad Recipe",
        "description": "When a Perfect Cooking is achieved on a DEF-boosting dish, Xinyan has a 12% chance to obtain double the product."
      }
    ],
    "burst": {
      "name": "Riff Revolution",
      "description": "Strumming rapidly, Xinyan launches nearby opponents and deals Physical DMG to them, hyping up the crowd.\\nThe sheer intensity of the atmosphere will cause explosions that deal <span style=\"color: #FF9999FF;\">Pyro DMG</span> to nearby opponents.\\n\\n<i>Xinyan used to end all her performances with this move. She didn't stop because it was dangerous, however, but because she didn't have a more epic finale in case someone shouted \"Encore!\"</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Dance on Fire",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerform up to 4 consecutive strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\\nAt end of the sequence, perform a more powerful slash. \\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Sweeping Fervor",
      "description": "Xinyan brandishes her instrument, dealing <span style=\"color: #FF9999FF;\">Pyro DMG</span> on nearby opponents, forming a shield made out of her audience's passion.\\nThe shield's DMG Absorption scales based on Xinyan's DEF and on the number of opponents hit.\\n·Hitting 0–1 opponents grants Shield Level 1: Ad Lib.\\n·Hitting 2 opponents grants Shield Level 2: Lead-In.\\n·Hitting 3 or more opponents grants Shield Level 3: Rave, which will also deal intermittent <span style=\"color: #FF9999FF;\">Pyro DMG</span> to nearby opponents.\\n\\nThe shield has the following special properties:\\n·When unleashed, it infuses Xinyan with <span style=\"color: #FF9999FF;\">Pyro</span>.\\n·It has 250% DMG Absorption effectiveness against <span style=\"color: #FF9999FF;\">Pyro DMG</span>.\\n\\n<i>Xinyan insists that these pyrotechnics are the apex of performative art, and that they are physical phenomena that have nothing to do with her Vision.</i>",
      "priority": 5
    }
  },
  {
    "id": 46,
    "name": "Yae Miko",
    "description": "Lady Guuji of the Grand Narukami Shrine also serves as the editor-in-chief of Yae Publishing House. Unimaginable intelligence and cunning are hidden under her beautiful appearance.",
    "weapon": "catalyst",
    "rarity": "legendary",
    "vision": "electro",
    "profileImage": "yae miko",
    "statGrow": "critRate",
    "normalBossDrops": "Dragonheir's False Fin",
    "normalBossDropsImage": "dragonheirsfalsefin",
    "ascensionMats": "Sea Ganoderma",
    "ascensionMatsImage": "seaganoderma",
    "talentBooks": "Light",
    "weeklyBossDrops": "The Meaning of Aeons",
    "weeklyBossDropsImage": "themeaningofaeons",
    "constellations": [
      {
        "name": "Yakan Offering",
        "description": "Each time <span style=\"color: #FFD780FF;\">Great Secret Art: Tenko Kenshin</span> activates a Tenko Thunderbolt, Yae Miko will restore 8 Elemental Energy for herself."
      },
      {
        "name": "Fox's Mooncall",
        "description": "<span style=\"color: #FFD780FF;\">Sesshou Sakura</span> start at Level 2 when created, their max level is increased to 4, and their attack range is increased by 60%."
      },
      {
        "name": "The Seven Glamours",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Yakan Evocation: Sesshou Sakura</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Sakura Channeling",
        "description": "When <span style=\"color: #FFD780FF;\">Sesshou Sakura</span> lightning hits opponents, the <span style=\"color: #FFACFFFF;\">Electro DMG Bonus</span> of all nearby party members is increased by 20% for 5s."
      },
      {
        "name": "Mischievous Teasing",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Great Secret Art: Tenko Kenshin</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Forbidden Art: Daisesshou",
        "description": "<span style=\"color: #FFD780FF;\">The Sesshou Sakura's</span> attacks will ignore 60% of the opponents' DEF."
      }
    ],
    "passives": [
      {
        "name": "The Shrine's Sacred Shade",
        "description": "When casting <span style=\"color: #FFD780FF;\">Great Secret Art: Tenko Kenshin</span>, each Sesshou Sakura destroyed resets the cooldown for 1 charge of <span style=\"color: #FFD780FF;\">Yakan Evocation: Sesshou Sakura</span>."
      },
      {
        "name": "Enlightened Blessing",
        "description": "Every point of Elemental Mastery Yae Miko possesses will increase <span style=\"color: #FFD780FF;\">Sesshou Sakura</span> DMG by 0.15%."
      },
      {
        "name": "Meditations of a Yako",
        "description": "Has a 25% chance to get 1 regional Character Talent Material (base material excluded) when crafting. The rarity is that of the base material."
      }
    ],
    "burst": {
      "name": "Great Secret Art: Tenko Kenshin",
      "description": "Legends of \"kitsunetsuki,\" or the manifestation of a kitsune's might, are common in Inazuma's folktales. One that particularly captures the imagination is that of the Sky Kitsune, said to cause lightning to fall down upon the foes of the Grand Narukami Shrine. Summons a lightning strike, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>.\\nWhen she uses this skill, Yae Miko will unseal nearby Sesshou Sakura, destroying their outer forms and transforming them into Tenko Thunderbolts that descend from the skies, dealing <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span>. Each Sesshou Sakura destroyed in this way will create one Tenko Thunderbolt.\\n\\n<i>Only at times like these will Yae reveal her Sky Kitsune form and wield lightning itself. None have seen the Lady Guuji's tails and lived to tell the story... so remember, as far as you are concerned, Lady Yae does not have a tail.</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Spiritfox Sin-Eater",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nSummons forth kitsune spirits, initiating a maximum of 3 attacks that deal <span style=\"color: #FFACFFFF;\">Electro DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to deal <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> after a short casting time.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges towards the ground from mid-air, damaging all opponents in her path with thunderous might. Deals <span style=\"color: #FFACFFFF;\">AoE Electro DMG</span> upon impact with the ground.",
      "books": {},
      "bossItem": "the_meaning_of_aeons",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Yakan Evocation: Sesshou Sakura",
      "description": "To Yae, such dull tasks as can be accomplished by driving spirits out need not be done personally.\\nMoves swiftly, leaving a Sesshou Sakura behind.\\n\\n<span style=\"color: #FFD780FF;\">Sesshou Sakura</span>\\nHas the following properties:\\n· Periodically strikes one nearby opponent with lightning, dealing <span style=\"color: #FFACFFFF;\">Electro DMG</span>\\n· When there are other Sesshou Sakura nearby, their level will increase, boosting the DMG dealt by these lightning strikes.\\n\\nThis skill has three charges.\\nA maximum of 3 Sesshou Sakura can exist simultaneously. The initial level of each Sesshou Sakura is 1, and the initial highest level each sakura can reach is 3. If a new Sesshou Sakura is created too close to an existing one, the existing one will be destroyed.\\n\\n<i>\"The kitsune spirits sealed in the branches are all yakan who stooped to preying upon humans. The yakan are two grades lower than us Sky Kitsune, and so, I hardly see the problem with... asking that they do my bidding. Now, this doesn't mean that you humans should go learning from our grading systems, no indeed — and as for which of us, kitsune or human, is higher up in the pecking order... Heh, wouldn't you like to know?\"</i>",
      "books": {},
      "bossItem": "the_meaning_of_aeons",
      "priority": 5
    }
  },
  {
    "id": 47,
    "name": "Yanfei",
    "description": "A well-known legal adviser active in Liyue Harbor. A brilliant young lady in whose veins runs the blood of an illuminated beast.",
    "weapon": "catalyst",
    "rarity": "rare",
    "vision": "pyro",
    "profileImage": "yanfei",
    "statGrow": "pyroDamageBonus",
    "normalBossDrops": "Juvenile Jade",
    "normalBossDropsImage": "juvenilejade",
    "ascensionMats": "Noctilucous Jade",
    "ascensionMatsImage": "noctilucousjade",
    "talentBooks": "Gold",
    "weeklyBossDrops": "Bloodjade Branch",
    "weeklyBossDropsImage": "bloodjadebranch",
    "constellations": [
      {
        "name": "The Law Knows No Kindness",
        "description": "When Yanfei uses her Charged Attack, each existing Scarlet Seal additionally reduces the stamina cost of this Charged Attack by 10% and increases resistance against interruption during its release."
      },
      {
        "name": "Right of Final Interpretation",
        "description": "Increases Yanfei's Charged Attack CRIT Rate by 20% against enemies below 50% HP."
      },
      {
        "name": "Samadhi Fire-Forged",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Signed Edict</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Supreme Amnesty",
        "description": "When <span style=\"color: #FFD780FF;\">Done Deal</span> is used:\\nCreates a shield that absorbs up to 45% of Yanfei's Max HP for 15s.\\nThis shield absorbs <span style=\"color: #FF9999FF;\">Pyro DMG</span> 250% more effectively."
      },
      {
        "name": "Abiding Affidavit",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Done Deal</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Extra Clause",
        "description": "Increases the maximum number of Scarlet Seals by 1."
      }
    ],
    "passives": [
      {
        "name": "Proviso",
        "description": "When Yanfei consumes Scarlet Seals by using a Charged Attack, each Scarlet Seal will increase Yanfei's <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> by 5%. This effects lasts for 6s. When a Charged Attack is used again during the effect's duration, it will dispel the previous effect."
      },
      {
        "name": "Blazing Eye",
        "description": "When Yanfei's Charged Attack deals a CRIT Hit to opponents, she will deal an additional instance of <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> equal to 80% of her ATK. This DMG counts as Charged Attack DMG."
      },
      {
        "name": "Encyclopedic Expertise",
        "description": "Displays the location of nearby <span style=\"color: #FFD780FF;\">resources unique to Liyue</span> on the mini-map."
      }
    ],
    "burst": {
      "name": "Done Deal",
      "description": "Triggers a spray of intense flames that rush at nearby opponents, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>, granting Yanfei the maximum number of Scarlet Seals, and applying Brilliance to her.\\n\\n<span style=\"color: #FFD780FF;\">Brilliance</span>\\nHas the following effects:\\n·Grants Yanfei a Scarlet Seal at fixed intervals.\\n·Increases the DMG dealt by her Charged Attacks.\\nThe effects of Brilliance will end if Yanfei leaves the field or falls in battle.\\n\\n<i>\"Here are the full terms for this matter of life and death — by which I mean my life and your death!\"</i>",
      "priority": 4
    },
    "attack": {
      "name": "Normal Attack: Seal of Approval",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nShoots fireballs that deal up to three counts of <span style=\"color: #FF9999FF;\">Pyro DMG</span>.\\nWhen Yanfei's Normal Attacks hit enemies, they will grant her a single Scarlet Seal. Yanfei may possess a maximum of 3 Scarlet Seals, and each time this effect is triggered, the duration of currently possessed Scarlet Seals will refresh.\\nEach Scarlet Seal will decrease Yanfei's Stamina consumption and will disappear when she leaves the field.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes Stamina and all Scarlet Seals before dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> to opponents after a short casting time.\\nThis Charged Attack's AoE and DMG will increase according to the amount of Scarlet Seals consumed.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nGathering the power of Pyro, Yanfei plunges towards the ground from mid-air, damaging all opponents in her path. Deals <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> upon impact with the ground.",
      "priority": 5
    },
    "elementalSkill": {
      "name": "Signed Edict",
      "description": "Summons blistering flames that deal <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\nOpponents hit by the flames will grant Yanfei the maximum number of Scarlet Seals.\\n\\n<i>Apart from their legal uses, Yanfei's seals also come with her customized additional terms and conditions. Well, it's not as if the Ministry of Civil Affairs can change the laws of nature.</i>",
      "priority": 3
    }
  },
  {
    "id": 48,
    "name": "Yoimiya",
    "description": "Owner of Naganohara Fireworks. Known as \"Queen of the Summer Festival,\" she excels in her craft of creating fireworks that symbolize people's hopes and dreams.",
    "weapon": "bow",
    "rarity": "legendary",
    "vision": "pyro",
    "profileImage": "yoimiya",
    "statGrow": "critRate",
    "normalBossDrops": "Smoldering Pearl",
    "normalBossDropsImage": "smolderingpearl",
    "ascensionMats": "Naku Weed",
    "ascensionMatsImage": "nakuweed",
    "talentBooks": "Transience",
    "weeklyBossDrops": "Dragon Lord's Crown",
    "weeklyBossDropsImage": "dragonlordscrown",
    "constellations": [
      {
        "name": "Agate Ryuukin",
        "description": "The Aurous Blaze created by <span style=\"color: #FFD780FF;\">Ryuukin Saxifrage</span> lasts for an extra 4s.\\nAdditionally, when an opponent affected by Aurous Blaze is defeated within its duration, Yoimiya's ATK is increased by 20% for 20s."
      },
      {
        "name": "A Procession of Bonfires",
        "description": "When Yoimiya's <span style=\"color: #FF9999FF;\">Pyro DMG</span> scores a CRIT Hit, Yoimiya will gain a 25% <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> for 6s.\\nThis effect can be triggered even when Yoimiya is not the active character."
      },
      {
        "name": "Trickster's Flare",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Niwabi Fire-Dance</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Pyrotechnic Professional",
        "description": "When Yoimiya's own Aurous Blaze triggers an explosion, <span style=\"color: #FFD780FF;\">Niwabi Fire-Dance</span>'s CD is decreased by 1.2s."
      },
      {
        "name": "A Summer Festival's Eve",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Ryuukin Saxifrage</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Naganohara Meteor Swarm",
        "description": "During <span style=\"color: #FFD780FF;\">Niwabi Fire-Dance</span>, Yoimiya's Normal Attacks have a 50% chance of firing an extra Kindling Arrow that deals 60% of its original DMG. This DMG is considered Normal Attack DMG."
      }
    ],
    "passives": [
      {
        "name": "Tricks of the Trouble-Maker",
        "description": "During <span style=\"color: #FFD780FF;\">Niwabi Fire-Dance</span>, shots from Yoimiya's Normal Attack will increase her <span style=\"color: #FF9999FF;\">Pyro DMG Bonus</span> by 2% on hit. This effect lasts for 3s and can have a maximum of 10 stacks."
      },
      {
        "name": "Summer Night's Dawn",
        "description": "Using <span style=\"color: #FFD780FF;\">Ryuukin Saxifrage</span> causes nearby party members (not including Yoimiya) to gain a 10% ATK increase for 15s. Additionally, a further ATK Bonus will be added on based on the number of \"Tricks of the Trouble-Maker\" stacks Yoimiya possesses when using <span style=\"color: #FFD780FF;\">Ryuukin Saxifrage</span>. Each stack increases this ATK Bonus by 1%."
      },
      {
        "name": "Blazing Match",
        "description": "When Yoimiya crafts Decoration, Ornament, and Landscape-type Furnishings, she has a 100% chance to refund a portion of the materials used."
      }
    ],
    "burst": {
      "name": "Ryuukin Saxifrage",
      "description": "Yoimiya leaps into the air along with her original creation, the \"Ryuukin Saxifrage,\" and fires forth blazing rockets bursting with surprises that deal <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span> and mark one of the hit opponents with Aurous Blaze.\\n\\n<span style=\"color: #FFD780FF;\">Aurous Blaze</span>\\nAll Normal/Charged/Plunging Attacks, Elemental Skills, and Elemental Bursts by any party member other than Yoimiya that hit an opponent marked by Aurous Blaze will trigger an explosion, dealing <span style=\"color: #FF9999FF;\">AoE Pyro DMG</span>.\\nWhen an opponent affected by Aurous Blaze is defeated before its duration expires, the effect will pass on to another nearby opponent, who will inherit the remaining duration.\\n\\nOne Aurous Blaze explosion can be triggered every 2s. When Yoimiya is down, Aurous Blaze effects created through her skills will be deactivated.\\n\\n<i>Fireworks are man-made starlight, comets fired into the sky. Though they last for but an instant, the memory of their brilliance shall surely live on.</i>",
      "priority": 3
    },
    "attack": {
      "name": "Normal Attack: Firework Flare-Up",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 5 consecutive shots with a bow.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nPerforms a more precise <span style=\"color: #FFD780FF;\">Aimed Shot</span> with increased DMG.\\nWhile aiming, flames will accumulate on the arrowhead before being fired off as an attack. Has different effects based on how long the energy has been charged:\\n·Charge Level 1: Fires off a flaming arrow that deals <span style=\"color: #FF9999FF;\">Pyro DMG</span>.\\n·Charge Level 2: Generates a maximum of 3 Kindling Arrows based on time spent charging, releasing them as part of this Aimed Shot. Kindling Arrows will home in on nearby opponents, dealing <span style=\"color: #FF9999FF;\">Pyro DMG</span> on hit.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
      "priority": 5
    },
    "elementalSkill": {
      "name": "Niwabi Fire-Dance",
      "description": "Yoimiya waves a sparkler and causes a ring of saltpeter to surround her.\\n\\n<span style=\"color: #FFD780FF;\">Niwabi Enshou</span>\\nDuring this time, arrows fired by Yoimiya's Normal Attack will be Blazing Arrows, and their DMG will be increased and converted to <span style=\"color: #FF9999FF;\">Pyro DMG</span>. During this time, Normal Attack: Firework Flare-Up will not generate Kindling Arrows at Charge Level 2.\\n\\nThis effect will deactivate when Yoimiya leaves the field.\\n\\n<i>\"Niwabi\" is a form of incense firework created by Yoimiya herself. Its ability to be lit without any prior training or preparation has made it a real hit. After many fire-related incidents, the Tenryou Commission ordered the use of \"Niwabi\" banned, but small, bright sparks can often still be seen springing up at night. If seen from above, they look almost like little twinkling stars.</i>",
      "priority": 4
    }
  },
  {
    "id": 49,
    "name": "Yun Jin",
    "description": "A renowned Liyue opera singer who is skilled in both playwriting and singing. Her style is one-of-a-kind, exquisite and delicate, much like the person herself.",
    "weapon": "polearm",
    "rarity": "rare",
    "vision": "geo",
    "profileImage": "yun jin",
    "statGrow": "er",
    "normalBossDrops": "Riftborn Regalia",
    "normalBossDropsImage": "riftbornregalia",
    "ascensionMats": "Glaze Lily",
    "ascensionMatsImage": "glazelily",
    "talentBooks": "Diligence",
    "weeklyBossDrops": "Ashen Heart",
    "weeklyBossDropsImage": "ashenheart",
    "constellations": [
      {
        "name": "Thespian Gallop",
        "description": "<span style=\"color: #FFD780FF;\">Opening Flourish's</span> CD is decreased by 18%."
      },
      {
        "name": "Myriad Mise-En-Scène",
        "description": "After <span style=\"color: #FFD780FF;\">Cliffbreaker's Banner</span> is unleashed, all nearby party members' Normal Attack DMG is increased by 15% for 12s."
      },
      {
        "name": "Seafaring General",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Cliffbreaker's Banner</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Flower and a Fighter",
        "description": "When Yun Jin triggers the Crystallize Reaction, her DEF is increased by 20% for 12s."
      },
      {
        "name": "Famed Throughout the Land",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Opening Flourish</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Decorous Harmony",
        "description": "Characters under the effects of the <span style=\"color: #FFD780FF;\">Flying Cloud Flag Formation</span> have their Normal ATK SPD increased by 12%."
      }
    ],
    "passives": [
      {
        "name": "True to Oneself",
        "description": "Using <span style=\"color: #FFD780FF;\">Opening Flourish</span> at the precise moment when Yun Jin is attacked will unleash its Level 2 Charged (Hold) form."
      },
      {
        "name": "Breaking Conventions",
        "description": "The Normal Attack DMG Bonus granted by <span style=\"color: #FFD780FF;\">Flying Cloud Flag Formation</span> is further increased by 2.5%/5%/7.5%/11.5% of Yun Jin's DEF when the party contains characters of 1/2/3/4 Elemental Types, respectively."
      },
      {
        "name": "Light Nourishment",
        "description": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product."
      }
    ],
    "burst": {
      "name": "Cliffbreaker's Banner",
      "description": "Deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span> and grants all nearby party members a Flying Cloud Flag Formation.\\n\\n<span style=\"color: #FFD780FF;\">Flying Cloud Flag Formation</span>\\nWhen Normal Attack DMG is dealt to opponents, Bonus DMG will be dealt based on Yun Jin's current DEF.\\n\\nThe effects of this skill will be cleared after a set duration or after being triggered a specific number of times.\\nWhen one Normal Attack hits multiple opponents, the effect is triggered multiple times according to the number of opponents hit. The number of times that the effect is triggered is counted independently for each member of the party with Flying Cloud Flag Formation.\\n\\n<i>As the drums resound, as swords and halberds weave and clash, the doyenne is transformed into a mighty general.</i>\\n<i>As the instruments on stage strum in unison, lo, see how she vanquishes these demons!</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Cloud-Grazing Strike",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to five consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "books": {},
      "bossItem": "ashen_heart",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Opening Flourish",
      "description": "Ms. Yun may just be acting out fights on stage, but her skills with the spear are real enough to defend against her foes.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nFlourishes her polearm in a cloud-grasping stance, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nTakes up the Opening Flourish stance and charges up, forming a shield. DMG Absorption is based on Yun Jin's Max HP and has 150% effectiveness against all Elemental DMG and Physical DMG. The shield lasts until she finishes unleashing her Elemental Skill.\\nWhen the skill is released, when its duration ends, or when the shield breaks, Yun Jin will unleash the charged energy as an attack, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span>.\\nBased on the time spent charging, it will either unleash an attack at Charge Level 1 or Level 2.\\n\\n<i>One glorious moment on-stage, a decade of preparation behind it.</i>",
      "books": {},
      "bossItem": "ashen_heart",
      "priority": 4
    }
  },
  {
    "id": 50,
    "name": "Zhongli",
    "description": "A mysterious expert contracted by the Wangsheng Funeral Parlor. Extremely knowledgeable in all things.",
    "weapon": "polearm",
    "rarity": "legendary",
    "vision": "geo",
    "profileImage": "zhongli",
    "statGrow": "geoDamageBonus",
    "normalBossDrops": "Basalt Pillar",
    "normalBossDropsImage": "basaltpillar",
    "ascensionMats": "Cor Lapis",
    "ascensionMatsImage": "corlapis",
    "talentBooks": "Gold",
    "weeklyBossDrops": "Tusk of Monoceros Caeli",
    "weeklyBossDropsImage": "tuskofmonoceroscaeli",
    "constellations": [
      {
        "name": "Rock, the Backbone of Earth",
        "description": "Increases the maximum number of Stone Steles created by <span style=\"color: #FFD780FF;\">Dominus Lapidis</span> that may exist simultaneously to 2."
      },
      {
        "name": "Stone, the Cradle of Jade",
        "description": "<span style=\"color: #FFD780FF;\">Planet Befall</span> grants nearby characters on the field a Jade Shield when it descends."
      },
      {
        "name": "Jade, Shimmering through Darkness",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Dominus Lapidis</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Topaz, Unbreakable and Fearless",
        "description": "Increases <span style=\"color: #FFD780FF;\">Planet Befall</span>'s AoE by 20% and increases the duration of Planet Befall's Petrification effect by 2s."
      },
      {
        "name": "Lazuli, Herald of the Order",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Planet Befall</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Chrysos, Bounty of Dominator",
        "description": "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character.\\nA single instance of regeneration cannot exceed 8% of that character's Max HP."
      }
    ],
    "passives": [
      {
        "name": "Resonant Waves",
        "description": "When the Jade Shield takes DMG, it will Fortify:\\n·Fortified characters have 5% increased Shield Strength.\\nCan stack up to 5 times, and lasts until the Jade Shield disappears."
      },
      {
        "name": "Dominance of Earth",
        "description": "Zhongli deals bonus DMG based on his Max HP:\\n·Normal Attack, Charged Attack, and Plunging Attack DMG is increased by 1.39% of Max HP.\\n·<span style=\"color: #FFD780FF;\">Dominus Lapidis'</span> Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP.\\n·<span style=\"color: #FFD780FF;\">Planet Befall's</span> DMG is increased by 33% of Max HP."
      },
      {
        "name": "Arcanum of Crystal",
        "description": "Refunds 15% of the ore used when crafting Polearm-type weapons."
      }
    ],
    "burst": {
      "name": "Planet Befall",
      "description": "Brings a falling meteor down to earth, dealing massive <span style=\"color: #FFE699FF;\">Geo DMG</span> to opponents caught in its AoE and applying the <span style=\"color: #FFE699FF;\">Petrification</span> status to them.\\n\\n<span style=\"color: #FFD780FF;\">Petrification</span>\\nOpponents affected by the <span style=\"color: #FFE699FF;\">Petrification</span> status cannot move.\\n\\n<i>The falling meteor punishes the unjust.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Rain of Stone",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 6 consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, causing stone spears to fall along his path.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Dominus Lapidis",
      "description": "Every mountain, rock and inch of land is filled with the power of Geo, but those who can wield such powers freely are few and far between.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nCommands the power of earth to create a Stone Stele.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nCauses nearby Geo energy to explode, causing the following effects:\\n·If their maximum number hasn't been reached, creates a Stone Stele.\\n·Creates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP.\\n·Deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\n·If there are nearby targets with the <span style=\"color: #FFE699FF;\">Geo element</span>, it will drain a large amount of <span style=\"color: #FFE699FF;\">Geo element</span> from a maximum of 2 such targets. This effect does not cause DMG.\\n\\n<span style=\"color: #FFD780FF;\">Stone Stele</span>\\nWhen created, deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\nAdditionally, it will intermittently resonate with other nearby <span style=\"color: #FFE699FF;\">Geo constructs</span>, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span> to nearby opponents.\\nThe Stone Stele is considered a <span style=\"color: #FFE699FF;\">Geo construct</span> that can both be climbed and used to block attacks.\\nOnly one Stele created by Zhongli himself may initially exist at any one time.\\n\\n<span style=\"color: #FFD780FF;\">Jade Shield</span>\\nPossesses 150% DMG Absorption against all Elemental and Physical DMG.\\nCharacters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in a small AoE by 20%. This effect cannot be stacked.\\n\\n<i>A true master of stone may carve jade and shape gold.</i>",
      "priority": 5
    }
  },
  {
    "id": 51,
    "name": "Zhongli",
    "description": "A mysterious expert contracted by the Wangsheng Funeral Parlor. Extremely knowledgeable in all things.",
    "weapon": "polearm",
    "rarity": "legendary",
    "vision": "geo",
    "profileImage": "zhongli",
    "statGrow": "geoDamageBonus",
    "normalBossDrops": "Basalt Pillar",
    "normalBossDropsImage": "basaltpillar",
    "ascensionMats": "Cor Lapis",
    "ascensionMatsImage": "corlapis",
    "talentBooks": "Gold",
    "weeklyBossDrops": "Tusk of Monoceros Caeli",
    "weeklyBossDropsImage": "tuskofmonoceroscaeli",
    "constellations": [
      {
        "name": "Rock, the Backbone of Earth",
        "description": "Increases the maximum number of Stone Steles created by <span style=\"color: #FFD780FF;\">Dominus Lapidis</span> that may exist simultaneously to 2."
      },
      {
        "name": "Stone, the Cradle of Jade",
        "description": "<span style=\"color: #FFD780FF;\">Planet Befall</span> grants nearby characters on the field a Jade Shield when it descends."
      },
      {
        "name": "Jade, Shimmering through Darkness",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Dominus Lapidis</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Topaz, Unbreakable and Fearless",
        "description": "Increases <span style=\"color: #FFD780FF;\">Planet Befall</span>'s AoE by 20% and increases the duration of Planet Befall's Petrification effect by 2s."
      },
      {
        "name": "Lazuli, Herald of the Order",
        "description": "Increases the Level of <span style=\"color: #FFD780FF;\">Planet Befall</span> by 3.\\nMaximum upgrade level is 15."
      },
      {
        "name": "Chrysos, Bounty of Dominator",
        "description": "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character.\\nA single instance of regeneration cannot exceed 8% of that character's Max HP."
      }
    ],
    "passives": [
      {
        "name": "Resonant Waves",
        "description": "When the Jade Shield takes DMG, it will Fortify:\\n·Fortified characters have 5% increased Shield Strength.\\nCan stack up to 5 times, and lasts until the Jade Shield disappears."
      },
      {
        "name": "Dominance of Earth",
        "description": "Zhongli deals bonus DMG based on his Max HP:\\n·Normal Attack, Charged Attack, and Plunging Attack DMG is increased by 1.39% of Max HP.\\n·<span style=\"color: #FFD780FF;\">Dominus Lapidis'</span> Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP.\\n·<span style=\"color: #FFD780FF;\">Planet Befall's</span> DMG is increased by 33% of Max HP."
      },
      {
        "name": "Arcanum of Crystal",
        "description": "Refunds 15% of the ore used when crafting Polearm-type weapons."
      }
    ],
    "burst": {
      "name": "Planet Befall",
      "description": "Brings a falling meteor down to earth, dealing massive <span style=\"color: #FFE699FF;\">Geo DMG</span> to opponents caught in its AoE and applying the <span style=\"color: #FFE699FF;\">Petrification</span> status to them.\\n\\n<span style=\"color: #FFD780FF;\">Petrification</span>\\nOpponents affected by the <span style=\"color: #FFE699FF;\">Petrification</span> status cannot move.\\n\\n<i>The falling meteor punishes the unjust.</i>",
      "priority": 5
    },
    "attack": {
      "name": "Normal Attack: Rain of Stone",
      "description": "<span style=\"color: #FFD780FF;\">Normal Attack</span>\\nPerforms up to 6 consecutive spear strikes.\\n\\n<span style=\"color: #FFD780FF;\">Charged Attack</span>\\nConsumes a certain amount of Stamina to lunge forward, causing stone spears to fall along his path.\\n\\n<span style=\"color: #FFD780FF;\">Plunging Attack</span>\\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
      "priority": 3
    },
    "elementalSkill": {
      "name": "Dominus Lapidis",
      "description": "Every mountain, rock and inch of land is filled with the power of Geo, but those who can wield such powers freely are few and far between.\\n\\n<span style=\"color: #FFD780FF;\">Press</span>\\nCommands the power of earth to create a Stone Stele.\\n\\n<span style=\"color: #FFD780FF;\">Hold</span>\\nCauses nearby Geo energy to explode, causing the following effects:\\n·If their maximum number hasn't been reached, creates a Stone Stele.\\n·Creates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP.\\n·Deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\n·If there are nearby targets with the <span style=\"color: #FFE699FF;\">Geo element</span>, it will drain a large amount of <span style=\"color: #FFE699FF;\">Geo element</span> from a maximum of 2 such targets. This effect does not cause DMG.\\n\\n<span style=\"color: #FFD780FF;\">Stone Stele</span>\\nWhen created, deals <span style=\"color: #FFE699FF;\">AoE Geo DMG</span>.\\nAdditionally, it will intermittently resonate with other nearby <span style=\"color: #FFE699FF;\">Geo constructs</span>, dealing <span style=\"color: #FFE699FF;\">Geo DMG</span> to nearby opponents.\\nThe Stone Stele is considered a <span style=\"color: #FFE699FF;\">Geo construct</span> that can both be climbed and used to block attacks.\\nOnly one Stele created by Zhongli himself may initially exist at any one time.\\n\\n<span style=\"color: #FFD780FF;\">Jade Shield</span>\\nPossesses 150% DMG Absorption against all Elemental and Physical DMG.\\nCharacters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in a small AoE by 20%. This effect cannot be stacked.\\n\\n<i>A true master of stone may carve jade and shape gold.</i>",
      "priority": 5
    }
  }
]
